Repository: JorisE/Gramps
Catalog: src/po/*.po
Languages: es, fr

source: Export GEDCOM
es: Exportar GEDCOM
fr: Exporter un fichier GEDCOM

source: Export GEDCOM file
es: Exportar archivo GEDCOM
fr: Exporter un fichier GEDCOM

source: Export to GEDCOM
es: Exportar a GEDCOM
fr: Exporter au format GEDCOM

source: Extract information from names
es: Extraer la información de los nombres
fr: Extraction de données à partir du Nom

source: Facts and Events
es: Hechos y Eventos
fr: Faits et Évènements

source: Failed to load the module: %s
es: Fallo en cargar el modulo: %s
fr: Échec lors du chargement du module : %s

source: Families
es: Familias
fr: Familles

source: Family
es: Familia
fr: Famille

source: Family Group Report
es: Reporte del Grupo Familiar
fr: Édition d'un group familial

source: Family Group Report for %s
es: Reporte del Grupo Familiar para %s
fr: Édition du groupe familial de %s

source: Family Information
es: Información Familiar
fr: Information sur la famille

source: Family Tree
es: Árbol Familiar
fr: Arbre Familial

source: Family Tree - Index
es: Árbol Familiar - Índice
fr: Arbre Familial - Index

source: Family Tree Index
es: Índice del Árbol Familiar
fr: Index de l'arbre familial

source: Father
es: Padre
fr: Père

source: February
es: Febrero
fr: Février

source: Female
es: Mujer
fr: Féminin

source: Females
es: Mujeres
fr: Femmes

source: Fifteenth
es: Decimoquinto
fr: Quinzième

source: Fifth
es: Quinto
fr: Cinquième

source: File
es: Archivo
fr: Fichier

source: File Prefix
es: Prefijo del Archivo
fr: Préfixe du fichier

source: Filter
es: Filtro
fr: Filtre

source: Find Person by Name
es: Encontrar Persona por su Nombre
fr: Trouver la personne par son Nom

source: First
es: Primero
fr: Première

source: First Communion
es: Primera Comunión
fr: Première Communion

source: First Person
es: Primera Persona
fr: Première Personne

source: Firstname Surname
es: Nombre Apellido
fr: Prénom Nom

source: Font
es: Fuente
fr: Police

source: Font Options
es: Opciones de Fuentes
fr: Options de Police

source: For more information or to get a copy of GraphViz, goto http://www.graphviz.org
es: Para mayor información o para obtener una copia de GraphViz, vaya ahttp://www.graphviz.org
fr: Pour plus d'informations ou pour obtenir GraphViz, voir http://www.graphviz.org

source: Format
es: Formato

source: Formats
es: Formatos

source: Foster
es: Adoptivo
fr: Élever

source: Fourteenth
es: Decimocuatro
fr: Quatorzième

source: Fourth
es: Cuarto
fr: Quatrième

source: GEDCOM Export
es: GEDCOM Exportar
fr: Exporter un fichier GEDCOM

source: GEDCOM Import
es: GEDCOM Importar
fr: Importer un fichier GEDCOM

source: GEDCOM Import Progress
es: GEDCOM Progreso de la Importación
fr: Importation GEDCOM en cours ...

source: GEDCOM Import Status
es: GEDCOM Estado de la Importación
fr: Avancement de l'importation GEDCOM

source: GEDCOM Read Progress
es: GEDCOM Progreso de Lectura
fr: Lecture du fichier GEDCOM en cours ...

source: GEDCOM file
es: Archivo GEDCOM
fr: Fichier GEDCOM

source: Gallery
es: Galería
fr: Galerie

source: Gender
es: Género
fr: Genre

source: Generate Files
es: Generar Archivos
fr: Générer des fichiers

source: Generate HTML reports
es: Generar reportes HTML
fr: Génération d'éditions HTML

source: Generate Relationship Graphs
es: Generar Graficos de Relaciones
fr: Générer un graphe relationnel

source: Generate SoundEx codes
es: Generar códigos SoundEx
fr: Génération des SoundEx

source: Generate Web Site
es: Generar Sitio Web
fr: Générer un Site Web

source: Generate an Ancestor Graph
es: Generar Gráfico de Ancestros
fr: Générer un diagramme des ancêtres

source: Generate reports
es: Generar reportes
fr: Générer des listes

source: Generates SoundEx codes for names
es: Genera códigos SoundEx para los nombres
fr: Générations de soundEx de noms

source: Generates a list of descendants of the active person
es: Genera una lista de descendientes de la persona activa
fr: Générer une liste des descendants de la personne choisie

source: Generates relationship graphs, currently only in GraphViz format.
es: Genera gráficos de relaciones, actualmente solo en formato GraphViz.
fr: Générer des graphes relationnels, au format standard GraphViz.

source: Generates web (HTML) pages for individuals, or a set of individuals.
es: Genera páginas web (HTML) para individuos, o grupos de individuos.
fr: Générer des pages web (HTML) pour tout ou partie des individus.

source: Generation %d has %d individuals.
es: La generación %d contiene %d indidivuos.
fr: La génération %d contient %d individus.

source: Generation %d has 1 individual.
es: La generación %d contiene 1 Indidivuo.
fr: La génération %d contient 1 individu.

source: Generations
es: Generaciones
fr: Générations

source: Given Name
es: Nombre común
fr: Prénom

source: Go
es: Ir

source: Go to Bookmark
es: Ir a las Marcapáginas
fr: Aller à l'annuaire

source: Graduation
es: Graduación
fr: Diplôme

source: Gramps (Genealogical Research and Analysis Management Programming System) is a personal genealogy program that can be extended by using the Python programming language.
es: Gramps (Sistema de Manejo de Información y Análisis Genalógico) es un programa de genealogía personal que puede ser ampliado usando el lenguaje de programación Python
fr: Gramps (Genealogical Research et Analysis Management Programming System) est un logiciel de généalogie individuelle qui peut être étendu par l'usage du langage de programmation Python.

source: Gramps - Add Child
es: Gramps - Agregar Hijo
fr: Gramps - Ajouter un enfant

source: Gramps - Add New Child
es: Gramps - Agregar Otro Hijo
fr: Gramps - Ajouter un nouvel enfant

source: Gramps - Address Editor
es: Gramps - Editor de Direcciones
fr: Gramps - Éditeur de sources

source: Gramps - Ahnentafel Report
es: Gramps - Reporte Ahnentafel
fr: Gramps - Liste Ahnentafel

source: Gramps - Alternate Name Editor
es: Gramps - Editor de Nombres Alternativo
fr: Gramps - Éditeur de styles

source: Gramps - Ancestor Chart
es: Gramps - Carta de Ancestros
fr: Gramps - Arbre Généalogique

source: Gramps - Attribute Editor
es: Gramps - Editor de Atributos
fr: Gramps - Éditeur de styles

source: Gramps - Choose Parents
es: Gramps - Escoger Padres
fr: Gramps - Choix des parents

source: Gramps - Choose Spouse
es: Gramps - Escoger Conyuge
fr: Gramps - Choix des époux(se)

source: Gramps - Database Summary
es: Gramps - Resumen de la Base de Datos
fr: Gramps - Image de la Base

source: Gramps - Database Verify
es: Gramps - Verificar Base de Datos
fr: Gramps - Vérification de la Base

source: Gramps - Delete a currently used Place
es: Gramps - Borrar un Lugar que se este usando
fr: Gramps - Supprimer un lieu attribué

source: Gramps - Descendant Browser
es: Gramps - Navegador de Desendencia
fr: Gramps - Nagivateur de descendance

source: Gramps - Descendant Report
es: Gramps - Reporte de Descendencia
fr: Gramps - Liste de descendants

source: Gramps - Document Styles
es: Gramps - Tipos de Documentos
fr: Gramps - Styles de document

source: Gramps - Edit Bookmarks
es: Gramps - Editor de Marcapáginas
fr: Gramps - Afficher l'annuaire

source: Gramps - Edit Note
es: Gramps - Editor de Notas
fr: Gramps - Afficher la notes

source: Gramps - Edit Person
es: Gramps - Editor de Personas
fr: Gramps - Afficher la personne

source: Gramps - Event Comparison
es: Gramps - Comparar Eventos
fr: Gramps - Comparaison d'évènements

source: Gramps - Event Editor
es: Gramps - Editor de Eventos
fr: Gramps - Éditeur de styles

source: Gramps - Family Group Report
es: Gramps - Reporte de un Grupo Familiar
fr: Gramps - Liste d'un groupe familial

source: Gramps - Find person
es: Gramps - Encontrar persona
fr: Gramps - Afficher la personne

source: Gramps - GEDCOM Import
es: Gramps - Importat GEDCOM
fr: Gramps - Importation GEDCOM

source: Gramps - Getting Started
es: Gramps - Empezando
fr: Gramps - Démarrage

source: Gramps - Gramps import
es: Gramps - Importar gramps
fr: Gramps - Importation Gramps

source: Gramps - Individual Summary
es: Gramps - Resúmen de un Individuo
fr: Gramps - Image d'un individu

source: Gramps - Internet Address Editor
es: Gramps - Editor de Direcciones Internet
fr: Gramps - Éditeur de styles

source: Gramps - Marriage Editor
es: Gramps - Editor de Matrimonios
fr: Gramps - Affichage du marriage

source: Gramps - Marriage/Relationship Editor
es: Gramps - Editor de Matrimonios/Relaciones
fr: Gramps - Mariage/Affichage des relations

source: Gramps - Merge People
es: Gramps - Mezclar Personas
fr: Gramps - Fusion d'individus

source: Gramps - Name and Title Extraction Tool
es: Gramps - Herramienta para Extraer Nombre y Título
fr: Gramps - Outil d'extraction du Nom et du Titre

source: Gramps - Place Editor
es: Gramps - Editor de Lugares
fr: Gramps - Affichage des Lieux

source: Gramps - Plugin Selection
es: Gramps - Seleccionar Accesorio
fr: Gramps - Sélection automatique

source: Gramps - Preferences
es: Gramps - Preferencias
fr: Gramps - Préférences

source: Gramps - Relationship Calculator
es: Gramps - Calculador de Relaciones
fr: Gramps - Calcul relationnel

source: Gramps - Report Selection
es: Gramps - Seleccionar Reporte
fr: Gramps - Sélection d'une liste

source: Gramps - Select File
es: Gramps - Seleccionar Archivo
fr: Gramps - Sélection d'un fichier

source: Gramps - Select a picture
es: Gramps - Seleccionar imágen
fr: Gramps - Sélection d'une image

source: Gramps - Select default database directory
es: Gramps - Seleccionar un directorio predefinido de bases de datos
fr: Gramps - Sélection du répertoire de données

source: Gramps - Select default report directory
es: Gramps - Seleccionar un directorio predefinido de reportes
fr: Gramps - Sélection du répertoire de listes

source: Gramps - SoundEx Code Generator
es: Gramps - Generar Código SoundEx
fr: Gramps - Générateur de SoundEx

source: Gramps - Source Editor
es: Gramps - Editor de Referencias
fr: Gramps - Éditeur de sources

source: Gramps - Source Information
es: Gramps - Información de las Referencias
fr: Gramps - Données sur la source

source: Gramps - Style Editor
es: Gramps - Editor de Estilos
fr: Gramps - Éditeur de styles

source: Gramps Import
es: Importar Gramps
fr: Importer une Base Gramps

source: Gramps Startup Druid
es: Guía de Inicialización para Gramps
fr: Démarrage du druide Gramps

source: Gramps file
es: Archivo Gramps
fr: Fichier Gramps

source: Grandparent's ancestors and descendants
es: Ancestros y descencientes de los abuelos
fr: Ancêtres et descendants des Grands-parents

source: GraphViz (dot) can transform the graph into postscript, jpeg, png, vrml, svg, and many other formats.
es: GraphViz (dot) puede transformar el gráfico a postscript, jpeg, png, vrml, svg, y muchos otros formatos.
fr: GraphViz (dot) peut transformer le graphique en PostScript, jpeg, png, vrml, svg, et bien d'autres formats.

source: GraphViz File
es: Archivo GraphViz
fr: Fichier GraphViz

source: HTML Template
es: Planilla HTML
fr: Norme HTML

source: He died in the year %s
es: El murió en el año %s
fr: il mourut en l'an %s

source: He died in the year %s in %s
es: El murió en el año %s en %s
fr: il mourut en l'an %s à %s

source: He died on %s
es: El murió en %s
fr: il mourut en %s

source: He died on %s in %s
es: El murió en %s en %s
fr: il mourut en %s à %s

source: Help is not implemented yet
es: La Ayuda aún no ha sido implementada
fr: Aide pas encore prête

source: Hide people not likely to be a child of this family
es: La persona escondida probablemente no es hijo de esta familia
fr: Cacher les enfants peu probables pour cette famille

source: High
es: Alto
fr: Haut

source: Home
es: Inicio
fr: de Cujus

source: Identification
es: Identificación

source: Identification Number
es: Número de Identificació
fr: Identifiant

source: Image
es: Imágen

source: Images and files
es: Imágenes y archivos
fr: Images et fichiers

source: Immigration
es: Inmigración
fr: Émigration

source: Import from Gramps
es: Importar desde Gramps
fr: Importer une Base Gramps

source: Include a link to the index page
es: Incluir un enlace al índice
fr: Inclure un lien vers une page d'index

source: Individual
es: Individuo
fr: Individu

source: Individual Facts
es: Datos del Individuo
fr: Actes Individuels

source: Individual Summary
es: Resúmen del Individuo
fr: Image d'un individu

source: Individual web pages
es: Páginas web del individuo
fr: Page Web Individuelle

source: Individuals
es: Individuos
fr: Individus

source: Individuals missing birth dates
es: Faltan fechas de nacimientos de varios individuos
fr: Individus sans dates de naissance

source: Individuals with images
es: Individuos con imágenes
fr: Individus ayant photos

source: Individuals with incomplete names
es: Individuos con nombres incompletos
fr: Nom d'individus incomplet

source: Interactive descendant browser
es: Navegador interactivo de descendientes
fr: Navigation interactive parmi les descendants

source: Internet Address Editor
es: Editor de Direcciones Internet
fr: Éditeur d'adresse Internet

source: Internet Address Editor for %s
es: Editor de Direcciones Internet para %s
fr: Éditeur d'adresse Internet pour %s

source: Internet Addresses
es: Direcciones Internet
fr: Adresses Internets

source: Invert
es: Voltear
fr: Inverse

source: Italic
es: Itálicas

source: January
es: Enero
fr: Janvier

source: July
es: Julio
fr: Juillet

source: June
es: Junio
fr: Juin

source: Keep other name as an alternate name
es: Manener el otro nombre como un nombre alternativo
fr: Conserver les autres (pré)noms comme alternative

source: Landscape
es: Paisaje
fr: Paysage

source: Latitude
es: Latitud

source: Left Margin
es: Margen Izquierdo
fr: Marge de gauche

source: Letter
es: Carta

source: List display options
es: Muestra las opciones de despliegue
fr: Options de liste

source: List exceptions to assertions or checks about the database
es: Muestra las excepciones a las afirmaciones o verificaciones de la base de datos
fr: Liste les exceptions et les assertions ou vérifie la base de données

source: Load
es: Cargar
fr: Chargement

source: Loading %s ...
es: Cargando %s ...
fr: Charge %s ...

source: Location
es: Lugar

source: Location Editor
es: Editor de Lugares
fr: Affichage de l'endroit

source: Location Editor for %s
es: Editor de Lugares para %s
fr: Édition Ahnentafel pour %s

source: Longitude
es: Longitud

source: Low
es: Bajo
fr: Bas

source: MM-DD-YYYY
es: MM-DD-AAAA
fr: MM-JJ-AAAA

source: MM.DD.YYYY
es: MM.DD.AAAA
fr: MM.JJ.AAAA

source: MM/DD/YYYY
es: MM/DD/AAAA
fr: MM/JJ/AAAA

source: MM/DD/YYYY, MM.DD.YYYY, or MM-DD-YYYY
es: MM/DD/AAAA, MM.DD.AAAA, o MM-DD-AAAA
fr: MM/JJ/AAAA, MM.JJ.AAAA, ou MM-JJ-AAAA

source: MON Day, Year
es: MES Día, Año
fr: MOI Jour, Année

source: Make Primary
es: Transformar a Principal
fr: Mettre en premier

source: Make the active person the default person
es: Transforma a la persona activada en la persona predefinida
fr: Sélectionner l'individu

source: Make the current father the active person
es: Transforma al padre actual en la persona activa
fr: Sélectionner le père en cours

source: Make the current mother the active person
es: Transforma a la madre actual en la persona activa
fr: Sélectionner la mère en cours

source: Make the default person the active person
es: Transforma a la persona predefinida en la persona activa
fr: Sélectionner le 'de Cujus'

source: Make the selected child the active person
es: Transforma al hijo seleccionado en la person activa
fr: Sélectionner l'enfant en cours

source: Male
es: Hombre
fr: Masculin

source: Males
es: Hombres
fr: Hommes

source: March
es: Marzo
fr: Mars

source: Marriage
es: Matrimonio
fr: Mariage

source: Marriage Contract
es: Contrato de Matrimonio
fr: Contrat de mariage

source: Marriage Editor
es: Editor de Matrimonio
fr: Éditeur de mariage

source: Marriage License
es: Licencia de Matrimonio
fr: Publication du mariage

source: Marriage Settlement
es: Arreglo de Matrimonio
fr: Contrat de mariage

source: Marriage date
es: Fecha de Matrimonioo
fr: Date du mariage

source: Marriage place
es: Lugar de Matrimonio
fr: Lieu du mariage

source: Marriage/Relationship Editor
es: Editor de Matrimonio/Relación
fr: Mariage/Affichage des relations

source: Marriages/Children
es: Matrimonios/Hijos
fr: Mariages/Enfants

source: Married
es: Casado
fr: Marié(e)

source: Match Rating :
es: Nivel de Concordancia :

source: Match Threshold
es: Umbral de Concordancia

source: Maximum Generations
es: Número Máximo de Generaciones
fr: Nombre de générations maximum

source: Maximum age
es: Edad Límite
fr: Age Maximal

source: Maximum age to bear a child
es: Edad límite para estar embarazada
fr: Age Maximal pour porter un enfant

source: Maximum age to father a child
es: Edad límite para procrear un hijo
fr: Age Maximal pour adopter un enfant

source: Maximum age to marry
es: Edad límite para casarse
fr: Age Maximal pour se marier

source: Maximum husband-wife age difference
es: Diferencia máxima de años entre marido y mujer
fr: Différence d'age Maximale entre époux

source: Maximum number of children
es: Número límite de hijos
fr: Nombre Maximal d'enfants

source: Maximum number of consecutive years of widowhood
es: Número límite de años consecutivos de viudez
fr: Nombre Maximal d'années consécutives de veuvage

source: Maximum number of spouses for a person
es: Número límite de conyuger para un individuo
fr: Nombre maximal d'épouses pour une personne

source: Maximum number of years between children
es: Número límite de años entre un hijo y otro
fr: Nombre Maximal d'années entre enfants

source: Maximum span of years for all children
es: Número límite de años entre el primer hijo y el último
fr: Étendue Maximale d'années du premier au dernier enfant

source: May
es: Mayo
fr: Mai

source: Medical Information
es: Información Médica
fr: Information médicale

source: Men
es: Hombre
fr: Homme

source: Merge
es: Mezclar
fr: Fusion

source: Merge People
es: Mezclar Personas
fr: Fusion d'individus

source: Merge people
es: Mezclar personas
fr: Fusion d'individus

source: Military Service
es: Servicio Militar
fr: Service Militaire

source: Minimum age to bear a child
es: Edad mínima para estar embarazada
fr: Age minimal pour porter un enfant

source: Minimum age to father a child
es: Edad mínima para tener un hijo
fr: Age minimal pour adopter un enfant

source: Minimum age to marry
es: Edad mínima para casarse
fr: Age Minimal pour se marier

source: Month Day, Year
es: Mes Día, Año
fr: Mois Jour, Année

source: Mother
es: Madre
fr: Mère

source: Name
es: Nombre
fr: Nom

source: Name Format
es: Formato del Nombre
fr: Format du nom

source: Name and Title Extraction Tool
es: Herramienta de Extracción de Nomre y Título
fr: Outil d'extraction de Nom et de Titre

source: Name used to generate SoundEx code
es: Nombre usado para generar el código SoundEx
fr: Nom utilisé pour générer le SoundEx

source: Names
es: Nombres
fr: Noms

source: Names that contain a substring
es: Nombres que contienen los caracteres
fr: Noms qui contiennent une chaîne

source: Names that match a regular expression
es: Nombres que coinciden una expresión regular
fr: Noms qui répondent à une expression régulière

source: Names with same SoundEx code as ...
es: Nombres con el mismo código SoundEx que ...
fr: Noms avec le même SoundEx que ...

source: Names with the specified SoundEx code
es: Nombres con el código SoundEx especificado
fr: Noms avec un SoundEx particulier

source: National Origin
es: País de Nacimiento
fr: Nationalité

source: Naturalization
es: Naturalización
fr: Naturalisation

source: Neither %s nor %s are directories
es: Ni %s ni %s son directorios
fr: Ni %s ni %s ne sont des répertoires

source: New Database
es: Nueva Base de Datos
fr: Nouvelle Base

source: New Person
es: Nueva Persona
fr: Nouvelle Personne

source: Nick Name
es: Apodo
fr: Surnom

source: Nineteenth
es: Decimonoveno
fr: dix-neuvième

source: Ninth
es: Noveno
fr: Neuvième

source: No Addresses
es: Sin Dirección
fr: Pas d'adresses

source: No Alternate Names
es: Sin Nombre Alternativo
fr: Pas d'autres Noms

source: No Attributes
es: Sin Atributos
fr: Pas d'attributs

source: No Events
es: Sin Evento
fr: Évènements

source: No default/home person has been set
es: No se ha establecido una persona predefinida
fr: 'de Cujus' non défini

source: No definition available
es: No hay una definición disponible
fr: Aucune description disponible

source: No description
es: Sin descripción
fr: Pas de description

source: No description was provided
es: No se dió una descripción
fr: Aucune description fournie

source: No errors were found
es: No se encontraron errores
fr: Aucune erreur détectée

source: No legal or common-law relationship between man and woman
es: Ninguna relación legal o informal entre hombre y mujer
fr: Relation non légalisée entre un homme et une femme

source: No titles or nicknames were found
es: No se encontraron títulos o apodos
fr: Aucun Titre ou Surnom détectés

source: None
es: Ninguno
fr: Aucun(e)

source: Note
es: Nota

source: Notes
es: Notas

source: November
es: Noviembre
fr: Novembre

source: Number of Errors
es: Número de Errores
fr: Nombre d'erreurs

source: Number of Families
es: Número de Familias
fr: Nombre de familles

source: Number of People
es: Número de Personas
fr: Nombre de personnes

source: Number of ancestors
es: Número de ancestros
fr: Nombre d'erreurs

source: Number of ancestors of "%s" by generation
es: Número de ancestros de "%s" por generación
fr: Nombre d'ancêtres de "%s" par génération

source: Number of families
es: Número de familias
fr: Nombre de familles

source: Number of individuals
es: Número de individuos
fr: Nombre d'individus

source: OK
es: Si

source: Occupation
es: Ocupación
fr: Profession

source: October
es: Octubre
fr: Octobre

source: Odd Row Background
es: Plano de Fondo con Filas Impares
fr: Couleur de fond (lignes impaires)

source: Odd Row Foreground
es: Plano Principal con Filas Impares
fr: Couleur du texte (lignes impaires)

source: Open
es: Abrir
fr: Ouvrir

source: Open File
es: Abrir Archivo
fr: Ouvrir une Base

source: OpenOffice Spreadsheet
es: Hoja de Cálculo de OpenOffice
fr: Tableur OpenOffice

source: Options
es: Opciones

source: Ordination
es: Ordenanza

source: Orientation
es: Orientación

source: Other
es: Otro
fr: Autre

source: Other Names
es: Otros Nombres
fr: Autres Noms

source: Output File
es: Archivo de Salida
fr: Fichier de sortie

source: P_laces
es: L_ugares
fr: _Lieux

source: Padding
es: Acolchonamiento
fr: Tapis

source: Page break between generations
es: Fín de página entre generaciones
fr: Saut de page entre les générations

source: Pages
es: Páginas

source: Paper
es: Papel
fr: Papier

source: Paper Orientation
es: Orientación del Papel
fr: Orientation du papier

source: Paper Size Selection
es: Seleccionar Tamaño del Papel
fr: Sélection du format papier

source: Paragraph Options
es: Opciones de Párrafo
fr: Options de paragraphe

source: Paragraph Style
es: Estilo de Párrafo
fr: Style de paragraphe

source: Parent
es: Padre

source: Parent Relationship
es: Relación de Padre
fr: Génération d'un graphe relationnel

source: Parents
es: Padres

source: Partners
es: Compañeros
fr: Partenaires

source: Pe_digree
es: Ár_bol Genealógico
fr: _Arborescence

source: Pedigree
es: Ár_bol Genealógico
fr: Arborescence

source: People
es: Personas
fr: Individus

source: People somehow connected to %s
es: Personas relacionadas de alguna forma con %s
fr: Individus plus ou moins liés à %s

source: People who have an event type of ...
es: Personas que tiene un evento del tipo ...
fr: Individus ayant un évènement de ce type ...

source: People who have images
es: Personas que tienen imágenes
fr: Individus ayant des images

source: People who were adopted
es: Personas que son adoptadas
fr: Individus ayant été adoptés

source: People with an event after ...
es: Personas con un evento posterior a ...
fr: Individus ayant un évènement après ...
