Repository: JorisE/Gramps
Catalog: src/po/*.po
Languages: es, fr

source: People with an event before ...
es: Personas con un evento anterior a ...
fr: Individus ayant un évènement avant ...

source: People with an event location of ...
es: Personas con un evento en la localidad de ...
fr: Individus ayant un évènement à ...

source: People with children
es: Personas con hijos
fr: Individus ayant des enfants

source: People with incomplete names
es: Personas con nombres incompletos
fr: Individus ayant des noms incomplets

source: People with multiple marriage records
es: Personas con varios matrimonios
fr: Individus ayant contracté plusieurs mariages

source: People with no marriage records
es: Personas sin matrimonios
fr: Individus sans aucun mariage

source: People without a birth date
es: Personas sin una fecha de nacimiento
fr: Individus sans date de naissance

source: Person
es: Persona
fr: Personne

source: Phone
es: Teléfono
fr: téléphone

source: Pick a Font
es: Escoge un Archivo Fuente
fr: Choisir une police

source: Pick a color
es: Escoge un color
fr: Choisir une couleur

source: Place
es: Lugar
fr: Lieu

source: Place Editor
es: Editor de Lugares
fr: Éditeur de lieux

source: Place Name
es: Editor de Nombres
fr: Nom de Lieu

source: Places
es: Lugares
fr: Lieux

source: Please be patient. This may take a while.
es: Paciencia por favor. Esto puede tardarse un poco.
fr: Veuillez patienter S.V.P, ça risque de durer un peu.

source: Please check the person's marriages.
es: Por favor verifique la información del matrimonio de esta persona
fr: Vérifiez svp vos mariages.

source: Please enjoy using Gramps.
es: Disfrute usar Gramps
fr: Amusez vous bien avec Gramps.

source: Please enter the following information. You can change it at anytime in the program's preference settings
es: Por favor ingrese la siguiente información. Ud. puede cambiarla en cualquier momento en la sección de escoger preferencias del programa
fr: Veuillez saisir les informations suivantes. Vous pourrez les modifier à loisir par la suite

source: Preferred Output Format
es: Formato de Salida Predilecto
fr: Format de sortie préféré

source: Preferred Paper Size
es: Tamaño de Papel Predilecto
fr: Format de papier préféré

source: Preview
es: Avance
fr: Aperçu

source: Print
es: Imprimir
fr: Imprimer

source: Privacy Options
es: Opciones de Privacidad
fr: Options Personnelles

source: Private
es: Privado
fr: privée

source: Private Record
es: Registro Privado
fr: Enregistrement Privé

source: Probate
es: Legalizar
fr: Validation

source: Produces a detailed report on the selected person.
es: Entrega un reporte detallado de la persona seleccionada
fr: Produit un rapport détaillé de la personne sélectionnée.

source: Produces a detailed textual ancestral report
es: Entrega un texto con el reporte detallado de los ancestros

source: Produces a graphical ancestral tree graph
es: Entrega una imágen con el árbol genealógico de loa ancestros
fr: Produit un arbre généalogique

source: Produces a textual ancestral report
es: Entrega un texto con el reporte de los ancestros
fr: Produit une liste généalogique de n générations

source: Property
es: Propiedad
fr: Propriété

source: Provides a browsable hierarchy based on the active person
es: Entrega una jerarquía navegable basada en la persona activa
fr: Permet une navigation hiérarchique sur la personne sélectionnée

source: Provides a summary of the current database
es: Entrega un resúmen de la base de datos actual
fr: Fournit une image de la Base de donnée en cours

source: Publication Info
es: Información de la Publicación

source: Publication Information
es: Información de la Publicación
fr: Information de publication

source: Qualifier
es: Calificador
fr: Qualificatif

source: Relationship
es: Relación
fr: Relation

source: Relationship Type
es: Tipo de Relación
fr: Type de relation

source: Relationship calculator
es: Calculador de Relación
fr: Calcul relationnel

source: Relationship definition
es: Definición de la relación
fr: Type de relation

source: Relationship graph
es: Gráfico de relaciones
fr: Graphe relationnel

source: Relationship to %s
es: Relación con %s
fr: Relation avec %s

source: Relationship to Father
es: Relación con el Padre
fr: Relation avec le père

source: Relationship to Mother
es: Relación con la Madre
fr: Relation avec la mère

source: Relationship to child
es: Relación con el hijo
fr: Relation avec l'enfant

source: Religion
es: Religión

source: Remove Child
es: Remover Hijo
fr: Enlever un enfant

source: Remove current spouse
es: Remover actual conyuge
fr: Enlever un(e) époux(se)

source: Rename personal event types
es: Renombrar los tipos de eventos personales
fr: Modification d'un type d'évènement

source: Reorder gramps IDs
es: Reordenar los números de identificación gramps
fr: Réordonne les Identifiants gramps

source: Reorders the gramps IDs according to gramps' default rules.
es: Reordenar los números de identificación gramps de acuerdo con las reglas predefinidas de gramps
fr: Réorganise les identifiants gramps en fonction des règles par défaut.

source: Report Selection
es: Seleccionar Reporte
fr: Sélection d'une édition

source: Reports
es: Reportes
fr: Éditions

source: Researcher
es: Investigador
fr: Chercheur

source: Researcher Information
es: Información del Investigador
fr: Recherche d'information

source: Residence
es: Residencia
fr: Résidence

source: Restrict data on living people
es: Restrigir datos de personas vivas
fr: Restreindre les informations sur les personnes vivantes

source: Restrict information on living people
es: Restringir información de personas vivas
fr: Restreindre l'information sur les personnes vivantes

source: Retirement
es: Jubilación
fr: Retraite

source: Return to the index of people
es: Regresar al índice de personas
fr: Retour à l'index des individus

source: Revert to last saved database
es: Regresar a la última base de datos grabada
fr: Retour à l'état initial de la Base

source: Right Margin
es: Margen Derecho
fr: Marge de droite

source: Run a tool
es: Ejecutar una herramienta
fr: Boite à outils

source: Save
es: Guardar
fr: Enregistrer

source: Save Ancestor Chart
es: Guardar Gráfico de Ancestros
fr: Enregistrer l'arbre généalogique

source: Save Ancestor Report
es: Guardar Reporte de Ancestros
fr: Enregistrer la liste des Ancêtres

source: Save As
es: Guardar Como
fr: Enregistrer sous

source: Save As...
es: Guardar Como...
fr: Enregistrer sous...

source: Save Data
es: Guardar Datos
fr: Enregistrer les données

source: Save Descendant Report
es: Guardar Reporte de Descendientes
fr: Enregistrer la liste des descendants

source: Save Family Group Report
es: Guardar Reporte del Grupo Familiar
fr: Enregistrer la liste familiale

source: Save File
es: Guardar Archivo
fr: Enregistrer la Base

source: Save data as a spreadsheet
es: Guardar datos en una planilla de cálculo
fr: Enregistrer les données au format tableur (.csv)

source: Saving %s ...
es: Guardando %s ...
fr: Enregistre %s ...

source: Searches the entire database and attempts to extract titles and nicknames that may be embedded in a person's given name field.
es: Revisa en toda la base de datos y extrae los títulos y apodos que puedan estar en el registro del nombre de una persona.
fr: Tentatives de localisation des titres et surnoms situés dans des champs non prévu à cet effet.

source: Searches the entire database, looking for individual entries that may represent the same person.
es: Revisa en toda la base de datos, buscando registros individuales que puedan representar a la misma persona.
fr: Recherche dans la Base d'éventuels doublons.

source: Second
es: Segundo
fr: Seconde

source: Second Person
es: Segunda Persona
fr: Seconde personne

source: Select
es: Seleccionar
fr: Sélectionner

source: Select File
es: Seleccionar Archivo
fr: Choisir un fichier

source: Select a picture
es: Selecciona una foto
fr: Choisir une photo

source: Select a report from those available on the left.
es: Seleccione un reporte de aquellos disponibles a la izquierda.
fr: Choisir une liste parmi celle de gauche.

source: Select a tool from those available on the left.
es: Seleccione una herramienta de aquellas disponibles a la izquierda.
fr: Choisir un outil parmi ceux de gauche.

source: Select an image
es: Selecciona una imágen
fr: Choisir une image

source: Select existing person
es: Seleccione una persona existente
fr: Sélectionner un individu existant

source: Select existing person as spouse
es: Seleccione una persona existente como conyuge
fr: Sélectionner une personne existante comme époux(se)

source: Select information source
es: Seleccione una fuente de información
fr: Choisir une source d'information

source: September
es: Septiembre
fr: Septembre

source: Seventeenth
es: Decimoséptimo
fr: Dix-septième

source: Seventh
es: Séptimo
fr: Septième

source: She died in the year %s
es: Ella murió en el año %s
fr: elle mourut en l'an %s

source: She died in the year %s in %s
es: Ella murió en el año %s en %s
fr: elle mourut en l'an %s à %s

source: She died on %s
es: Ella murió en %s
fr: elle mourut en %s

source: She died on %s in %s
es: Ella murió en %s en %s
fr: elle mourut en %s à %s

source: Show Detail Flags in display lists
es: Mostrar Indicadores Detallados en las listas mostradas
fr: Liste détaillée

source: Show active person's anscestors
es: Mostrar los ancenstros de la persona activa
fr: Arbre Généalogique de l'individu

source: Show persons that do not match the filtering rule
es: Mostrar las personas que no cumplen con las reglas de selección
fr: Afficher les individus hors critères

source: Single
es: Soltero
fr: Unique

source: Single (scaled)
es: Soltero (escalado)
fr: Unique (échelonné)

source: Sixteenth
es: Decimosexto
fr: Seizième

source: Sixth
es: Sexto
fr: Sixième

source: Size
es: Tamaño
fr: Taille

source: Social Security Number
es: Número de Seguro Social
fr: N° Sécurité Sociale (INSEE)

source: SoundEx Code
es: Código SoundEx
fr: SoundEx

source: SoundEx Code Generator
es: Generador de Códigos SoundEx
fr: Générateur de SoundEx

source: Source
es: Referencia

source: Source Editor
es: Editor de Referencias
fr: Éditeur de source

source: Source Information
es: Información de la Referencia
fr: Source d'information

source: Sources
es: Referencias

source: Spouse
es: Conyuge
fr: Époux(se)

source: Spouse's father: %s
es: Padre del conyuge: %s
fr: Père de l'époux(se) : %s

source: Spouse's mother: %s
es: Madre del conyuge: %s
fr: Mère de l'époux(se) : %s

source: Spouse's name is not known
es: El nombre del conyuge no se conoce
fr: Nom de l'époux(se) inconnu

source: Spouse's parents: %s and %s
es: Padres del conyuge: %s y %s
fr: Parents de l'époux(se) : %s et %s

source: Spouses
es: Conyuges
fr: Époux(ses)

source: State
es: Estado
fr: État

source: State/Province
es: Estado/Provincia
fr: État/Province

source: Status
es: Estado
fr: Statut

source: Status Bar
es: Barra de Estado
fr: Barre d'état

source: Stepchild
es: Hijastro
fr: Bel-enfant

source: Style Editor
es: Editor de Estilo
fr: Éditeur de style

source: Style Name
es: Nombre del Estilo
fr: Nom du style

source: Styles
es: Estilos

source: Suffix
es: Sufijo
fr: Suffixe

source: Summary of %s
es: Resúmen de %s
fr: Image de %s

source: Summary of the database
es: Resúmen de la base de datos
fr: Description de la Base

source: Surname
es: Apellido
fr: Nom de famille

source: Surname, Firstname
es: Apellido, Nombre
fr: Nom, Prénom

source: Target Directory
es: Directorio Destino
fr: Répertoire cible

source: Template
es: Planilla
fr: Nomenclature

source: Tenth
es: Décimo
fr: Dixième

source: Text
es: Texto
fr: Texte

source: Text Color
es: Color de Texto
fr: Couleur de texte

source: The default directory for storing databases
es: Directorio predefinido para almacenar bases de datos
fr: Répertoire par défaut d'enregistrement de la Base

source: The default directory for the output of many report generators
es: Directorio predefinido para la salida de muchos generadores de reportes
fr: Répertoire par défaut de génération des éditions

source: The default directory for the output of the Web Site report generators
es: Directorio predefinido para la salida de generadores de reportes en sitios Web
fr: Répertoire par défaut de génération de pages Web

source: The marker '<!-- START -->' was not in the template
es: El marcador '<!-- START -->' no estaba en la plantilla
fr: le Marqueur '<!-- START -->' n'est pas normalisé

source: Third
es: Tercero
fr: Troisième

source: Thirteenth
es: Decimotercero
fr: Treizième

source: Title
es: Título
fr: Titre

source: Tool Selection
es: Selección de Herramientas
fr: Choix d'outils

source: Tools
es: Herramientas
fr: Outils

source: Total ancestors in generations %d to -1 is %d .
es: Número total de ancestros entre la generación %s y la -1 es %d .
fr: Le Nombre total d'ancêtres de la génération %d à -1 est de %d .

source: Total number of images
es: Número total de imágenes
fr: Nombre total d'images

source: Total size of images
es: Tamaño total de las imágenes
fr: Taille totale des images

source: Twelfth
es: Doceavo
fr: Douzième

source: Twentieth
es: Vigésimo
fr: Vingtième

source: Twenty-eighth
es: Vigésimo octavo
fr: Vingt-huitième

source: Twenty-fifth
es: Vigésimo quinto
fr: Vingt-cinquième

source: Twenty-first
es: Vigésimo primero
fr: Vingt et unième

source: Twenty-fourth
es: Vigésimo cuarto
fr: Vingt-quatrième

source: Twenty-ninth
es: Vigésimo noveno
fr: Vingt-neuvième

source: Twenty-second
es: Vigésimo segundo
fr: Vingt-deuxième

source: Twenty-seventh
es: Vigésimo séptimo
fr: Vingt-septième

source: Twenty-sixth
es: Vigésimo sexto
fr: Vingt-sixième

source: Twenty-third
es: Vigésimo tercero
fr: Vingt-troisième

source: Type Face
es: Tipo de Cubierta
fr: Visage type

source: Uncategorized
es: Sin categorizar
fr: Inclassable

source: Underline
es: Subrayar
fr: Souligné

source: Unique surnames
es: Apellidos únicos
fr: Noms uniques

source: Unknown
es: Desconocido
fr: Inconnu

source: Unknown relationship between a man and woman
es: Relación desconocida entre un hombre y una mujer
fr: Relation Inconnue entre un homme et une femme

source: Unmarried
es: Soltero
fr: Plus Marié(e)

source: Unsaved changes exist in the current database
es: Hay cambios no salvados en la base de datos actual
fr: Certaines modifications n'ont pu être sauvegardées dans la Base

source: Updates the selected event with the above data
es: Actualizar el evento seleccionado con los datos anteriores
fr: Modifier l'évènement à partir des données ci-dessus

source: Use SoundEx codes for name matches
es: Usar códigos SoundEx para comparar nombres
fr: Utiliser les SoundEx pour retrouver le nom

source: Use tabbed pages
es: Usar páginas marcadas
fr: Utiliser des onglets

source: Utilities
es: Utilidades
fr: Coutumes

source: Value
es: Valor
fr: Valeur

source: Verify - Settings
es: Verificar - Configuración
fr: Vérifier - Configuration

source: Verify the database
es: Verificar la base de datos
fr: Vérifier la Base de données

source: Version
es: Versión

source: Very High
es: Muy Alto
fr: Très Haut

source: Very Low
es: Muy Bajo
fr: Très Bas

source: View
es: Ver
fr: Vue

source: View Image
es: Ver Imágen
fr: Visualiser l'image

source: Volume/Film/Page
es: Volumen/Rollo/Página

source: Warning: This place is currently in use!
es: Atención: ¡Este lugar esta siendo usado!
fr: Attention : cet endroit est déjà utilisé !

source: Warning: line %d was not understood, so it was ignored.
es: Atención: la linea %d no fue entendida, por eso fue ignorada
fr: Attention : la ligne %d n'a pas été reconnue, elle sera donc ignorée.

source: Web Address
es: Dirección Web
fr: Page Web

source: Web Page
es: Página Web
fr: Pages Web

source: Welcome to Gramps, the Genealogical Research and Analysis Management Programming System. Since this is the first time you have run the program, some information about you needs to be gathered. This information is used to establish your ownership and copyright of the data you record. You may choose not to provide some or all of the requested information.
es: Bienvenido a Gramps, el Sistema de Manejo de Información y Análisis Genalógico. Dado que esta es la primera vez que Ud. usa el program, es necesario obtener cierta información de Ud.. Esta información se usará para establecer la propiedad y sus derechos de autor sobre los datos que Ud ingrese. Ud. puede escoger no entregar alguna o toda la información que se le solicita.
fr: Bienvenue dans GRAMPS ! Système Informatique de Gestion d'Analyse et de Recherche Généalogique. Si vous lancez ce programme pour la première fois, il vous sera nécessaire d'indiquer vos coordonnées. Ces informations établiront les droits de propriété de vos données (fichier d'échange Gedcom). Vous pouvez choisir de ne remplir que ce que vous comptez exporter.

source: Will
es: Testamento
fr: Voeux

source: Women
es: Mujer
fr: Femmes

source: YYYY-MM-DD
es: AAAA-MM-DD
fr: AAAA-MM-JJ

source: YYYY.MM.DD
es: AAAA.MM.DD
fr: AAAA.MM.JJ

source: YYYY/MM/DD
es: AAAA/MM/DD
fr: AAAA/MM/JJ

source: YYYY/MM/DD, YYYY.MM.DD, or YYYY-MM-DD
es: AAAA/MM/DD, AAAA.MM.DD, o AAAA-MM-DD
fr: MM/JJ/AAAA, MM.JJ.AAAA, ou MM-JJ-AAAA

source: ZIP/Postal Code
es: C.P./Código Postal
fr: ZIP/Code Postal

source: Zoom In
es: Acercar
fr: Grossir

source: Zoom Out
es: Alejar
fr: Rétrécir

source: _Add Bookmark
es: _Agregar Marcapáginas
fr: _Ajouter un signet

source: _Bookmarks
es: _Marcapáginas
fr: _Annuaire

source: _Default Person
es: _Persona Predefinida
fr: _de Cujus

source: _Edit
es: _Editar
fr: _Éditer

source: _Edit Bookmarks
es: _Editar Marcapáginas
fr: _Afficher l'annuaire

source: _Export
es: _Exportar
fr: _Exporter

source: _Family
es: _Familia
fr: _Famille

source: _Import
es: _Importar
fr: _Importer

source: _New File
es: _Archivo Nuevo
fr: _Nouveau fichier

source: _People
es: _Gente
fr: _Individus

source: _Reports
es: _Reportes
fr: _Éditions

source: _Revert
es: _Regresar
fr: _Défaire

source: _Sources
es: _Referencias

source: _Tools
es: _Herramientas
fr: _Outils

source: _User's Manual
es: _Manual de Usuarios
fr: _Manuel utilisateur

source: _Writing Extensions
es: _Extensiones Escritas
fr: _Developpement en cours

source: about
es: aproximadamente
fr: environ

source: abt
es: aprox.
fr: env

source: abt.
es: aprox.
fr: env.

source: abt\.
es: aprox\.
fr: env\.

source: aft
es: desp
fr: ap

source: aft.
es: desp.
fr: ap.

source: aft\.
es: desp\.
fr: ap\.

source: after
es: despues
fr: après

source: around
es: aproximadamante
fr: vers

source: bef
es: ant
fr: av

source: bef.
es: ant.
fr: av.

source: bef\.
es: ant\.
fr: av\.

source: before
es: antes
fr: avant

source: bottom
es: fondo
fr: de

source: center
es: centro
fr: centré

source: default
es: predefinido
fr: défaut

source: email
es: correo electrónico

source: est
es: aprox

source: est.
es: aprox.

source: est\.
es: aprox\.

source: female
es: mujer
fr: féminin

source: from
es: de
fr: de

source: gramps ID
es: identificación gramps
fr: Identifiant gramps

source: justify
es: justificar
fr: justifié

source: left
es: izquierda
fr: à gauche

source: male
es: hombre
fr: masculin

source: name
es: nombre
fr: nom

source: right
es: derecha
fr: à droite

source: roman (Times)
es: romano (Times)

source: swiss (Arial, Helvetica)
es: suizo (Arial, Helvetica)

source: to
es: para
fr: à

source: top
es: arriba
fr: haut

source: unknown
es: desconocido
fr: inconnu

source: was born
fr: est né(e)

source: %s is already used by %s
fr: % est déjà utilisé par %s

source: Allow internal GRAMPS ID numbers to be edited
fr: Permet l'affichage des Identifiants Gramps

source: Ancestors and Descendants
fr: Ancêtres et Descendants

source: Color
fr: Couleur

source: Database name:
fr: Nom de la Base de données

source: Export PAF for PalmOS
fr: Exporter PAF pour PalmOS

source: Export PAF for PalmOS file
fr: Exporter PAF pour les fichiers PalmOS

source: Export to PAF for PalmOS
fr: Exporter vers PAF pour PalmOS

source: GRAMPS ID value was not changed.
fr: Les Identifiants Gramps sont inchangés

source: GRAMPS is not able to find an XML parser on your system.
fr: Gramps n'arrive pas à trouver de Parser XML sur votre système

source: General
fr: Général

source: Gramps - Change image description
fr: Gramps - Changement de la description d'image

source: Import from GEDCOM
fr: Importer un format GEDCOM

source: Individual Summary for %s
fr: Image individuelle de %s

source: Medium
fr: Moyen

source: PAF for PalmOS Export
fr: PAF pour les exportations PalmOS

source: Produces a detailed ancestral report
fr: Produit une liste généalogique détaillée

source: This is probably due to an incomplete python or PyXML installation
fr: Installation probablement incomplète de Python ou PyXML

source: bytes
fr: octets
