Repository: JorisE/Gramps
Catalog: src/po/*.po
Languages: es, fr

source: was born
es: nació

source: $n b. $b d. $d
es: $n n. $b m. $d

source: %d broken family images were found
es: se econtraron %d imágenes de familias que no funcionan
fr: %d liens avec des photos de familles ont été perdus

source: %d broken family links were found
es: se encontraron %d enlaces de familias que no funcionan
fr: %d liens familiaux ont été perdus

source: %d broken personal images were found
es: se econtraron %d imágenes de personas que no funcionan
fr: %d liens avec des photos individuelles ont été perdus

source: %d corrupted family relationship fixed
es: %d relaciones familiares incorrectas fueron arregladas
fr: %d relations familiales ont été corrompues

source: %d empty families were found
es: se econtraron %d familias vacías
fr: %d familles vides sont présentes

source: %s Generation
es: %s Generación
fr: %s Génération

source: %s [%s]: event %s
es: %s [%s]: evento %s
fr: %s [%s]: évènement %s

source: %s and %s
es: %s y %s
fr: %s et %s

source: %s could not be opened
es: %s no pudo ser abierto
fr: %s ouverture impossible

source: %s is a corrupt file
es: %s es un archivo con el formato dañado
fr: %s fichier corrompu

source: %s is a corrupt file.
es: %s es un archivo con el formato dañado.
fr: %s est un fichier corrompu

source: %s is not a directory
es: %s no es un directorio
fr: %s n'est pas un répertoire

source: %s was born in the year %s in %s.
es: %s nació en el año $s en %s.
fr: %s est né(e) en l'an %s à %s.

source: %s was born in the year %s.
es: %s nació en el año %s.
fr: %s est né(e) en l'an %s.

source: %s was born on %s in %s.
es: %s nació en %s en %s.
fr: %s est né(e) le %s à %s.

source: %s was born on %s.
es: %s nació en %s.
fr: %s est né(e) le %s.

source: %s was removed from the family of %s
es: %s fue removido de la familia de %s
fr: %s a été supprimé de la famille de %s

source: %s will be extracted as a nickname from %s
es: %s será extraido como sobrenombre desde %s
fr: %s sera extrait en tant que nom de %s

source: %s will be extracted as a title from %s
es: %s será extraido como título desde %s
fr: %s sera extrait comme titre de %s

source: (Recommended only for English)
es: (Recomendado solo para Inglés)
fr: (Uniquement pour nos amis anglophones)

source: (and|to|-)
es: (y|para|-)
fr: (et|à|-)

source: (from|between|bet|bet.)
es: (de|entre|ent|ent.)
fr: (de|entre|ent|ent.)

source: , and was buried in the year %s in %s.
es: , y fue enterrado en el año %s en %s.
fr: , et fût inhumé en l'an %s à %s.

source: , and was buried in the year %s.
es: , y fue enterrado en el año %s.
fr: , et fût inhumé en l'an %s.

source: , and was buried on %s in %s.
es: , y fue enterrado en %s en %s.
fr: , et fût inhumé le %s à %s.

source: , and was buried on %s.
es: , y fue enterrado en %s.
fr: , et fût inhumé le %s.

source: 1 broken family image was found
es: Se encontró una imagen de familia que no funciona
fr: 1 lien avec une photo de famille a été perdu

source: 1 broken family link was fixed
es: Se econtró un enlace de familia que no funciona
fr: 1 lien familial a été perdu

source: 1 broken personal image was found
es: Se encontró una imagen de persona que no funciona
fr: 1 lien avec une photo individuelle a été perdu

source: 1 corrupted family relationship fixed
es: Una relación de familia que no funciona fue corregida
fr: 1 relation familiale corrompue a été reconstruite

source: 1 empty family was found
es: Una familia vacía fue encontrada
fr: 1 famille vide a été trouvé

source: A legal or common-law relationship between a husband and wife
es: Un matrimonio civil entre esposo y esposa
fr: Une relation légalisée par le droit coutumier entre un homme et une femme

source: ABT
es: APROX
fr: Vers

source: AFTER
es: DESPUES DE
fr: Après

source: Active Person
es: Persona Activa
fr: Activer l'individu

source: Active person's name and attribute
es: Nombre y atributos de la persona activa
fr: Individu et ses attributs

source: Active person's name and gramps ID
es: Nombre e identificación gramps de la persona activa
fr: Individu et son identifiant gramps

source: Active person's name only
es: Solo el nombre de la persona activa
fr: Individu seul

source: Add
es: Agregar
fr: Ajouter

source: Add Children
es: Agregar Hijos
fr: Ajouter un enfant

source: Add Existing Children
es: Agregar Hijos Existentes
fr: Ajouter un enfant déjà existant

source: Add Image
es: Agregar Imagen
fr: Ajouter une image

source: Add New Child
es: Agregar un Hijo Nuevo
fr: Ajouter un nouvel enfant

source: Add Person
es: Agregar una Persona
fr: Ajouter un individu

source: Add Place
es: Agregar un Lugar
fr: Ajouter un Lieu

source: Add Source
es: Agregar una Referencia
fr: Ajouter une source

source: Add a new spouse
es: Agregar otro conyuge
fr: Ajouter un(e) nouvel(le) époux(se)

source: Add new person
es: Agregar una nueva persona
fr: Ajouter un nouvel individu

source: Add new person as spouse
es: Agregar la nueva persona como conyuge
fr: Ajouter un(e) nouvel(le) époux(se)

source: Add/Edit/View
es: Agregar/Editar/Ver
fr: Ajouter/Éditer/Afficher

source: Address
es: Dirección
fr: Adresse

source: Address Editor
es: Editor de Direcciones
fr: Affichage d'adresse

source: Address Editor for %s
es: Editor de Direcciones para %s
fr: Affichage de l'adresse de %s

source: Addresses
es: Direcciones
fr: Adresses

source: Adopted
es: Adoptado
fr: Adopté(e)

source: Adult Christening
es: Bautizo Adulto
fr: Baptême chrétien

source: Ahnentafel Report
es: Reporte Ahnentafel
fr: Édition Ahnentafel

source: Ahnentafel Report for %s
es: Reporte Ahnentafel para %s
fr: Édition Ahnentafel pour %s

source: Aids in the analysis of data by allowing the development of custom filters that can be applied to the database to find similar events
es: Ayuda en el análisis de la información permitiendo el desarrollo de filtos personalizados que pueden ser aplicados a la base de datos para encontrar eventos similares
fr: Aide à l'analyse des données autorisant le développement de filtres personnalisés pour rechercher des évènements similaires

source: Alignment
es: Alineacion
fr: Alignement

source: All people
es: Toda las personas
fr: Tout le monde

source: Allows all the events of a certain name to be renamed to a new name
es: Permite que todos los eventos de un cierto nombre sean transferidos a un nombre nuevo
fr: Permet de basculer les évènements d'un type sur un autre type

source: Allows you to customize the data in the boxes in the report
es: Permite personalizar los datos en los cuadros del reporte
fr: Permet de personnaliser les données d'une édition

source: Alternate Birth
es: Fecha de Nacimiento Alternativa
fr: Naissances successives (?)

source: Alternate Death
es: Fecha de Muerte Alternativa
fr: Décès successifs (?)

source: Alternate Name Editor
es: Nombre Alternativo del Editor
fr: Afficher les autres Noms

source: Alternate Name Editor for %s
es: Nombre Alternativo del Editor para %s
fr: Affichage des autres Noms pour %s

source: Alternate Names
es: Nombre Alternativos
fr: Autres Noms

source: An established relationship between members of the same sex
es: Una relación estable entre miembros del mismo sexo
fr: Relation Homosexuelle

source: An unspecified relationship between a man and woman
es: Una relación no especificada ente un hombre y una mujer
fr: Relation Hétérosexuelle

source: Analysis and Exploration
es: Análisys y Exploración
fr: Analyses et Exploration

source: Ancestor Chart
es: Carta de Ancestros
fr: Arbre Généalogique

source: Ancestor Chart for %s
es: Carta de Ancestros para %s
fr: Arbre Généalogique de %s

source: Ancestor Graph
es: Gráfico de Ancestros
fr: Graphique des ancêtres

source: Ancestors
es: Ancestros
fr: Ancêtres

source: Ancestors and Descendants of %s
es: Ancestros y Descendientes de %s
fr: Ancêtres et descendants de %s

source: Ancestors and descendants
es: Ancestros y descendientes
fr: Ancêtres et descendants

source: Ancestors of %s
es: Ancestros de %s
fr: Ancêtres de %s

source: Annulment
es: Anulación
fr: Annulation

source: Appearance
es: Apariencia
fr: Apparence

source: Append to Current Database
es: Agregar a la Base de Datos Actual
fr: Ajout à la Base actuelle

source: April
es: Abril
fr: Avril

source: Attribute
es: Atributo
fr: Attribut

source: Attribute Editor
es: Editor de Atributos
fr: Affichage des attributs

source: Attribute Editor for %s
es: Editor de Atributos para %s
fr: Affichage des attributs de %s

source: Attributes
es: Atributos
fr: Attributs

source: August
es: Agosto
fr: Août

source: Author
es: Autor
fr: Auteur

source: Automatically load last database
es: Cargar automáticamente la última base de datos
fr: Chargement automatique de la dernière Base

source: BEFORE
es: ANTES DE
fr: Avant

source: Background
es: Fondo
fr: Fond

source: Background Color
es: Color de Fondo
fr: Couleur de fond

source: Baptism
es: Bautizo
fr: Baptême

source: Baptism (LDS)
es: Bautizo (SUD)
fr: Baptême (LDS)

source: Basic
es: Básico

source: Below is a list of the nicknames and titles that Gramps can extract from the current database. If you select 'Yes', Gramps will modify your database as specified below. If you do not approve of these changes, you should select 'No', and your database will not be altered. Should the following changes be made?
es: A continuación hay una lista de los apodos y títulos que Gramps pudo extraer de la base de datos actual. Si Ud. selecciona 'Si', Gramps modificara la base de datos tal como se especifica abajo. Si Ud. no acepta esos cambios, Ud. debería seleccionar 'No', y la base de datos no será cambiada. ¿Los cambios debe ser efectuados?
fr: la Liste ci-dessous comprend des surnoms et des titres que Gramps peut extraire de la base de donnée. Si vous validez par 'Oui', Gramps modifiera votre base avec les données ci-dessous, si au contraire vous n'en voulez pas 'Non' votre base restera en l'état. Voulez vous conserver les changements suivants ?

source: Birth
es: Nacimiento
fr: Naissance

source: Birth Date
es: Fecha de Nacimiento
fr: Date de naissance

source: Birth Place
es: Lugar de Nacimiento
fr: Lieu de naissance

source: Birthdate
es: Fecha de Nacimiento
fr: Anniversaire

source: Bold
es: Negrillas
fr: Gras

source: Border Color
es: Color del Borde
fr: Couleur du bord

source: Borders
es: Bordes
fr: Bordures

source: Box Color
es: Color de la Caja
fr: Couleur de boîte

source: Burial
es: Entierro
fr: Inhumation

source: Calculate SoundEx code for the name
es: Calcule el código SoundEx para ese nombre
fr: Calcul du SoundEx de nom

source: Calculates the relationship between two people
es: Calcula la reación entre dos personas
fr: Calcul des relations entre deux individus

source: Cancel
es: Cancelar
fr: Annuler

source: Cannot revert to a previous database, since one does not exist
es: No puedo regresar a una base de datos anterior pues esta no existe
fr: Retour à la Base précédente impossible car inexistante

source: Caste
es: Casta

source: Cause Of Death
es: Causa de Muerte
fr: Cause du décès

source: Cause of Death
es: Causa de Muerte
fr: Cause du décès

source: Census
es: Censo
fr: Blâme

source: Change Event Type of
es: Cambiar el Evento Tipo de
fr: Changement du type d'évènement de

source: Change Event Types
es: Cambiar el Tipo de Eventos
fr: Changement des types d'évènement

source: Change Image Description
es: Cambiar Descripción de la Imágen
fr: Changement de la description d'image

source: Changing the gender caused problems with marriage information.
es: Cambiar el género creo problemas con la información matrimonial.
fr: Changer le genre d'un individu pose problème avec le Mariage.

source: Check Integrity
es: Revisar Integridad
fr: Contrôle d'Intégrité

source: Check and repair database
es: Revisar y reparar la base de datos
fr: Vérifie et répare la Base

source: Checks the database for integrity problems, fixing the problems that it can
es: Revisa la base de datos por problemas de integridad, arreglando los problemas que puede
fr: Vérifie l'intégrité de la base de données, corrigeant les problèmes éventuels

source: Children
es: Hijos
fr: Enfants

source: Choose Parents
es: Escoger Padres
fr: Sélectionner les parents

source: Choose Spouse
es: Escoger Conyuge
fr: Sélectionner l'époux(se)

source: Choose Spouse/Partner
es: Escoger Conyuge/Compañero(a)
fr: Sélectionner l'époux(se) ou le Partenaire

source: Choose the HTML template
es: Escoger el formato HTML
fr: Choix du format HTML

source: Choose the Parents of %s
es: Escoger los Padres de %s
fr: Sélectionner les parents de %s

source: Christening
es: Bautizo
fr: Baptême chrétien

source: City
es: Ciudad
fr: Ville

source: City/County
es: Ciudad/Condado
fr: Ville/Département

source: Close
es: Cerrar
fr: Fermer

source: Close Window
es: Cerrar Ventana
fr: Fermer la fenêtre

source: Comments
es: Comentarios
fr: Commentaires

source: Compare individual events
es: Comparar eventos individuales
fr: Comparaison d'évènements individuels

source: Complete
es: Completar
fr: Compléter

source: Confidence
es: Confianza

source: Confirmation
es: Conirmación

source: Convert to private copy
es: Convertir a copia provada
fr: Sauvegarde Personnelle

source: Could not create %s
es: No se pudo crear %s
fr: Impossible de créer %s

source: Could not create the directory : %s
es: No se pudo crear el directorio : %s
fr: Impossible de créer le répertoire : %s

source: Could not import %s: currently an unknown file type
es: No se pudo importar %s: actualmente es un tipo de archivo desconocido
fr: Impossible d'importer %s: format non reconnu

source: Could not import %s: either the file could not be found, or it was not a valid image
es: No se pudo importar %s: o no se pudo encontrar el archivo, o no erauna imágen válida
fr: Impossible d'importer %s: soit le fichier n'existe pas, soit il n'est pas valide

source: Could not load image file %s
es: No se pudo cargar el archivo de imágen %s
fr: Impossible de charger le fichier %s

source: Could not open %s
es: No se pudo abrir %s
fr: Impossible d'ouvrir %s

source: Could not open %s Using the default template
es: No se pudo abrir %s Use el formato predefinido
fr: Impossible d'ouvrir %s en utilisant le format par défaut

source: Could not open the template file (%s)
es: No se pudo el archivo de formato (%s)
fr: Impossible d'ouvrir ce format de fichier (%s)

source: Country
es: País
fr: Pays

source: Counts number of ancestors of selected person
es: Cuenta el numero de ancestros de la persona seleccionada
fr: Calcul du nombre d'ancêtre de la personne sélectionnée

source: County
es: Condado
fr: Département

source: Created by
es: Creado por
fr: Créer par

source: Creates a family group report, showing information on a set of parents and their children.
es: Crea un reporte del grupo familiar, mostrando información sobre un grupo de padres y sus hijos.
fr: Crée l'édition d'un groupe familial, comprenant un groupe de parents et leurs enfants.

source: Creates a new event from the above data
es: Crea un nuevo evento usando los datos anteriores
fr: Crée un nouvel évènement à partir des données ci-dessus

source: Cremation
es: Cremacion
fr: Incinération

source: Currently only image files are supported
es: Actualmente solo se aceptan archivos de imágen
fr: Seules les fichiers d'images sont couramment supportés

source: Custom Colors
es: Colores Personalizados
fr: Personnaliser les couleurs

source: DD-MM-YYYY
es: DD-MM-AAAA
fr: JJ-MM-AAAA

source: DD. Month Year
es: DD. Més Año
fr: JJ. Mois Années

source: DD.MM.YYYY
es: DD.MM.AAAA
fr: JJ.MM.AAAA

source: DD/MM/YYYY
es: DD/MM/AAAA
fr: JJ/MM/AAAA

source: DD/MM/YYYY, DD.MM.YYYY, or DD-MM-YYYY
es: DD/MM/AAAA, DD.MM.AAAA, o DD-MM-AAAA
fr: JJ/MM/AAAA, JJ.MM.AAAA, ou JJ-MM-AAAA

source: Data was modified. Are you sure you want to abandon your changes?
es: Los datos fueron modificados. ¿Está seguro que quiere olvidarlos cambios?
fr: Des données ont été modifiées. Voulez vous perdre ces modifications

source: Database Processing
es: Procesando la Base de Datos
fr: Parcours de la Base de données

source: Database Summary
es: Resumen de la Base de Datos
fr: Image de la Base de données

source: Database Verify
es: Verificar Base de Datos
fr: Vérification de la Base de données

source: Date
es: Fecha

source: Date Format
es: Formato de la Fecha
fr: Format de la date

source: Day MON Year
es: Día MES Año
fr: Jour MOIS Année

source: Death
es: Fallecimiento
fr: Décès

source: Death Date
es: Fecha de Fallecimiento
fr: Date de décès

source: Death place
es: Lugar de Fallecimiento
fr: Lieu de décès

source: December
es: Diciembre
fr: Décembre

source: Default Web Site directory
es: Directorio predefinido del Sitio Web
fr: Répertoire par défaut du site Web

source: Default database directory
es: Directorio predefinido de la base de datos
fr: Répertoire par défaut de la Base de Données

source: Default report directory
es: Directorio predefinido de los reportes
fr: Répertoire par défaut des éditions

source: Degree
es: Grado
fr: Niveau

source: Delete
es: Borrar
fr: Supprimer

source: Delete Image
es: Borrar Imágen
fr: Supprimer une image

source: Delete Person
es: Borrar Persona
fr: Supprimer un individu

source: Delete Place
es: Borrar Lugar
fr: Supprimer un Lieu

source: Delete Source
es: Borrar Referencia
fr: Supprimer une source

source: Delete the selected event
es: Borrar el evento seleccionado
fr: Supprimer un évènement sélectionné

source: Descendant Browser
es: Ojear Descendientes
fr: Navigateur de descendance

source: Descendant Report
es: Reporte de Descendientes
fr: Édition de descendance

source: Descendants
es: Descendientes

source: Descendants of %s
es: Descendientes de %s
fr: Descendants de %s

source: Description
es: Descripción

source: Detailed Ancestral Report
es: Reporte Detallado de Ancestros
fr: Liste détaillée des Ancêtres

source: Detailed Ancestral Report for %s
es: Reporte Detallado de Ancestros para %s
fr: Édition Ahnentafel pour %s

source: Details
es: Detalles
fr: Détails

source: Determining Possible Merges
es: Determinando Posibles Fusiones
fr: Détermine les fusions possibles

source: Directories
es: Directorios
fr: Répertoires

source: Disconnected individuals
es: Desconectar individuos
fr: Déconnecter des individus

source: Display Format
es: Desplegar Formato
fr: Afficher le format

source: Display Formats
es: Desplegar Formatos
fr: Afficher les formats

source: Display active person's family relationships
es: Desplegar las relaciones familiares de la persona activa
fr: Afficher les relations familiales de la personne

source: Display attribute on Edit Person form
es: Desplegar los atributos en el formulario de Editar Persona
fr: Afficher la qualité de la personne

source: Display gramps ID in lists
es: Desplegar la identificación gramps en las listas
fr: Afficher les identifiants gramps dans les listes

source: Display the list of people
es: Desplegar la lista de personas
fr: Afficher la liste des individus

source: Display the list of sources
es: Desplegar la lista de referencias
fr: Afficher la liste des sources

source: Divorce
es: Divorcio

source: Divorce Filing
es: Solicitud de divorcio
fr: Classement du divorce

source: Do not compress XML data file
es: No comprima el archivo de datos XML
fr: Ne pas compresser les fichiers XML

source: Do not display alternate names in person list
es: No despliegue los nombres alternativos en la lista de la persona
fr: Ne pas afficher les autres dénominations dans la liste des individus

source: Do not include comments and text in source information
es: No incluya comentarios y texto en la información de las referencias
fr: Ne pas inclure de commentaire ni de texte dans les sources

source: Do not include records marked
es: No incluya los registros marcados
fr: Ne pas inclure les enregistrements sélectionnés

source: Do not make a private copy
es: No aga una copia privada
fr: Ne pas faire de sauvegarde individuelle

source: Do not use images
es: No use imágenes
fr: Ne pas utiliser d'images

source: Do not use images for living people
es: No use imágenes para personas vivas
fr: Ne pas utiliser d'images pour les personnes vivantes

source: Do you really wish to delete %s?
es: ¿Quiere borrar %s?
fr: Voulez vous réellement supprimer %s?

source: Do you want to close the current database and create a new one?
es: ¿Quiere cerrar la base de datos actual y crear una nueva?
fr: Voulez vous fermer la Base en cours et en créer une nouvelle ?

source: Do you wish to abandon your changes and revert to the last saved database?
es: ¿Quiere abandonar los cambios y regresar a la úliima base de datos salvada?
fr: Voulez vous abandonner les changements réalisés et revenir à la dernière sauvegarde?

source: Do you wish to delete this place?
es: ¿Quiere borrar este lugar?
fr: Souhaitez vous supprimer ce lieu ?

source: Do you wish to save the changes?
es: ¿Quiere salvar estos cambios?
fr: Voulez vous sauvegarder les changements réalisés ?

source: Do you wish to set %s as the home person?
es: ¿Quiere establecer a %s como la persona inicial?
fr: Voulez vous faire de %s le 'de Cujus' ?

source: Document Styles
es: Tipos de Documentos
fr: Styles de documents

source: Double clicking will make %s the active person
es: El pulsar dos veces hará a %s la persona activada
fr: Un double clic activera l'individu %s

source: Doubleclick to edit, Shift-Doubleclick to make the active person
es: Pulse dos veces para editar, apriete 'Shift' y pulse dos vecespara hacerla la persona activa
fr: Double Clics pour afficher, Shift-Double Clics pour activer la personne

source: Edit
es: Editar
fr: Éditer

source: Edit Bookmarks
es: Editar Marcapáginas
fr: Afficher l'annuaire

source: Edit Description
es: Editar Descripción
fr: Afficher la description

source: Edit Image
es: Editar Imágen
fr: Afficher l'image

source: Edit Note
es: Editar Notas
fr: Afficher Note

source: Edit Source
es: Editar Referencias
fr: Afficher Source

source: Edit marriage information
es: Editar información del matrimonio
fr: Afficher les informations concernant le mariage

source: Edit source information for the highlighted event
es: Editar la referencia para el evento destacado
fr: Afficher les sources pour les évènements surlignés

source: Edit/View
es: Editar/Ver
fr: Éditer/Afficher

source: Edit/View Person
es: Editar/Ver Persona
fr: Afficher l'individu

source: Edit/View Place
es: Editar/Ver Lugar
fr: Afficher le Lieu

source: Edit/View Source
es: Editar/Ver Referencia
fr: Afficher Source

source: Education
es: Educación
fr: Éducation

source: Eighth
es: Octavo
fr: Huitième

source: Eightteenth
es: Decimooctavo
fr: Dix-huitième

source: Elected
es: Elegido
fr: Élection

source: Eleventh
es: Onceavo
fr: Onzième

source: Emigration
es: Emigración
fr: Émigration

source: Enable Custom Colors
es: Activar Colores Personalizados
fr: Activer la personnalisation des couleurs

source: Encoding
es: Codificar
fr: Codification

source: Engagement
es: Compromiso

source: Entire Database
es: Toda la Base de Datos
fr: Toute la Base

source: Entire database
es: Toda la base de datos
fr: Toute la Base

source: Entry Formats
es: Formato de Ingreso
fr: Formats d'entrée

source: Error reading %s
es: Error leyendo %s
fr: Erreur de lecture de %s

source: Even Row Background
es: Plano de Fondo con Filas Iguales
fr: Couleur de fond (lignes paires)

source: Even Row Foreground
es: Primer Plano con Filas Iguales
fr: Couleur du texte (lignes paires)

source: Event
es: Evento
fr: Évènement

source: Event Comparison
es: Comparación de Eventos
fr: Comparaison d'évènements

source: Event Editor
es: Editor de Eventos
fr: Éditeur de style

source: Event Editor for %s
es: Editor de Eventos para %s
fr: Édition Ahnentafel pour %s

source: Event Type
es: Tipo de Evento
fr: Type d'évènement

source: Events
es: Eventos
fr: Évènements

source: Exchange active person and displayed spouse
es: Intercambiar la persona activada con el conyuge mostrado
fr: Échange de la personne active et affichage de l'époux(se)
