Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: To make the currently selected spouse the active person, click the double-arrow button to the right of the active person box. Alternatively, right-click into the spouse box and select <guilabel>Make the selected spouse an active person</guilabel> item from the context menu.
fr: Pour changer le conjoint sélectionné, cliquez sur le bouton portant une double flèche à droite de la zone de la personne Active. Vous pouvez aussi cliquer avec le bouton droit de la souris dans la zone de l'époux/se, et utiliser le choix <guilabel>Sélectionner le conjoint comme personne active</guilabel> du menu contextuel.

source: To make the currently selected parents the active family (thereby making father the active person and mother the selected spouse), click the right-arrow button to the right of the active person's parents box. Alternatively, right-click into the active person's parents box and select <guilabel>Make the selected parents the active family</guilabel> item from the context menu.
fr: Pour que des parents de la personne active deviennent la famille active, le père devenant la nouvelle personne active et la mère l'épouse sélectionnée, cliquez sur le bouton flèche à droite situé à droite de la zone des parents de la personne active. Si vous voulez prendre les parents de l'époux/se comme famille active, cliquez sur le bouton flèche à droite situé à droite de la boîte des parents de l'époux/se. Vous pouvez aussi cliquer avec le bouton droit de la souris dans la zone des parents de la personne active puis sélectionner <guilabel>Choisir les parents en cours</guilabel> dans le menu contextuel.

source: To make the currently selected spouse's parents the active family (thereby making father the active person and mother the selected spouse), click the right-arrow button to the right of the spouse's parents box. Alternatively, right-click into the spouse's parents box and select <guilabel>Make the selected parents the active family</guilabel> item from the context menu.
fr: Pour que les parents du conjoint sélectionné deviennent la famille active, le beau-père de la personne active devenant personne active, la belle-mère devenant l'épouse sélectionnée, cliquez sur le bouton flèche à droite situé à droite de la zone des parents de l'époux/se. Vous pouvez aussi cliquer avec le bouton droit de la souris dans la zone des parents de l'époux/se, et sélectionner <guilabel>Choisir les parents en cours</guilabel> dans le menu contextuel.

source: To make the currently selected child the active person, click the left-arrow button to the right of the children box. Alternatively, right-click into the children box and select <guilabel>Make the selected child an active person</guilabel> item from the context menu.
fr: Pour que l'enfant sélectionné devienne la personne active, cliquer sur le bouton flèche gauche situé à droite de la zone des enfants. Vous pouvez aussi cliquer avec le bouton droit de la souris dans la zone des enfants et sélectionner <guilabel>Rendre actif l'enfant sélectionné</guilabel> dans le menu contextuel.

source: In addition to this, GRAMPS provides an extensive set of keyboard navigation options. The detailed reference to the key bindings is found in the <xref linkend="append-keybind"/>.
fr: En plus de tout cela, GRAMPS propose de nombreux raccourcis-claviers pour la navigation. Lisez la documentation de référence de ces commandes dans <xref linkend="append-keybind"/>.

source: Using the Pedigree View
fr: L'utilisation de la vue en arborescence

source: The Pedigree View (see <xref linkend="pedigree-view"/>) also allows you to move along the family tree. The benefit of this method is that you can see more than one generation of the family tree. Also, you can jump directly from a great-grandson to a great-grandfather without going through the intermediate generations.
fr: La vue en arborescence (voir <xref linkend="pedigree-view"/>) vous permet aussi de vous déplacer dans l'arbre familial. L'avantage de cette méthode est de pouvoir sauter plusieurs générations en une seule fois. Par exemple, on peut aller d'un arrière-petit-fils à son arrièere-grand-père sans avoir à passer par les générations intermédiaires.

source: Note that after changing the active person in the Pedigree View, the display is re-adjusted to show four generations, starting from the newly selected Active person. When in the Pedigree View, you can easily navigate between the members of the displayed family tree as follows:
fr: Notez qu'après avoir changé de personne active dans la vue arborescente, l'affichage est mis à jour pour montrer quatre générations au-dessus de la nouvelle personne active. Dans la vue en arbre, vous pouvez naviguer entre les personnes affichées comme suit :

source: To make any displayed person the active person, double-click the line that connects to the left side of the corresponding box.
fr: Pour prendre comme personne active une personne de l'arbre affiché, double-cliquez sur la ligne issue de cette personne vers la gauche.

source: To make a child of the currently active person (if any) the active person, click the left arrow button to the left of the corresponding box. If there is more than one child, the button expands to the menu listing the children to choose from.
fr: Pour prendre comme personne active un enfant de la personne active en cours (la racine à gauche de l'arbre), cliquez sur la flèche vers la gauche située à gauche de sa boîte. Si cette personne a plusieurs enfants, le bouton se développe en un menu déroulant proposant le choix entre les enfants.

source: To move the whole family tree one generation back, click on the corresponding right arrow button on the right-hand side of the display area. Clicking the upper button will move the tree along the paternal line. Clicking the lower button will move the tree along the maternal line.
fr: Pour déplacer l'arbre d'une génération en arrière, cliquez sur le bouton correspondant à droite de l'arbre. Le bouton du haut fera suivre la lignée paternelle alors que le bouton du bas fera suivre la lignée maternelle.

source: Clicking either of these buttons is completely equivalent to double-clicking the lines connecting to the left of the corresponding boxes for father and mother.
fr: Cliquer sur un de ces boutons est rigoureusement équivalent à double cliquer sur les lignes issues de la personne active (racine de l'arbre affiché) vers ses parents.

source: You can also quickly access any of the spouses, siblings, children, or parents of any displayed person. To do this, move the mouse over the desired person's box and right-click to invoke a context menu. The appropriate menu items will contain submenus listing all spouses, siblings, children, and parents of the corresponding person.
fr: Vous pouvez également accéder aux épouses, enfants, ou parents de chaque individus. Il vous suffit de cliquer sur le bouton droit de la souris, pour appeler un menu. Ce menu liste les conjoints, les enfants et les parents de l'individus activé.

source: Advantages of using right-click menus
fr: Avantages de l'utilisation du clic-droit

source: Direct access to spouse and siblings
fr: Accès direct aux conjoint(s)

source: Complete lists of all member of all categories, not only the preferred members.
fr: Liste complète de tous les membres dans chaque catégorie, pas seulement l'individu par défaut.

source: Setting the Home Person
fr: Choisir le de Cujus

source: One and only one person in the database can be selected as the Home person. Once the Home person is selected, moving to that person becomes a matter of a single click, regardless of which view you are using at the moment.
fr: Une personne seulement peut être sélectionnée comme de Cujus. C'est l'affaire d'un seul clic dans n'importe quelle vue.

source: To set the Home person, first navigate to that person using any method you like. Then choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Set Home person</guimenuitem></menuchoice>. Once this is done, you can move to the Home person from anywhere in the database by simply clicking the <guibutton>Home</guibutton> icon on the toolbar. You can also choose <menuchoice><guimenu>Go</guimenu><guimenuitem>Home</guimenuitem></menuchoice> from the menu or select <guilabel>Home</guilabel> item from any context menu available on the right click.
fr: Pour choisir le de Cujus, sélectionner d'abord ,par le moyen de votre choix, la personne voulue comme personne active. Faites <menuchoice><guimenu>Edition</guimenu><guimenuitem>Changer la personne de référence</guimenuitem></menuchoice>. A partir de ce moment, vous pouvez retourner à cette personne simplement en cliquant sur l'icône <guibutton>Personne de référence</guibutton> dans la barre d'outils. Vous pouvez également choisir <menuchoice><guimenu>Aller à</guimenu><guimenuitem>Personne de référence</guimenuitem></menuchoice> dans le menu ou choisir l'élément <guilabel>Personne de référence</guilabel> dans n'importe quel menu contextuel accessible par un clic droit de la souris.

source: Using history-based tools
fr: L'utilisation de l'historique

source: GRAMPS also features a powerful set of history-based navigation tools. These tools are similar to those commonly used in web browsers. They include <guilabel>Back</guilabel> and <guilabel>Forward</guilabel> items available from the <menuchoice><guimenu>Go</guimenu></menuchoice> menu, context menus (available in People, Family, and Pedigree views), and the toolbar buttons. They also include the list of the recent selections available under the <menuchoice><guimenu>Go</guimenu></menuchoice> menu that allows you to jump directly to any of the recent selections. Finally, right-clicking on the <guibutton>Back</guibutton> and <guibutton>Forward</guibutton> toolbar buttons invokes the popup menu with corresponding portion of the history. Select any item from the menu to jump directly to it.
fr: GRAMPS dispose aussi d'un ensemble puissant d'outils reposant sur l'historique de navigation. Ces outils ressemblent à ceux des navigateur sur le Web. Ceci comprend les éléments <guilabel>Précédent</guilabel> et <guilabel>Suivant</guilabel> disponibles dans le menu <menuchoice><guimenu>Aller à</guimenu></menuchoice> les menus contextuels et les boutons de la barre d'outils. Il y a aussi la liste des sélections récentes accessible par le menu <menuchoice><guimenu>Aller à</guimenu></menuchoice> qui vous permet d'aller directement vers n'importe quelle personne sélectionnée récemment. Enfin, cliquer avec le bouton droit de la souris sur les boutons <guibutton>Précédent</guibutton> et <guibutton>Suivant</guibutton> de la barre d'outils active un menu déroulant avec les personnes correspondantes dans l'historique. Sélectionnez l'une d'elles et vous irez directement vers elle.

source: Bookmarking People
fr: Mettre des signets

source: Similar to setting the Home person, you can bookmark other people from the database to simplify further navigation. To bookmark a person, first navigate to that person, then choose <menuchoice><guimenu>Bookmarks</guimenu><guimenuitem>Add bookmark</guimenuitem></menuchoice>. To move to that person from anywhere in the database, choose <menuchoice><guimenu>Bookmarks</guimenu><guisubmenu>Go to bookmark</guisubmenu><guimenuitem><replaceable>Person's name</replaceable></guimenuitem></menuchoice>.
fr: De façon semblable à la personne de Cujus, vous pouvez définir des signets pour faciliter la navigation. Pour mettre un signet sur une personne, rendez-la active par le moyen que vous voulez, puis choisissez <menuchoice><guimenu>Signets</guimenu><guimenuitem>Ajouter un signet</guimenuitem></menuchoice>. Pour aller vers cette personne, sélectionnez <menuchoice><guimenu>Signets</guimenu><guisubmenu>Liste des signets</guisubmenu><guimenuitem><replaceable>Nom de la Personne</replaceable></guimenuitem></menuchoice>.

source: You can manage your bookmarks by choosing <menuchoice><guimenu>Bookmarks</guimenu><guimenuitem>Edit bookmarks...</guimenuitem></menuchoice>. This opens the following <guilabel>Edit Bookmarks</guilabel> dialog with the list of bookmarks and the controls to modify this list.
fr: Vous pouvez gérer vos signets en choisissant <menuchoice><guimenu>Signets</guimenu><guimenuitem>Gérer les signets ...</guimenuitem></menuchoice>. Ceci lance la fenêtre de <guilabel>Gestion des signets</guilabel> avec la liste des signets et les contrôle pour la modifier.

source: Edit Bookmarks dialog
fr: Gestion des signets

source: Shows Edit Bookmarks dialog.
fr: La fenêtre de dialogue de gestion des signets

source: Finding records
fr: Rechercher

source: To find a record in a database, first switch to the appropriate View that provides the list of the desired records: People, Sources, Places, or Media. Then start typing the name of a person or the title of a Source, Place, or Media object that you are looking for, respectively. You may also press <keycap>Ctrl+F</keycap> to turn on the search mode, but simply staring to type is also enough.
fr: Pour trouver un enregistrement dans la base de donnée, vous devez vous trouver dans la "vue" appropriée : individus, sources, lieux, ou média. Puis écrivez le nom de la source, du lieux, ou de l'objet média que vous cherchez. Vous pouvez également faire <keycap>Ctrl+F</keycap> pour ouvrir en bas à droite, l'espace de recherche.

source: Type-ahead find
fr: Recherche d'en-tête

source: Shows type-ahead find.
fr: La fenêtre de recherche

source: As you type, the first record in the list that is compatible with your input will be selected.
fr: Les premières lettres que vous tapez sont recherchées.

source: Finding People
fr: Trouver des Individus

source: For more complex people searches you may want to use filters. Enable filter controls by choosing <menuchoice><guimenu>View</guimenu><guimenuitem>Filter</guimenuitem></menuchoice>, select the desired filter, and click <guibutton>Apply</guibutton>. For details, see <xref linkend="filters"/>
fr: Pour les recherches plus complexes, vous pouvez utiliser les filtres. <menuchoice><guimenu>Affichage</guimenu><guimenuitem>Filtre</guimenuitem></menuchoice>, sélectionner le filtre désiré , puis cliquer sur <guibutton>Appliquer</guibutton>. Pour plus de détails, voir <xref linkend="filters"/>

source: Generating Reports
fr: Produire des rapports

source: Reports are the most common form of the output produced by genealogical research. The majority of genealogical software puts a lot of emphasis on developing nice looking reports. GRAMPS is no exception in this regard, offering a choice of a variety of reports. GRAMPS can generate reports in a multitude of open formats, both text based and graphical. GRAMPS can also produce screen based reports that are convenient for viewing a summary of your database. Finally, GRAMPS can generate a web site suitable for immediate posting on the Internet. All of these are almost infinitely flexible. If you wish to modify or extend the default format of GRAMPS report, you can design and choose the style for each of your reports.
fr: Les rapports sont la plus simple façon de sortir des données pour un logiciel de généalogie. La plupart de ceux-ci proposent de belles impressions. GRAMPS le fait aussi en en offrant une grande variété. Il peut générer des sorties dans de nombreux formats de fichiers tant en texte qu'en graphiques. Il peut aussi générer des sorties en mode écran très pratiques pour avoir un résumé de la base de données. Enfin, GRAMPS peut fabriquer un site Web prêt pour la publication sur Internet. Tout cela est très adaptable, vous pouvez modifier et étendre ce qui est proposé sans limite et choisir votre style pour chaque sortie.

source: All reports can be accessed through the menu by choosing <menuchoice><guimenu>Reports</guimenu><guisubmenu><replaceable>Report Type</replaceable></guisubmenu><guimenuitem><replaceable>Particular Report</replaceable></guimenuitem></menuchoice>. Alternatively, you can browse the complete selection of available reports along with their brief descriptions in a <guilabel>Report Selection</guilabel> dialog invoked by clicking the <guibutton>Reports</guibutton> icon on the toolbar.
fr: Tous les rapports sont accessibles par le menu <menuchoice><guimenu>Rapports</guimenu><guisubmenu><replaceable>Type de rapport</replaceable></guisubmenu><guimenuitem><replaceable>rapport particulier</replaceable></guimenuitem></menuchoice>. Alternativement, vous pouvez passer en revue le choix complet des rapports disponibles avec leurs courtes descriptions avec l'icône <guilabel>Rapports</guilabel> de la barre d'outils.

source: Substitution Values
fr: Valeurs de substitution

source: Many of the graphical reports allow you to customize the information on the display. Variable substituions are used to substitute date for a particular symbol. There are two styles of variables. The difference between the two styles is how empty data is handled.
fr: La plupart des rapports graphiques vous permettent de personnaliser les informations affichées. Les variables de substitution sont représentées par des symboles particuliers. Il existe 2 styles de variables Leurs différences se trouvent dans la gestion des données vides.

source: The first style of variables are preceeded by a '$'. If the variable evaluates to an empty string, the variable is replaced with the empty string. The second style of variables are preceeded by a '%'. If the variable evaluates to an empty string, the line that contains the variable is removed from the output.
fr: Le premier style est une variable précédée par '$'. Si cette variable se rapporte à une chaîne vide alors elle sera remplacée par une chaîne vide. Le second style est une variable précédée par '%'. Si cette variable se rapporte à une chaîne vide alors la ligne contenant la variable sera retirée lors de la sortie.

source: Displays the person's name in the form of FirstName LastName
fr: Affiche le nom de l'individu : Prénom Nom

source: Displays the person's name in the form of LastName, FirstName
fr: Affiche le nom de l'individu : Nom Prénom

source: Displays the GRAMPS ID associated with the person.
fr: Affiche l'ID GRAMPS associé à l'individu.

source: Displays the person's date of birth
fr: Affiche la date de naissance de l'individu.

source: Displays the person's place of birth
fr: Affiche le lieu de naissance de l'individu.

source: Displays the person's date of death
fr: Affiche la date de décès de l'individu.

source: Displays the person's place of death
fr: Affiche le lieu de décès de l'individu.

source: Displays the name of the person's preferred spouse in the form of FirstName LastName
fr: Affiche le nom du conjoint préféré : Prénom Nom

source: Displays the name of the person's preferred spouse in the form of LastName, FirstName.
fr: Affiche le nom du conjoint préféré : Nom Prénom

source: Displays the marriage date of the person and the preferred spouse.
fr: Affiche la date de marriage de l'individu et de son conjoint préféré.

source: Displays the place assocated with the marriage of the person and the preferred spouse.
fr: Affiche le lieu du marriage de l'individu et de son conjoint préféré.

source: Books
fr: Livres

source: Currently, the only available report under this category is the Book Report.
fr: Il n'y a actuellement qu'une seule édition dans cette catégorie : l'édition Livre.

source: The Book Report creates a single document (i.e. a Book) containing a collection of graphical and textual reports. Consequently, this allows for a very rich set of documents that GRAMPS can produce.
fr: L'édition Livre produit un document unique (un livre) contenant un ensemble d'éditions graphiques et textuelles. En conséquence, ceci autorise tout l'ensemble des types de documents que GRAMPS peut générer.

source: When Book Report is selected, the following book configuration dialog appears:
fr: Quand l'édition Livre est sélectionnée, le dialogue de configuration suivant est affiché :

source: Book Report dialog
fr: Le rapport de livre

source: Shows Book Report dialog.
fr: La fenêtre du rapport de livre

source: The <guilabel>Book name</guilabel> text entry field is used to save the book (a set of configured selections) for future use. The top pane lists the items available for inclusion in the book. The bottom pane lists the currently selected items in the order they will appear in the book.
fr: La zone de saisie <guilabel>Nom du livre</guilabel> sert à sauvegarder le livre (en fait un ensemble de paramètres) pour servir plus tard. La partie supérieure liste les composants disponibles pour être inclus dans le livre. La partie inférieure liste les composants retenus et leur ordre dans le livre.

source: The horizontal set of buttons by the <guilabel>Book name</guilabel> field operates on the whole book. Click the <guibutton>Clear</guibutton> button to clear all items from the current book. Click the <guibutton>Save</guibutton> button to save the current book (under the name typed in the <guilabel>Book name</guilabel> text entry field) for future use.
fr: Les boutons alignés à droite de la zone <guilabel>Nom du livre</guilabel> agissent sur l'ensemble du livre. Le bouton <guibutton>Remettre à zéro</guibutton> supprime tous les composants du livre en cours de définition. Le bouton <guibutton>Enregistrer</guibutton> sauve le livre (sous le nom donné dans le champ <guilabel>Nom du livre</guilabel> pour être utilisé plus tard.

source: Saving the book also saves the configuration for each item.
fr: Remarquez que sauver le livre sauve aussi les réglages faits pour chaque composant.

source: Click the <guibutton>Open</guibutton> button to load the book from the list of previously saved books. Finally, click the <guibutton>Edit books</guibutton> button to invoke the editable list of available books.
fr: Le bouton <guibutton>Ouvrir</guibutton> harge un livre précédemment sauvé. Enfin le bouton <guibutton>Gestion des Livres</guibutton> ouvre un dialogue contenant la liste des livres disponibles pour permettre leur suppression.

source: The vertical set of buttons to the right of the bottom pane operates on the selected book item. Click the <guibutton>Add</guibutton> button to add selected item from the available list to the current book. Click the <guibutton>Remove</guibutton> button to remove an item from the current book. Use <guibutton>Up</guibutton> and <guibutton>Down</guibutton> to change the items order in the current book. Click the <guibutton>Setup</guibutton> button to configure the options of the selected item of the current book.
fr: Les boutons alignés verticalement à droite de la liste des documents agissent sur le composant sélectionné. Le bouton <guibutton>Ajouter</guibutton> ajoute le composant sélectionné dans le livre en cours de définition. Le bouton <guibutton>Enlever</guibutton> retire au contraire le composant sélectionné du livre. Les boutons <guibutton>Haut</guibutton> et <guibutton>Bas</guibutton> déplacent le composant sélectionné dans le livre, en l'avançant ou le reculant d'un composant. Le bouton <guibutton>Configurer</guibutton> sert à définir les options du composant sélectionné.
