Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: The <guilabel>Internet</guilabel> tab displays Internet addresses relevant to the person. The bottom part lists all such Internet addresses and accompanying descriptions. The top part shows the details of the currently selected addresses in the list (if any). The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> let you add, modify, and remove an Internet address. The "Go" button (represented by an icon having a green arrow and yellow circle) opens your web browser and takes you directly to the highlighted page. Note that the <guibutton>Edit</guibutton>, <guibutton>-</guibutton>, and <guibutton>Go</guibutton> buttons become available only when an address is selected from the list.
fr: L'onglet <guilabel>Internet</guilabel> affiche les informations sur les adresses Internet de la personne et permet leur modification. La partie du bas affiche la liste de tous les adresses Internet de la personne considérée. La partie du haut montre le détail de l'adresse sélectionnée s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> permettent respectivement l'ajout, la modification et la suppression d'une adresse. Le bouton <guibutton>Ouvrir cette page</guibutton> permet d'ouvrir une page Internet avec votre navigateur favori. Notez que les boutons <guibutton>Editer</guibutton>, <guibutton>-</guibutton> et <guibutton>Ouvrir cette page</guibutton> ne sont disponibles que lors de la sélection d'une adresse dans la liste.

source: Edit Person dialog - Internet
fr: Éditer un individu - Internet

source: Shows Internet Tab of Edit Person dialog.
fr: La fenêtre de dialogue d'un individu - internet

source: The <guilabel>LDS</guilabel> (Latter Days Saints) tab lets you view and edit information about LDS ordinances of the person. These are LDS Baptism, Endowment, and Sealed to Parents ordinances, as labeled inside the tab. Each ordinance is described by its date, LDS temple, and Place where it happened. An additional pop-up menu, "Parents," is available for the Sealed to Parents ordinance. Each ordinance can be further described through the selections available in the Status pop-up menu. It can also be include notes and references to sources through the corresponding <guibutton>Sources...</guibutton> and <guibutton>Note</guibutton> buttons.
fr: L'onglet <guilabel>LDS</guilabel> affiche les informations d'ordinances LDS de la personne et permet de les modifier. Ce sont le <guilabel>Baptême Mormon</guilabel>, la <guilabel>Dotation</guilabel> et les <guilabel>Parents Officiels</guilabel> . Chaque ordinance est décrite par sa date, son Temple Mormon et son lieu. Un menu déroulant <guilabel>Parents</guilabel> est en plus disponible pour les <guilabel>Parents Officiels</guilabel>. Chaque ordinance peut ensuite recevoir un statut par le menu déroulant <guilabel>Statut</guilabel> ainsi qu'une source et des notes par les boutons <guibutton>Sources...</guibutton> et <guibutton>Note</guibutton>.

source: Edit Person dialog - LDS
fr: Éditer un individu - LDS

source: Shows LDS Tab of Edit Person dialog.
fr: La fenêtre de dialogue d'un individu - lds

source: Editing Dates
fr: Les dates

source: This section describes how to enter and modify dates. Since dates are so important in genealogical research, GRAMPS takes special care to preserve and use any date information available.
fr: Cette section décrit les détails des dates entrantes et de modifications. Les dates sont importantes dans la recherche généalogique, ainsi GRAMPS va préserver et employer n'importe quelle information de date disponible.

source: Information can be entered into a date field by directly typing it or by invoking the Date selection dialog. Both methods will be discussed below, but first, we will cover some important features of dates as they are used in GRAMPS.
fr: L'information peut être saisie directement dans le champ date ou en appelant le dialogue de sélecteur de dates. Les deux méthodes seront décrites plus tard, tout d'abord, nous allons préciser comment les dates sont gérées dans GRAMPS.

source: Dates in GRAMPS are classified according to the following types:
fr: Les dates dans GRAMPS sont classées selon les types suivants:

source: Regular
fr: Normal (Régulier)

source: A "regular" date is one which includes a specific day, date, or month. It can be complete (e.g., June 6, 1990) or partial (e.g., July 1977).
fr: Une date "normale" (régulière) est celle qui a un jour, mois, ou année. Celà peut être complet (e.g., Juin 6, 1990) ou partiel (e.g., Juillet 1977).

source: Before
fr: Avant

source: A "before" date is one that can only be identified as occurring before a certain day, month, or year.
fr: Une date "avant" ne peut qu'être identifiée comme avant un certain jour, mois, ou année.

source: After
fr: Après

source: An "after" date is one that occurs after a certain day, month, or year.
fr: Une date "après" ne peut qu'être identifiée comme après un certain jour, mois, ou année.

source: Range
fr: Etendue

source: A "range" describes a time period during which the event occurred. For example, "between January 1932 and March 1932."
fr: Une date "étendue" décrit une période durant laquelle c'est peut être produit l'événement. Par exemple, "entre Janvier 1932 et Mars 1932."

source: Span
fr: Incrémenté(e)

source: A "span" describes a time period during which a condition existed. For example, "from May 12, 2000 to February 2, 2002."
fr: Une date "incrémentée" décrit une période durant laquelle c'est produit l'événement. Par exemple, "de Mai 12, 2000 à Février 2, 2002."

source: Date formats and parsing rules
fr: Les entrées acceptables

source: GRAMPS recognizes dates entered in a variety of formats. The default numeric format is that which is conventional for the environment is which GRAMPS is operating; that is, DD.MM.YYYY for most European countries, MM/DD/YYYY for the U.S., and so on.
fr: Les entrées de dates acceptables GRAMPS identifient beaucoup de formats des dates exactes. Les formats numériques sont déterminés par l'environnement GRAMPS de défaut. La plupart des pays européens emploient DD.mm.yyyy, les USA emploient généralement MM/dd/yyyy, et ainsi de suite.

source: Besides exact dates, GRAMPS recognizes many dates that are not regular: before, after, about, ranges and spans. It also understands the quality: estimated or calculated. Finally, it supports partial dates and many alternative calendars. Below is the list of date entry rules to allow precise date parsing.
fr: Sans compter qu'avec les dates exactes, GRAMPS identifie beaucoup de dates qui ne sont pas régulières: avant, ensuite, environ, gammes et envergures. Il comprend également la qualité: estimé ou calculé. En conclusion, il soutient les dates partielles et beaucoup de calendriers alternatifs. Ci-dessous se trouve la liste de règles d'entrée de date à accordez pour l'analyse.

source: Date parsing rules
fr: Les règles du parser de date

source: The list only applys to the English version of GRAMPS. If you are using localized version of GRAMPS, your version may or may not provide a localized date parser. At the time of this writing, localized parsers exist for French, German, Russian, Finnish, Dutch and Spanish languages.
fr: La liste ci-dessous est seulement valide pour l'anglais. Si vous employez la version localisée de GRAMPS, votre version peut ou pas fournir un analyseur localisé de date. À l'heure de cette écriture, les analyseurs localisés existent pour des langues françaises, russes, et espagnoles.

source: If the localized parser is available for your version, chances are that other rules are in effect. If there is no manual in your language yet, you may try following your instinct and go with the common ways of denoting dates in your language. If all else fails, use the <guilabel>Date selection</guilabel> dialog described below.
fr: S'il n'y a aucun manuel en votre langue, vous pouvez essayer d'après votre instinct et aller de pair avec les manières communes de noter les dates en votre langue. Si tout échoue, employez le <guilabel>sélecteur de Date</guilabel> décrit ci-dessous.

source: Regular single dates can be entered just as you would write them. Examples: May 24, 1961 or January 1, 2004.
fr: Les dates régulières peuvent être écrites juste comme vous les écririez dans une lettre : Mai 24, 1961 ou janvier 1, 2004.

source: Dates that are not regular should start with the quality: <guilabel>estimated</guilabel> or <guilabel>calculated</guilabel>, if applicable. Example: est. 1961, or calc 2005. (Note that a quality does not need to be specified for regular dates.)
fr: Les dates qui ne sont pas régulières devraient commencer par la qualité:<guilabel> estimé(e)</guilabel> ou <guilabel>calculé(e)</guilabel>, si c'est approprié. La qualité régulière n'a pas besoin d'être indiquée, car c'est le défaut. Exemple: est. 1961, ou CALC 2005.

source: After the quality should appear the type. If the type is <guilabel>before</guilabel>, <guilabel>after</guilabel>, or <guilabel>about</guilabel>, you scan specify the type by writing "before", "after" or "about". If the type is a range, write "between DATE and DATE", and if the type is a span, write "from DATE to DATE". patterns, where DATE is a single date.
fr: Après devrait apparaître le type: <guilabel>avant</guilabel>,<guilabel> après</guilabel>, ou <guilabel>vers</guilabel>. Des gammes sont dénotées avec "entre la DATE et la DATE" et les modèles "de DATE d'utilisation d'envergures jusqu'ici", où la DATE représente une seule date.

source: Examples: est from 2001 to 2003, before June 1975, est about 2000, calc between May 1900 and January 1, 1990.
fr: Exemples: est de 2001 à 2003, avant juin 1975, est vers 2000, CALC entre mai 1900 et janvier 1, 1990.

source: Partial dates are entered simply by omitting unknown information. Examples: May 1961 and 2004.
fr: Les dates partielles sont écrites simplement en omettant l'information inconnue: Mai 1961, 2004.

source: Alternate calendars are calendars other than the Gregorian calendar. Currently, GRAMPS supports Hebrew, French Republican, Julian, Islamic, and Persian alternate calendars. To specify the calendar other than the default Gregorian, append the name of the calendar to the date string, e.g. "January 9, 1905 (julian)".
fr: Les calendriers alternatifs sont des calendriers autres que le calendrier grégorien. Actuellement, GRAMPS soutient l'hébreu, les calendriers alternatifs républicain, juliens, islamiques, et persans. Pour indiquer le calendrier autre que le défaut grégorien, apposez le nom du calendrier aux caractères de datation, par exemple. "janvier 9, 1905 (julien)".

source: Date Validity Indicators
fr: Types de dates et les cercles de couleur

source: GRAMPS uses color circles to indicate the validity of the entered date.
fr: Des indicateurs GRAMPS existent, pour indiquer la validité de la date écrite.

source: Date LED buttons
fr: Boutons Date LED

source: The color circles are also referred to as the LED buttons. Clicking on an LED button will invoke the <guilabel>Date selection</guilabel> dialog described in detail below, see <xref linkend="adv-dates-gui"/>
fr: La date LED est identifiée par des cercles de couleur, désignés également sous le nom de boutons LED.Cliquer sur un bouton de LED appellera le <guilabel>Sélecteur de Date</guilabel> décrit en détail ci-dessous, voir la section <xref linkend="adv-dates-gui"/>

source: A green circle means that the date is valid and complete regular date (e.g. May 24, 1961). In simple terms, green means that the date corresponds to a unique date.
fr: Un point vert signifie que la date est valide et complètement connue (par exemple 24 mai 1961).

source: Yellow circle means that the date is valid but is not a regular date. This could be the date of a different type: a before date (before May 25, 1962), an after date (after May, 1960), an about date (about May 23, 1961), a range (between May 1, 1961 and May 31, 1961), or a span (from May 1, 1961 to May 31, 1961). It can also be a complete single date, but with quality of Estimated or Calculated. Finally, it could be a partial date, i.e. a regular quality single date missing some portion, e.g. May 1961 or 1961.
fr: Un point jaune signifie que la date est valide mais partiellement connue seulement (par exemple 1961, vers 1961, entre 1960 et 1961, avant 1963).

source: While partial dates do not uniquely define the day, they allow at least for some type of comparisons between the dates.
fr: Même si une une date incomplète n'est pas exactement connue, elle permet quand même certaines comparaisons.

source: Red circle means that the date is not recognized as a valid date (e.g. "Christmas week of 61", or "the summer when I had surgery"). In such a case the date will be stored as a text string and therefore cannot be compared other dates. As you can see, it is best to avoid such date entries. It would be better, for example, to enter a date of "December 1961" and then to add the note "Christmas week of '61."
fr: Un point rouge signifie que la date n'est pas valide (par exemple semaine de Noël 61). Dans ce cas, la date est conservée comme une chaîne de caractères. On ne peut en conséquence pas faire de comparaison sur cette date. Il est préférable d'éviter ce genre de saisie. On peut mettre de telles informations dans une note. L'exemple considéré devrait être codé comme une date "Décembre 1961", correcte bien qu'incomplète, accompagnée d'une note contenant "semaine de Noël en 61".

source: Graphical User Interface for Entering Dates
fr: L'interface graphique pour entrer les dates

source: While the above parsing rules provide a guide for you to type in most common dates, you can also use <guilabel>Date selection</guilabel> dialog. The dialog is particularly useful for building a complex date or for simply insuring that your information is entered in a way GRAMPS will understand. The <guilabel>Date selection</guilabel> dialog can be invoked by clicking the colored circle button next to the date entry field.
fr: L'interface graphique ainsi que les règles ci-dessus fournissent une manière rapide et facile pour écrire la plupart des dates, parfois il y a un besoin d'établir une date complexe ou vérifier simplement la date en utilisant l'interface utilisateur graphique. La fenêtre <guilabel>Sélecteur de Date</guilabel> peut être appelée en cliquant sur le bouton de cercle de couleur (également connu sous le nom de bouton de LED) à côté du champ d'entrée de date.

source: Date selection dialog
fr: Sélecteur de Date

source: Shows Date selection dialog.
fr: La fenêtre de dialogue de sélection d'une date

source: The <guilabel>Calendar</guilabel> menu lets you choose a calendar other than the default Gregorian. The <guilabel>Quality</guilabel> menu gives you the choices of Regular, Estimated, or Calculated. The <guilabel>Type</guilabel> menu allows you establish the exact date type: Regular, Before, After, About, Range, Span, and Text only. You can set the <guilabel>Date</guilabel> by setting the day, the month, and the year. In the event that your date type is Range or Span, the <guilabel>Second date</guilabel> will be activated. Finally, the <guilabel>Text comment</guilabel> text entry field allows storing an arbitrary text string along with the date.
fr: Le menu <guilabel>Calendrier</guilabel> permet de choisir le calendrier supporté. Le menu <guilabel>Qualité</guilabel> fournit des choix de qualité : normal, estimé(e), ou calculé(e). Le menu <guilabel>Type</guilabel> laisse ajuster le type exact de date: normal, avant, après, vers, étendue, incrémenté(e), et texte seulement. Un ensemble de commandes marquées <guilabel>Date</guilabel> laisse placer le jour, le mois et l'année d'une date. Les deuxièmes commandes <guilabel>Deuxième date</guilabel>, laissent placer les détails de la deuxième date. Enfin, le champ d'enregistrement <guilabel>Commentaires</guilabel> associe du texte avec la date.

source: If you have an important comment to make about a date, you are better off doing so in a Note that corresponds to the event than in the Text comment field of the Date selection dialog. We recommend this for the following reason: If you enter a date by typing it directly into the date field (that is, not via the Date selector dialog), your entry will be copied and stored as the text comment string when GRAMPS parses the entered text. Thus, any comment that may have been there prior to the parsing will be overwritten.
fr: Si vous écrivez la date en dehors de ce dialogue, c.-à-d.. comme texte dans n'importe quel domaine d'entrée de date, ce texte sera copié et stocké comme un chaîne de commentaire de texte. Par conséquent, le commentaire vit seulement jusqu'à la prochaine analyse. Si vous avez un certain texte important à faire correspondre avec la date, vous feriez mieux de l'enregistrer comme note pour l'événement correspondant.

source: Editing Information About Relationships
fr: Les liens familiaux

source: Information about relationships is entered and edited through the <guilabel>Marriage/Relationship Editor</guilabel> dialog. This dialog is invoked from Family View by double-clicking the Spouse box
fr: L'édition de données familiales est effectuée dans le dialogue <guilabel>Editeur de mariage et de relation</guilabel>, qui apparaît après avoir double-cliqué sur la zone du conjoint dans la vue de famille.

source: You can also invoke this dialog by right-clicking inside the Spouse box and selecting "Edit relationship" item from the context menu that pops up.
fr: Alternativement, vous pouvez appeler ce dialogue en cliquant dans la boîte de conjoint ou en choisissant l'"éditeur de relation" dans le menu contextuel.

source: Marriage/Relationship Editor dialog
fr: Editeur de mariage et de relation

source: Shows Marriage/Relationship Editor dialog.
fr: La fenêtre de dialogue d'édition d'une relation

source: The top of the window shows the names of the people whose relationship is being edited. The main part of the window displays seven notebook tabs representing different categories of information about the relationship. Click any tab to view or edit the information it contains. The bottom part has <guibutton>OK</guibutton> and <guibutton>Cancel</guibutton> buttons. Clicking the <guibutton>OK</guibutton> button at any time will apply all the changes made in all tabs and close the dialog window. Clicking the <guibutton>Cancel</guibutton> button at any time will close the window without applying any changes. If any of the data in any tab is modified, an alert window will appear that will prompt you choose between closing the dialog without saving changes, canceling the initial cancel request, or saving the changes.
fr: La fenêtre d'édition de Marriage/Relations montre les noms des individus dont la relation est éditée. La partie principale contient sept onglets différents ( ou étiquettes), contenant différentes catégories d'information. Vous pouvez mettre n'importe quelle étiquette au dessus, pour le visionnement ou l'édition, en cliquant sur le titre approprié d'étiquette. La partie inférieure contient les boutons <guibutton>Valider</guibutton> et <guibutton>Annuler</guibutton>.Cliquer sur le bouton <guibutton>Annuler</guibutton> à tout moment, fermera la fenêtre en appliquant aucun changement. Si une partie quelconque des données dans n'importe quelle étiquette était modifiée, la fenêtre alerte apparaîtra avec les choix de clôturer le dialogue sans enregistrement ou de sauver les changements

source: Clicking <guibutton>OK</guibutton> will immediately save changes to the database. This version of GRAMPS does not have a separate saving function, all changes are immediate.
fr: En cliquant sur <guibutton>Valider</guibutton>, GRAMPS sauvera immédiatement les changements à la base de données (écriture sur le disque).Cette version de GRAMPS n'a pas de fonction séparée d'enregistrement, tous les changements sont immédiats.

source: The tabs provide the following information categories of relationship data:
fr: Les onglets (ou étiquettes) fournissent les catégories suivantes d'informations :

source: The <guilabel>General</guilabel> tab lets you edit the Relationship type. The available types (such as Married, Unmarried, etc.) can be chosen from the drop-down <guilabel>Relationship type</guilabel> menu. The <guilabel>GRAMPS ID</guilabel> field displays the ID number which labels this relationship in the database. The <guilabel>Last changed</guilabel> label shows the last time the relationship was modified. Finally, the Information is complete check button indicates whether the record of this relationship is complete or not.
fr: L'onglet <guilabel>Général</guilabel> permet la modification de la donnée la plus générale sur la relation : son type. Il est choisi à l'aide de la liste déroulante Type de relation parmi les choix suivants : mariés, partenaires... Le champ non modifiable <guilabel>ID</guilabel> affiche le numéro interne à GRAMPS qui identifie cette relation dans la base de données. Le champ <guilabel>Dernière modification</guilabel> affiche la dernière modification pour ce couple. Enfin, la case à cocher l'<guilabel>Information est complète</guilabel> donne le moyen de marquer la relation comme étant complètement renseignée ou pas.

source: The <guilabel>Events</guilabel> tab lets you view and edit events relevant to the relationship. The bottom part displays the list of all such events stored in the database. The top part shows the details of the currently selected event in the list (if any). The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> let you add, modify, or remove an event record from the database. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when an event is selected from the list.
fr: L'onglet <guilabel>Evénements</guilabel> présente les informations sur les évènements liés à la relation. La partie du bas de la fenêtre contient la liste des évènements. Le haut montre le détail de l'évènement sélectionné s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> permettent respectivement d'ajouter, modifier et supprimer un évènement de la base de données. Les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont activés que lorsqu'un évènement est sélectionné.

source: The <guilabel>Attributes</guilabel> tab lets you view and edit particular information about the relationship that can be expressed as attributes. The bottom part displays the list of all such attributes stored in the database. The top part shows the details of the currently selected attribute in the list (if any). The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> let you add, modify, or remove an attribute. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when an attribute is selected from the list.
fr: L'onglet <guilabel>Attributs</guilabel> affiche les valeurs des attributs de la relation et permet leur modification. Un attribut est en fait n'inmporte quelle couple Paramètre- Valeur. La partie du bas de la fenêtre montre la liste de tous les attributs conservés dans la base de données. La partie du haut montre le détail de l'attribut sélectionné s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> vous permettent respectivement d'ajouter, modifier et supprimer un attribut et sa valeur pour la relation. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles qu'après avoir sélectionné un attribut dans la liste.
