Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: Advanced manipulation of settings
fr: Manipulation avançée des préférences

source: The contents of this section is outside the scope of interest of a general user of GRAMPS. If you proceed with tweaking the options on the low level you may damage your GRAMPS installation. Be careful. YOU HAVE BEEN WARNED!
fr: Le contenu de cette section est en dehors de la portée d'un utilisateur général de GRAMPS. Si vous continuez, vous pouvez endommager votre installation de GRAMPS Faites attention. VOUS AVEZ ÉTÉ AVERTIS!

source: By default, GRAMPS stores its settings using gconf2 system. All the settings used in this version of GRAMPS are stored in subdirectories under <filename>/apps/gramps/</filename> in the gconf2 namespace. Accessing the keys can be done either using <command>gconftool-2</command> command line tool, or the <command>gconf-editor</command> GUI tool.
fr: Par défaut, GRAMPS stocke ses préférences en utilisant le système gconf2. Toutes les préférences utilisés dans cette version de GRAMPSGRAMPS sont stockés dans les sous-répertoires <filename>/apps/gramps/</filename> L'accès aux clefs peut être fait avec <command>gconftool-2</command> en ligne de commande, ou <command>gconf-editor</command> Outil de GUI.

source: All keys are documented, and the notification mechanisms are used as appropriate. Therefore, updating keys from outside of GRAMPS should lead to updating GRAMPS in real time, without necessarily restarting it.
fr: Toutes les clefs sont documentées, et les mécanismes d'avis sont employés comme appropriés. Par conséquent, la mise à jour des clefs à l'extérieur de GRAMPS devrait mener à mettre à jour GRAMPS en temps réel, sans le remettre en marche nécessairement.

source: Frequently Asked Questions
fr: Questions Fréquemment Posées

source: This appendix contains the list of questions that frequently come up in mailing list discussions and forums. This list is by no means complete. If you would like to add questions/answers to this list, please email your suggestions to <ulink url="mailto:gramps-devel@lists.sf.net" type="mailto">gramps-devel@lists.sf.net</ulink>
fr: Cette annexe répond aux questions les plus fréquemment posées sur les listes de discussions et les forums. Elle n'est évidemment pas limitative. Si vous souhaitez ajouter des questions et/ou des réponses, envoyez un message électronique à <ulink url="mailto:gramps-devel@lists.sf.net" type="mailto">gramps-devel@lists.sf.net</ulink>

source: What is GRAMPS?
fr: Qu'est ce que GRAMPS?

source: GRAMPS is the Genealogical Research and Analysis Management Program System. In other words, it is a personal genealogy program letting you store, edit, and research genealogical data using the powers of your computer.
fr: GRAMPS est un Système de Recherche et d'Analyse Généalogique (Genealogical Research and Analysis Management Program System). Autrement dit, c'est un programme personnel de généalogie qui vous permet de conserver, modifier et chercher dans des données généalogiques, avec l'aide de l'ordinateur.

source: Where do I get it and how much does it cost?
fr: D'où l'obtiens-je et combien coûte-t-il?

source: GRAMPS can be downloaded from <ulink url="http://sf.net/projects/gramps" type="http">http://sf.net/projects/gramps</ulink> at no charge. GRAMPS is an Open Source project covered by the GNU General Public License. You have full access to the source code and are allowed to distribute the program and source code freely.
fr: GRAMPS peut être téléchargé gratuitement depuis le site Internet <ulink url="http://sf.net/projects/gramps" type="http">http://sf.net/projects/gramps</ulink> C'est un projet Open Source publié sous la licence GNU GPL. Vous avez complètement accès aux programmes sources et vous avez le droit de redistribuer le programme et les sources librement.

source: Does it work with Windows (tm)?
fr: Fonctionne-t'il avec Windows (tm)?

source: No. GRAMPS uses the GTK and GNOME libraries. While the GTK libraries have been ported to Windows, the GNOME libraries have not. This, however, may change in the future.
fr: Non. GRAMPS utilise les librairies GTK et GNOME. Les librairies GTK ont été portées sous Windows, mais pas les librairies GNOME. Cependant, cela pourrait changer un jour.

source: Does it work with the Mac?
fr: Fonctionne-t'il sur Macintosh

source: <ulink url="http://fink.sourceforge.net" type="http"> The Fink project</ulink> has ported <ulink url="http://fink.sourceforge.net/pdb/package.php/gramps" type="http"> some older versions</ulink> of GRAMPS to OSX (tm). The Mac OSX port is not directly supported by the GRAMPS project, primarily because none of the GRAMPS developers have access to Mac OSX and because OSX is not Free Software.
fr: <ulink url="http://fink.sourceforge.net" type="http"> Le projet Fink </ulink> a porté <ulink url="http://fink.sourceforge.net/pdb/package.php/gramps" type="http"> quelques anciennes versions </ulink> de GRAMPS vers OSX (tm).La version Mac OSX n'est pas directement supportée par le projet surtout parce qu'aucun développeur de GRAMPS n'a accès à Mac OSX.

source: This version of GRAMPS (2.0.0) does not appear to have been ported by the Fink project. Please contact the Fink project for more information.
fr: La version GRAMPS (2.0.0) n'a pas été portée par le projet Fink. Vous êtes priés de contacter le projet Fink pour plus d'information.

source: Some people have had success using the DarwinPorts instead of the Fink project.
fr: Quelques personnes ont réussi en utilisant le DarwinPorts plutôt que le Fink project.

source: Does it work with KDE?
fr: Fonctionne-t'il avec KDE ?

source: Yes, as long as the required GNOME libraries are installed.
fr: Oui, à condition que les librairies GNOME nécessaires soient installées.

source: Do I really have to have GNOME installed?
fr: Dois-je vraiment installer GNOME ?

source: Yes, but you do not have to be running the GNOME desktop.
fr: Oui, mais il n'est pas obligatoire d'utiliser le bureau GNOME.

source: What version of GNOME do I need?
fr: De quelle version de GNOME ai-je besoin ?

source: This version of gramps requires GNOME 2.8.0 or higher. Previous versions in 1.0.x series required GNOME 2.0.
fr: Cette version de GRAMPS exige GNOME 2,8,0 ou plus haut. Les versions précédentes des séries 1.0.x ont exigé GNOME 2,0.

source: Is GRAMPS compatible with other genealogical software?
fr: GRAMPS est-il compatible avec d'autres logiciels de généalogie ? (GenApps)

source: GRAMPS makes every effort to maintain compatibility with GEDCOM, the general standard of recording genealogical information. We have import and export filters that enable GRAMPS to read and write GEDCOM files.
fr: GRAMPS fait tout ce qui est possible pour rester compatible avec le format de données généalogique standard Gedcom. Nous avons des filtres de lecture et d'écriture pour les fichiers Gedcom.

source: It is important to understand that the GEDCOM standard is poorly implemented -- virtually every genealogical software has its own "flavor" of GEDCOM. As we learn about new flavor, the import/export filters can be created very quickly. However, finding out about the unknown flavors requires user feedback. Please feel free to inform us about any GEDCOM flavor not supported by GRAMPS, and we will do our best to support it!
fr: Il faut savoir que le format Gedcom est mal utilisé. Chaque logiciel de généalogie a sa propre variante de Gedcom. Quand nous avons connaissance d'une variante, il est très rapide de créer les filtres de lecture et d'écriture. Par contre, trouver les variantes demande d'avoir l'information de la part des utilisateurs. N'hésitez pas à nous signaler une variante non supportée par GRAMPS, , nous ferons ensuite de notre mieux pour la supporter !

source: Can GRAMPS read files created by other genealogy programs?
fr: GRAMPS peut-il lire des fichiers créés par GenApp X?

source: See above.
fr: Voir ci-dessus.

source: Can GRAMPS write files readable by other genealogy programs?
fr: GRAMPS peut-il écrire des fichiers pour GenApp X?

source: Can GRAMPS print a genealogical tree for my family?
fr: GRAMPS peut-il imprimer mon arbre généalogique?

source: Yes. Different people have different ideas of what a genealogical tree is. Some think of it as a chart going from the distant ancestor and listing all his/her descendants and their families. Others think it should be a chart going from the person back in time, listing the ancestors and their families. Yet other people think of a table, text report, etc.
fr: Oui. Chacun a son idée sur comment doit être dessiné un arbre généalogique. Certains pensent qu'il faut montrer toutes les familles depuis un ancêtre lointain jusqu'à la racine de l'arbre, d'autres qu'il faut remonter de la personne actuelle et montrer tous ses ancêtres et leurs familles. D'autres encore pensent à un tableau, à des éditions en mode texte.

source: GRAMPS can produce any of the above, and many more different charts and reports. Moreover, the plugin architecture enables users (you) to create their own plugins which could be new reports, charts, or research tools.
fr: GRAMPS peut faire tout cela, en des présentations très variées ainsi que d'autres encore. Plus généralement, le principe de greffons (plugins) permet aux utilisateurs et donc à vous-même, de créer vos propres greffons qui créent vos propres rapports, états ou sorties papier pour aider vos recherches.

source: In what formats can GRAMPS output its reports?
fr: Dans quels formats GRAMPS peut-il produire ses rapports?

source: Text reports are available in HTML, PDF, AbiWord, KWord, LaTeX, RTF, and OpenOffice formats. Graphical reports (charts and diagrams) are available in PostScript, PDF, SVG, OpenOffice, and GraphViz formats.
fr: Les formats de texte disponibles dans les formats sont : HTML, PDF, AbiWord, KWord, LaTeX, RTF, et OpenOffice. Les impressions graphiques (dessins et diagrammes) sont disponibles en formats PostScript, PDF, SVG, OpenOffice et GraphViz.

source: Is GRAMPS compatible with the Internet?
fr: GRAMPS est-il compatible avec Internet?

source: GRAMPS can store web addresses and direct your browser to them. It can import data that you download from the Internet. It can export data that you could send over the Internet. GRAMPS is familiar with the standard file formats widely used on the Internet (e.g. JPEG, PNG, and GIF images, MP3, OGG, and WAV sound files, QuickTime, MPEG, and AVI movie files, etc). Other than that, there is little that a genealogical program can do with the Internet.
fr: GRAMPS peut il garder des liens web et envoyer votre navigateur web vers eux. Il peut importer des données que vous téléchargez depuis le Réseau. Il peut exporter des données que vous y enverrez. Il connait les formats de fichiers courants (JPEG, PNG et GIF pour les images, MP3, OGG et WAV pour les sons, QuickTime, MPEG et AVI pour les video). A part cela, il n'y a pas grand chose d'autre qu'un généalogiste puisse faire avec Internet :-) .

source: Can I create custom reports/filters/whatever?
fr: Puis-je créer une édition, un filtre ou un machin ?

source: Yes. There are many levels of customization. One is creating or modifying the templates used for the reports. This gives you some control over the fonts, colors, and some layout of the reports. You can also use GRAMPS controls in the report dialogs to tell what contents should be used for a particular report. In addition to this, you have an ability to create your own filters -- this is useful in selecting people based on criteria set by you. You can combine these filters to create new, more complex filters. Finally, you have an option to create your own plugins. These may be new reports, research tools, import/export filters, etc. This assumes some knowledge of programming in Python.
fr: Oui. Il y a beaucoup de façons de personnaliser GRAMPS. Vous pouvez modifier ou créer les modèles d'impressions. Vous avez ainsi le contrôle des polices de caractères, des couleurs et d'éléments de la disposition des impressions. Vous pouvez aussi utiliser les réglages de GRAMPS pour choisir les informations servant à préparer l'impression. En plus de tout cela, vous pouvez créer vos propres filtres. Cela sert à sélectionner des individus selon vos besoins. Vous pouvez combiner ces filtres pour constituer des filtres plus élaborés. Enfin, vous pouvez créer vos greffons. Ils peuvent servir à définir des rapports, des outils d'aide à la recherche ou encore des filtres de lecture ou d'écriture de données. Cela demande la connaissance de la programmation en Python.

source: What standards does GRAMPS support?
fr: Quels standards GRAMPS supporte-t'il ?

source: The nice thing about standards is that there never is a shortage of them. GRAMPS is tested to support the following flavors of GEDCOM: GEDCOM5.5, Brother's Keeper, Family Origins, Family Tree Maker, Ftree, GeneWeb, Legacy, Personal Ancestral File, Pro-Gen, Reunion, and Visual Genealogie.
fr: L'amusant à propos des standards est qu'on ne risque pas d'en manquer :-).GRAMPS supporte les variantes suivantes de Gedcom : GEDCOM5.5, Brother's Keeper, Family Origins, Familty Tree Maker, Ftree, GeneWeb, Legacy, Personal Ancestral File, Pro-Gen, Reunion et Visual Genealogie.

source: What is the maximum database size (bytes) GRAMPS can handle?
fr: Quelle est la taille maximale d'une base de données GRAMPS ?

source: GRAMPS has no hard limits on the size of a database that it can handle. Starting with this release, GRAMPS no longer loads all data into memory, which allows it to work with a much larger database than before. In reality, however, there are practical limits. The main limiting factors are the available memory on the system and the cache size used for BSDDB database access. With common memory sizes these days, GRAMPS should have no problem using databases with tens of thousands of people.
fr: GRAMPS n'a pas de limite stricte sur la taille de sa base de données. Il y a seulement des limites pratiques. Pour le moment, charge ses données en mémoire, qui devient alors la ressource critique.

source: How many people can GRAMPS database handle?
fr: Combien de personnes peut-on mettre dans une base de données GRAMPS ?

source: We have found that on a typical system, GRAMPS tends to bog down after the database has around 150,000 people. Again, this is dependent on how much memory you have.
fr: Nous avons expérimenté que GRAMPS tient jusqu'environ 15000 personnes sur une configuration moyenne. Encore une fois, cela dépend en fait de la taille mémoire du système.

source: Why is GRAMPS running so slowly?
fr: Pourquoi GRAMPS est-il si lent ?

source: It does not anymore! Just try out the current version, 2.0.0.
fr: Plus maintenant! Essayez juste la version en cours, 2.0.0.

source: My database is really big. Is there a way around loading all the data into memory?
fr: Ma base de données est vraiment très grosse. Y-a t'il un moyen de la charger sans tout charger en mémoire ?

source: Starting with this release, GRAMPS no longer loads all data into memory, which allows it to work with a much larger database than before.
fr: GRAMPS ne charge plus toutes les données en mémoire, ce qui lui permet de fonctionner avec une base de données beaucoup plus grande qu'avant.

source: I want to rerun the Startup dialog. How do I do this?
fr: Je veux relancer le dialogue d'installation (assistant). Comment faire ?

source: GRAMPS keeps a flag in the GNOME configuration database to indicate that the startup dialog has been run. To cause GRAMPS to rerun this, the flag needs to be reset. This can be done with the following command:
fr: GRAMPS gère un état dans les données de configuration GNOME pour mémoriser le fait que le dialogue d'installation a été exécuté. Ceci peut se faire par la commande suivante :

source: Why are non-latin characters displayed as garbage in PDF/PS reports?
fr: Pourquoi est-ce que des caractères non-latins sont montrés comme ordures dans des rapports de PDF/ps?

source: This is a limitation of the builtin fonts of PS and PDF formats. To print non-latin text, use the Print... in the format selection menu of the report dialog. This will use the gnome-print backend, which supports PS and PDF creation, as well as direct printing.
fr: C'est une limitation des polices des formats de pdf. Pour imprimer le texte non-latin, utilisez l'impression de GNOME.

source: If you only have latin text, the PDF option will produce a smalled PDF compared to that created by gnome-print, simply because no font information will be embedded.
fr: Si vous n'avez que du texte latin, l'option PDF option produira un petit PDF comparé à celui produit par gnome-print, simplement parce qu'aucune information sur la police n'a été renseignée.

source: Why can I not add/remove/edit columns to the lists in People View and Family View?
fr: Pourquoi ne peut on pas modifier les colonnes dans la vue des Familles et des Individus ?

source: Now you can! Just try out the current version, 2.0.0.
fr: Maintenant vous pouvez! Essayer juste la version en cours, 2.0.0.

source: I would like to contribute to GRAMPS by writing my favorite report. How do I do that?
fr: Je souhaiterais contribuer à GRAMPS en écrivant mon rapport favoris. Comment faire ?

source: The easiest way to contribute to reports, filters, tools, etc. is to copy an existing GRAMPS report, filter, or tool. If you can create what you want by modifying existing code -- great! If your idea does not fit into the logic of any existing GRAMPS tool, the <ulink url="http://gramps.sourceforge.net/phpwiki/index.php/GrampsDevelopersPage" type="http">following page</ulink> may provide some help in writing your own plugin from scratch.
fr: La façon la plus simple pour écrire de nouveaux rapports, filtres ou outils est d'en copier un qui existe déjà puis de le modifier. Si cela vous convient, tant mieux ! Si votre idée ne rentre dans la logique d'aucun outil existant, <ulink url="http://gramps.sourceforge.net/phpwiki/index.php/GrampsDevelopersPage" type="http">ce lien</ulink> peut fournir de l'aide en écrivant votre propre plugin à partir de zéro.

source: If you need more help or would like to discuss your idea with us, please do not hesitate to contact us at <ulink url="mailto:gramps-devel@lists.sf.net" type="mailto">gramps-devel@lists.sf.net</ulink>
fr: Si vous avez besoin de plus d'aide ou vous voudriez discuter de votre idée avec nous, n'hésitez à nous contacter <ulink url="mailto:gramps-devel@lists.sf.net" type="mailto">gramps-devel@lists.sf.net</ulink>

source: To test your work in progress, you may save your plugin under <replaceable>$HOME/.gramps/plugins</replaceable> directory and it should be found and imported on startup. The correctly written plugin will register itself with GRAMPS, create menu item, and so on.
fr: Pour tester votre réalisation, vous pouvez sauver le plugin dans le répertoire <replaceable>$HOME/.gramps/plugins</replaceable> où il devrait être trouvé par GRAMPS et chargé lors du lancement. Un plugin bien écrit s'enregistre lui-même dans GRAMPS et crée son entrée dans un menu.

source: If you are happy with your plugin and would like to contribute your code back to the GRAMPS project, you are very welcome to do so by contacting us at <ulink url="mailto:gramps-devel@lists.sf.net" type="mailto">gramps-devel@lists.sf.net</ulink>
fr: Si votre plugin vous satisfait et que vous voulez contribuer au projet GRAMPS, vous êtes le bienvenu : contactez-nous à <ulink url="mailto:gramps-devel@lists.sf.net" type="mailto">gramps-devel@lists.sf.net</ulink>

source: I found a bug and I want it fixed right now! What do I do?
fr: J'ai trouvé une erreur et je veux qu'elle soit corrigée tout de suite! Que puis-je faire ?

source: The best thing you can do is to fix the bug and send the patch to <ulink url="mailto:gramps-devel@lists.sf.net" type="mailto">gramps-devel@lists.sf.net</ulink> :-)
fr: La meilleure chose à faire est de corriger l'erreur, puis d'envoyer la correction à <ulink url="mailto:gramps-devel@lists.sf.net" type="mailto">gramps-devel@lists.sf.net</ulink> :-)

source: A good bug report would include:
fr: Un bon rapport d'anomalie devrait comprendre :

source: Version of gramps you were using when you encountered the bug (available through <menuchoice><guisubmenu>Help</guisubmenu><guimenuitem>About</guimenuitem></menuchoice> menu item).
fr: La version de GRAMPS que vous utilisez <menuchoice><guisubmenu>Aide</guisubmenu><guimenuitem>A propos</guimenuitem></menuchoice> menu item).

source: Language under which gramps was run (available by executing
fr: La langue d'utilisation de GRAMPS (faites

source: in your terminal).
fr: dans votre terminal).

source: Symptoms indicating that this is indeed a bug.
fr: Les symptomes indiquant que c'est effectivement une erreur.

source: Any Traceback messages, error messages, warnings, etc, that showed up in your terminal or a in separate traceback window.
fr: Tous les messages de trace, d'erreur ou avertissement qui ont été affichés dans le terminal ou dans une fenêtre de trace séparée.

source: Most problems can be fixed quickly provided there is enough information. To ensure this, please follow up on your bug reports. In particular, if you file a bug report with sf.net bug tracker, PLEASE log in to sf.net before filing (register your free account if you don't have one). Then we will have a way of contacting you should we need more information. If you choose to file your report anonymously, at least check every so often whether your report page has something new posted, as it probably would.
fr: La plupart des erreurs peuvent être corrigées rapidement quand suffisamment d'information est fournie. Pour garantir la qualité de l'information, nous vous invitons à suivre vos rapports d'anomalie. En particulier, si vous enregistrez un rapport sur le système de suivi sf.net bug, PAR PITIE enregistrez-vous sur sf.net avant de soumettre votre rapport (enregistrez-vous sur un compte libre si vous n'en avez pas encore). Nous aurons ainsi un moyen de vous joindre si nous avons besoin de plus d'information. Si vous préférez enregistrer un rapport de façon anonyme, au moins surveillez souvent si votre page de rapport a quelque chose de nouveau, comme ce sera probablement le cas.

source: If the above explanations seem vague, please follow <ulink url="http://www.chiark.greenend.org.uk/~sgtatham/bugs.html" type="http">this link.</ulink>
fr: Si tout cela ne vous parait pas clair, suivez <ulink url="http://www.chiark.greenend.org.uk/~sgtatham/bugs.html" type="http">ce lien.</ulink>

source: It is obvious that GRAMPS absolutely needs to become a (client-server/web-based/PHP/weblog/Javascript/C++/distributed/KDE/Motif/Tcl/Win32/C#/You-name-it) application. When is this going to happen?
fr: Il est évident que GRAMPS doit absolument devenir une application (clientserveur/ web/PHP/weblog/Javascript/C++/ distribuée/KDE/Motif/Tcl/Win32/C#/Jene- sais-pas-encore-quoi). Quand cela va-t'il se faire ?
