Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: To save any error messages of the above example into files <filename>outfile</filename> and <filename>errfile</filename>, run:
fr: Pour sauver les erreurs de l'exemple précédent dans les fichiers <filename>outfile</filename> et <filename>errfile</filename>, lancez :

source: To import three databases and start interactive GRAMPS session with the result:
fr: Pour lire trois ensembles de données puis lancer une session interactive de gramps sur le tout:

source: To open a database and, based on that data, generate timeline report in PDF format putting the output into the <filename>my_timeline.pdf</filename> file:
fr: Pour ouvrir une base de données, produisant un rapport temporel dans le format pdf et l'enregistrant sous le fichier <filename>my_timeline.pdf</filename> :

source: Use the <replaceable>name=timeline,show=all</replaceable> to find out about all available options for the timeline report. To find out details of a particular option, use <replaceable>show=option_name</replaceable>, e.g. <replaceable>name=timeline,show=off</replaceable> string.
fr: Employez <replaceable>name=timeline,show=all</replaceable> pour découvrir toutes les options disponibles au sujet du rapport de timeline. Pour découvrir des détails d'une option particulière, employez <replaceable>show=option_name</replaceable>, par exemple :<replaceable>name=timeline,show=off</replaceable>

source: To learn about available report names, use <replaceable>name=show</replaceable> string.
fr: Pour se renseigner sur les noms disponibles de rapport, employez <replaceable>name=show</replaceable>.

source: Finally, to start normal interactive session type:
fr: Enfin, pour lancer une session interactive normale, entrer:

source: Known Bugs and Limitations
fr: Bugs et limitations connus

source: The known limitations include the BSDDB performance issues related to caching and the memory size. As long as the BSDDB cache fits completely into the available memory on the system, the performance should be adequate. When the cache size exceeds that of the free memory and portions of database cache start to be swapped onto the disk, the performance degrades appreciably. This can be solved by adjusting the BSDDB cache size for the large databases.
fr: Les limitations connues incluent les issues d'exécution de BSDDB, liées à la capacité de la mémoire. Aussi longtemps que le cache de BSDDB s'adapte complètement dans la mémoire disponible du système, l'exécution devrait être proportionnée. Quand la taille du cache excède celle de la mémoire libre, des parties du cache de la base de données commencent à être permutées sur le disque, l'exécution se dégrade sensiblement. Ceci peut être résolu en ajustant la taille du cache de BSDDB aux grandes bases de données.

source: About GRAMPS
fr: Au sujet de GRAMPS

source: GRAMPS was written by Donald N. Allingham (<email>don@gramps-project.org</email>).
fr: GRAMPS a été écrit par Donald N. Allingham (<email>don@gramps-project.org</email>).

source: The somewhat incomplete list of contributors includes (in alphabetical order): <placeholder-1/> If you know of somebody else who should be listed here, please let us know.
fr: La liste quelque peu inachevée de contribuants inclut (dans l'ordre alphabétique) <placeholder-1/> Si quelqu'un d'autre devrait être énuméré ici, svp faites-nous le savoir.

source: To find more information about GRAMPS, please visit the <ulink url="http://gramps.sourceforge.net" type="http">GRAMPS Project Web page</ulink>.
fr: Pour trouver plus d'informations sur GRAMPS, visitez <ulink url="http://gramps.sourceforge.net" type="http">la page web du projet GRAMPS </ulink>.

source: To report a bug or make a suggestion regarding this application or this manual, use the help menu in GRAMPS, or follow the directions on <ulink url="http://gramps.sourceforce.net/contact.html" type="http">this site.</ulink>
fr: Pour rapporter un bug ou faire une suggestion concernant cette application ou ce manuel, employez le menu d'aide dans GRAMPS, ou suivez les directions sur <ulink url="http://gramps.sourceforce.net/contact.html" type="http">cet emplacement.</ulink>

source: This program is distributed under the terms of the GNU General Public license as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. A copy of this license can be found at this <ulink url="ghelp:gpl" type="help">link</ulink>, or in the file COPYING included with the source code of this program.
fr: Ce programme est distribué en vertu de la licence de Grand Public de GNU, comme publiée par la Free Software Foundation; version 2 de la licence, ou (à votre option) toute version postérieure. Une copie de cette licence peut être trouvée à ce <ulink url="ghelp:gpl" type="help">lien</ulink>,ou dans le fichier COPIER inclus avec le code source de ce programme.

source: translator-credits
fr: Jérôme Rapinat <romjerome@yahoo.fr>, 2006.
