Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: To edit media data, switch to the Media View and select the desired entry in the list of sources. Double-click on that entry or click <guibutton>Edit</guibutton> on the toolbar to invoke the following <guilabel>Media Properties Editor</guilabel> dialog:
fr: Pour changer les propriétés d'un objet multimedia, allez dans la vue Médias et sélectionnez celui que vous voulez. Double-cliquez ou cliquer sur le bouton <guibutton>Editer</guibutton> dans la barre d'outils pour afficher la fenêtre de dialogue <guilabel>Editeur de propriétés de média</guilabel>

source: Media Properties Editor dialog
fr: Editeur de propriétés de média

source: Shows Media Properties Editor dialog.
fr: La fenêtre d'édition de propriétés des médias

source: A thumbnail preview of the object is presented, along with a summary of its properties (ID, path, and object type). The central part of the window displays five notebook tabs containing different categories of information. Click a tab to view or edit its contents. The bottom part of the window has <guibutton>OK</guibutton> and <guibutton>Cancel</guibutton> buttons. Clicking <guibutton>OK</guibutton> will apply all the changes made in all tabs and close the dialog window. Clicking the <guibutton>Cancel</guibutton> button will close the window without applying any changes.
fr: Sous le titre de la fenêtre, vous trouvez une vignette de l'objet et un résumé de ses proriétés (ID, chemin et type d'objet). La partie centrale de la fenêtre contient des onglets pour diverses catégories d'informations. La partie du bas contient les boutons <guibutton>Valider</guibutton> et <guibutton>Annuler</guibutton>. Le bouton <guibutton>Valider</guibutton> a pour effet d'appliquer toutes les modifications dans la base de données et de fermer la fenêtre. Le bouton <guibutton>Annuler</guibutton> ferme la fenêtre sans modifier la base de données.

source: The tabs represent the following categories of media data:
fr: Les onglets donnent accès aux types d'informations suivants :

source: The <guilabel>General</guilabel> tab lets you view and edit the object's Title and Date. You can type this information directly into the corresponding fields. For the Date, you can also enter information by clicking the LED button and invoking the <guilabel>Date selection</guilabel> dialog.
fr: L'onglet <guilabel>Général</guilabel> permet la modification du titre qui identifie l'objet dans la base de données. Il est saisi dans une zone de saisie de texte libre. Le champ <guilabel>Date</guilabel> permet d'entrer une date LED à l'aide du <guilabel>Sélecteur de date</guilabel>, pour une saisie plus graphique.

source: Every media object is referred to by its Path. The user is responsible for keeping track of the object files. GRAMPS will only reference and display the contents, not manage the files themselves.
fr: Si l'objet n'est pas local (c'est à dire si le fichier de données n'est pas dans le répertoire de la base de données GRAMPS) le bouton Faire une copie locale est accessible. Utilisez-le pour copier le fichier dans le répertoire de la base de données GRAMPS. Ceci augmente l'espace disque mais autorise également le déplacement ou la suppression du fichier externe sans risque pour la cohérence des données.

source: The <guilabel>Attributes</guilabel> tab lets you view and edit particular information about the media object that can be expressed as Attributes. The bottom part displays the list of all such attributes stored in the database. The top part shows the details of the currently selected attribute in the list (if any). The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> let you add, modify, or remove an attribute. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when an attribute is selected from the list.
fr: L'onglet <guilabel>Atributs</guilabel> présente les informations sur les attributs des objets multimédias. La partie du bas affiche la liste de tous les attributs de l'objet considéré. La partie du haut montre le détail de l'attribut sélectionné s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton>, et <guibutton>-</guibutton> permettent respectivement l'ajout, la modification et la suppression d'un attribut. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles que lors de la sélection d'un attribut dans la liste.

source: The <guilabel>Note</guilabel> tab provides a place to record various information about the source that does not fit neatly into other categories. This area is particularly useful for recording information that does not naturally fit into the "Parameter/Value" pairs available to Attributes. To add a note or modify existing notes simply edit the text in the text entry field.
fr: L'onglet <guilabel>Notes</guilabel> affiche les notes sur l'objet multimedia modification. Les notes sont un simple texte libre associé à la relation. Pour modifier les notes, changez simplement le texte dans la zone de saisie de l'onglet.

source: The <guilabel>References</guilabel> tab indicates any database records that refer to a given media object. The list can be ordered according to any of its column headings: <guilabel>Type</guilabel>, <guilabel>ID</guilabel>, or <guilabel>Name</guilabel>. Double-clicking an entry allows you to view and edit the corresponding record.
fr: L'onglet <guilabel>Références</guilabel> liste les objets de la base de données qui font référence à l'objet multimédia. Si cet objet n'est jamais référencé, la liste est vide. Si au contraire il est référencé de nombreuses fois, la liste montrera tous les éléments de la base de données concernés. Elle peut être triée par n'importe quelle colonne, en cliquant sur son en-tête : <guilabel>Type</guilabel>, <guilabel>ID</guilabel>, ou <guilabel>Nom</guilabel>. Double-cliquer sur un objet de la liste permet d'ouvrir l'éditeur de média

source: Only primary objects can be shown in the <guilabel>References</guilabel> tab: Person, Family, Event, Source, or Place. The secondary objects such as Names and Attributes, although able to refer the media object, will only show up through their primary objects to which they belong.
fr: Seul les objets primaires peuvent être montrés dans l'onglet <guilabel>Références</guilabel>: l'individu, la famille, l'événement, les lieux, ou les objets média. Les objets secondaires tels que des noms et des attributs, bien que pouvant se référer à la source, apparaîtront seulement par leurs objets primaires.

source: Editing Information About Events
fr: Les événements

source: Events are edited through the <guilabel>Event Editor</guilabel> dialog. This dialog can be accessed from either the <guilabel>Edit Person</guilabel> dialog or the <guilabel>Marriage/Relationship</guilabel> dialog.
fr: Les évènements sont modifiés dans la fenêtre d'édition d'un <guilabel>évènement</guilabel>. Cette fenêtre est également disponible depuis le dialogue d'<guilabel>édition de l'individu</guilabel> ou le dialogue <guilabel>Mariage/Relation</guilabel>.

source: Event Editor dialog
fr: Editeur d'événements

source: Shows Event Editor dialog.
fr: La fenêtre d'édition d'un évènement

source: The central part of the window displays five notebook tabs containing different categories of information. Click a tab to view or edit its contents. The bottom part of the window has <guibutton>OK</guibutton> and <guibutton>Cancel</guibutton> buttons. Clicking <guibutton>OK</guibutton> will apply all the changes made in all tabs and close the dialog window. Clicking the <guibutton>Cancel</guibutton> button will close the window without applying any changes.
fr: Le haut de la fenêtre contient le nom de la personne dont un évènement est en cours de modification. La partie principale de la fenêtre montre des onglets présentant différentes informations. La partie du bas contient les boutons <guibutton>Valider</guibutton> et <guibutton>Annuler</guibutton>. Les boutons <guibutton>Valider</guibutton> a pour effet d'appliquer toutes les modifications dans la base de données et de fermer la fenêtre. Le bouton <guibutton>Annuler</guibutton>ferme la fenêtre sans modifier la base de données.

source: The tabs provide the following information categories of the event data:
fr: Les onglets donnent accès aux types d'informations suivants :

source: The <guilabel>General</guilabel> tab lets you view and edit basic information about the event: its <guilabel>Type</guilabel>, <guilabel>Date</guilabel>, <guilabel>Place</guilabel>, <guilabel>Cause</guilabel>, and <guilabel>Description</guilabel>. You can type this information directly into the adjacent fields. The type can be selected from available types listed in the Event type drop-down menu. The rest of the information can be typed in the appropriate text entry fields. Checking the Private record box marks the event record as private and allows it to be omitted from reports.
fr: L'onglet <guilabel>Général</guilabel> permet la modification des caractéristiques les plus communes de l'évènement : type, date, lieu, cause et description. Le type est choisi dans une liste déroulante prédéfinie, accessible par le menu <guilabel>Type d'événement</guilabel>. Les autres données sont saisies dans des zones de texte libre. Cochez la case <guilabel>Enregistrement Privé</guilabel> pour marquer cet évènement comme privé. Ceci sera utilisé dans les rapports, pour ne pas montrer les évènements privés si tel est votre choix lors de l'activation de l'édition.

source: The <guilabel>Sources</guilabel> tab lets you view and edit sources relevant to an event. The central part of the window lists all such source references stored in the database. The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> let you add, modify, and remove a source reference associated with a place. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when a source reference is selected from the list.
fr: L'onglet <guilabel>Sources</guilabel> affiche les sources d'information sur l'évènement et permet leur modification. La partie centrale de la fenêtre montre la liste des sources associées à l'évènement, conservées dans la base de données. La partie du haut montre le détail de la source sélectionnée s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> vous permettent respectivement d'ajouter, modifier et supprimer une source pour l'évènement. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles qu'après avoir sélectionné une source dans la liste.

source: The <guilabel>Note</guilabel> tab provides a place to record notes or comments about the event. To add a note or modify existing notes simply edit the text in the text entry field.
fr: L'onglet <guilabel>Note</guilabel> contient les notes concernant l'évènement. Si vous voulez ajouter ou modifier des notes, il vous suffit de modifier le contenu de la zone de texte.

source: Witnesses
fr: Témoins

source: The <guilabel>Witnesses</guilabel> tab lets you view and edit witnesses to the event. The central part of the window lists all such witnesses stored in the database. The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> let you add, modify, and remove a witness reference to this event (see <xref linkend="adv-wit"/>). Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only
fr: L'onglet <guilabel>Témoins</guilabel> tprésente les données des témoins liés à cet événement et permet leur modification. La partie centrale liste les témoins enregistrés dans la base de données. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> vous permettent respectivement d'ajouter, modifier et supprimer un témoin pour l'évènement, voir <xref linkend="adv-wit"/>. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles qu'après avoir sélectionné une référence à un témoin dans la liste.

source: Editing Source References
fr: Source d'information

source: Source references connect a Source to another object and allow you to provide additional information about the source. When adding source references to events, places, etc., the following dialog appears:
fr: Quand vous ajoutez la référence d'une source à des évènements, des lieux..., le dialogue suivant est affiché :

source: Source Information dialog
fr: Source d'information

source: Shows Source Information dialog.
fr: La fenêtre d'édition de source

source: The dialog includes two main headings, <guilabel>Source selection</guilabel> and <guilabel>Source details</guilabel>. <guilabel>Source selection</guilabel> displays the <guilabel>Title</guilabel> of the Source, its <guilabel>Author</guilabel>, and <guilabel>Publication information</guilabel>. The <guilabel>Title</guilabel> can be selected from the available sources listed in the drop-down menu. If the source you are referencing is not already in the database, you can enter it by clicking <guibutton>New...</guibutton> and filling out the invoked <guilabel>Source Editor</guilabel> dialog.
fr: Le haut de la fenêtre contient son titre. La partie médiane montre données de la sources. La partie du bas contient les boutons <guibutton>Valider</guibutton> et <guibutton>Annuler</guibutton>. Le bouton <guibutton>Valider</guibutton> a pour effet d'appliquer toutes les modifications dans la base de données et de fermer la fenêtre. Le bouton <guibutton>Annuler</guibutton> ferme la fenêtre sans modifier la base de données.

source: The <guilabel>Source details</guilabel> section indicates the details associated with the particular reference to this Source: <guilabel>Confidence</guilabel>, <guilabel>Volume/Film/Page</guilabel>, <guilabel>Date</guilabel>, <guilabel>Text</guilabel>, and <guilabel>Comments</guilabel>. You can choose the Confidence level from the <guilabel>Confidence</guilabel> drop-down menu. The remaining details can be typed in the corresponding text entry fields.
fr: La source peut être choisie parmi celles définies dans la base de données à l'aide de la liste déroulante <guilabel>Titre</guilabel>. Si vous voulez déclarer une nouvelle source, utilisez le bouton <guibutton>Nouveau...</guibutton> et saisissez ses informations dans la fenêtre <guilabel>Editeur de source</guilabel> ainsi ouvert. Vous pouvez aussi préciser les détails pour cette référence particulière : confiance, volume/fichier/page, date, texte et commentaires. Le niveau de confiance se choisit par le menu déroulant <guilabel>Confiance</guilabel>. Les autres informations sont saisies dans des zones de texte libre.

source: Information in this dialog is specific to the particular reference. A single source can be referenced many times, and all such references will have in common the overall source information. This dialog lets you provide reference-specific data, such as relevant quotes, comments, confidence, page numbers, etc., to further specify and document the reference.
fr: Ces informations sont particulières. Une simple source peut être référencée plusieurs fois.

source: Names are edited through the following <guilabel>Name Editor</guilabel> dialog:
fr: Les noms sont modifiés dans la fenêtre <guilabel>éditeur de nom</guilabel>:

source: Name Editor dialog
fr: Editeur de nom

source: Shows Name Editor dialog.
fr: La fenêtre d'édition des noms

source: The top of the window shows the dialog title including the name of the person whose name is being edited. The central part of the window displays three notebook tabs containing different categories of available information. You can bring any tab to the top for viewing or editing by clicking on the appropriate tab heading. The bottom part has <guibutton>OK</guibutton> and <guibutton>Cancel</guibutton> buttons. Clicking the <guibutton>OK</guibutton> button at any time will apply all the changes made in all tabs and close the dialog window. Clicking the <guibutton>Cancel</guibutton> button at any time will close the window without applying any changes.
fr: Le haut de la fenêtre contient son titre Affichage des autres Noms et le nom de la personne dont un autre nom est en cours de modification. La partie principale de la fenêtre montre des onglets présentant différentes informations. La partie du bas contient les boutons <guibutton>Valider</guibutton> et <guibutton>Annuler</guibutton>. Les boutons <guibutton>Valider</guibutton> a pour effet d'appliquer toutes les modifications dans la base de données et de fermer la fenêtre. Le bouton <guibutton>Annuler</guibutton> ferme la fenêtre sans modifier la base de données.

source: The tab labels reflect the presence of corresponding information: if the tab contains any data, its label appears boldface; if the tab has no data then its label appears regular (not bold).
fr: Les onglets signalent la présence d'information : un onglet écrit en caractères gras marque des données tandis qu'un onglet vide sera écrit en caractères normaux (non gras)

source: The tabs provide the following information categories of the name data:
fr: Les onglets donnent accès aux types d'informations suivants :

source: The <guilabel>General</guilabel> tab allows editing of general information about the name: given name, family name, patronymic (a form of father's name used in some languages, e.g. Russian), family prefix, suffix, title, and type of the name. The information can be typed in the appropriate text entry fields. The family name and the type can be also selected from available choices listed in the appropriate drop-down menus.
fr: L'onglet <guilabel>Général</guilabel> permet la modification des données générales sur le nom : prénoms, nom de famille, préfixe et suffixe du nom de famille, titre et type du nom. Ces informations sont saisies dans des zones de texte libre. Le nom de famille et le type de nom peuvent aussi être choisis dans des menus déroulants.

source: <guilabel>Options</guilabel> allow you to adjust specific grouping, sorting, and displaying properties of this name, as well as to provide the date corresponding to the name. The <guilabel>Grouping</guilabel> field provides an alternative grouping node for a given name, overriding the default grouping based on the family name. This may be necessary with similar family names that need to be grouped together -- for example Russian names Ivanov and Ivanova are considered the same, but difference in gender is reflected in different spelling. To enable typing into this field, check the <guilabel>Override</guilabel> check button. The <guilabel>Sort as</guilabel> and <guilabel>Display as</guilabel> determine the manner in which the name appears in the People View and in the reports. The <guilabel>Date</guilabel> can provide information on the validity of this name -- use spans as necessary. Check the <guilabel>Private record</guilabel> box to mark this name record as private. This will give you a chance to omit this name from being included in reports, if you choose so among the report generation options.
fr: Les <guilabel>Options</guilabel> permettent de grouper, trier et afficher les noms différement. Le champ <guilabel>Grouper comme</guilabel> permet d'associer le nom à un groupe, différent du patronyme. Par exemple, en les noms Russe Ivanov et Ivanova sont considérés comme les mêmes, mais il existe une différence d'orthographe. Pour écrire dans ce champ, cocher la case <guilabel>Ecraser</guilabel>. Les champs <guilabel>Trier comme</guilabel> et <guilabel>Afficher comme</guilabel> détermine comment le nom apparaîtra dans la vue des individus et dans les rapports. Le champ <guilabel>Date</guilabel> permet de saisir une référence temporelle. Le champ <guilabel>Enregistrement Privé</guilabel> marque ce nom comme privé. Ceci évitera qu'il apparaisse dans les rapports.

source: The <guilabel>Sources</guilabel> tab displays information about sources relevant to this name and controls allowing its modification. The central part displays the list of all such sources' references stored in the database. The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> allow you to correspondingly add, modify, and remove a source reference to this name. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when a source reference is selected from the list.
fr: L'onglet <guilabel>Sources</guilabel> affiche les sources d'information sur ce nom et permet leur modification. La partie centrale de la fenêtre montre la liste des sources associées au nom conservées dans la base de données. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> vous permettent respectivement d'ajouter, modifier et supprimer une source pour le nom. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles qu'après avoir sélectionné une source dans la liste.

source: The <guilabel>Note</guilabel> tab displays any notes concerning the name. To add a note or modify existing notes simply edit the text in the text entry field.
fr: L'onglet <guilabel>Note</guilabel> affiche les notes sur le nom et permet leur modification. Les notes sont un simple texte libre associé au nom. Pour modifier les notes, simplement modifiez le texte dans la zone de saisie de l'onglet.

source: The <guilabel>Format</guilabel> option allows you to set the appearance of the note in the output (i.e. in reports and web pages). Selecting <guilabel>Flowed</guilabel> will replace all multiple spaces, tabs, and single end-of-line characters with single space in the output. The two consecutive new lines (i.e. an empty line) denote a new paragraph. Selecting <guilabel>Preformatted</guilabel> will honor all multiple spaces tabs, and new lines, so that the output will appear as it is entered into the text entry field.
fr: L'option <guilabel>Format</guilabel> vous permet de choisir le rendu de la note dans la sortie (édition ou bien page Web). Choisir <guilabel>Libre</guilabel> remplacera les espaces multiples, les tabulations et les changements de lignes simples par un espace. Les lignes vides (deux changements de lignes consécutifs) sont comprises comme une fin de paragraphe. Au contraire, choisir <guilabel>Préformaté</guilabel> conservera à l'identique les espaces multiples, les tabulations et les changements de ligne comme ils ont été saisis dans la zone de texte.

source: Attributes are edited through the following <guilabel>Attribute Editor</guilabel> dialog:
fr: Les attributs sont modifiés avec la fenêtre d' <guilabel>édition des attributs</guilabel>:

source: Attribute Editor dialog
fr: Editeur d'attributs

source: Shows Attribute Editor dialog.
fr: La fenêtre d'édition d'attribut
