Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: This mandatory option determines which report will be generated. If the supplied report_name does not correspond to any available report, the error message will be printed followed by the list of available reports.
fr: Cette option obligatoire détermine quel rapport sera produit. Si le report_name ne correspond à aucun rapport disponible, le message d'erreur sera affiché à la suite de la liste de rapports disponibles.

source: This will produce the list of names for all options available for a given report.
fr: Ceci affichera la liste de noms pour toutes les options disponibles pour un rapport présenté.

source: This will print the description of the functionality supplied by the option_name, as well as what are the acceptable types and values for this option.
fr: Ceci affichera la description de la fonctionnalité assurée par l'option_name, pour les types et les valeurs acceptables pour cette option.

source: Use the above options to find out everything about a given report.
fr: Employez les options ci-dessus pour découvrir tout au sujet d'un rapport présenté.

source: If an option is not supplied, the last used value will be used. If this report has never been generated before, then the value from last generated report will be used when applicable. Otherwise, the default value will be used.
fr: Si une option n'est pas assurée, la dernière valeur utilisée sera employée. Si ce rapport n'a jamais été produit avant, alors la valeur du dernier rapport produit sera employée comme applicable. Autrement, la valeur par défaut sera employée.

source: When more than one output action is given, each has to be preceded by <command>-a</command> flag. The actions are performed one by one, in the specified order.
fr: Quand plus d'une action à produire est donnée, chacunes doivent être par précédé<command>-a</command> . Les actions sont effectuées dans l'ordre indiqué.

source: Detailed plugin option reference
fr: Références Détaillées des options de plugins

source: Common Options
fr: Options communes

source: <command>style</command>: =name
fr: <command>style</command>: =nom

source: Style name.
fr: Nom du style

source: default
fr: defaut

source: Page break between generations.
fr: Page entre les générations

source: Output file format.
fr: Format de sortie

source: print
fr: imprimer

source: <command>of</command>: =filename
fr: <command>of</command>: =nom_du_fichier

source: Output file name. MANDATORY
fr: Nom de sortie. OBLIGATOIRE

source: Value: <userinput>/home/shura/whatever_name</userinput>
fr: Valeur: <userinput>/home/shura/un_nom</userinput>

source: Paper orientation number.
fr: Orientation de la page

source: 1 Landscape
fr: 1 Paysage

source: Number of generations to follow.
fr: Nombre de génération suivante

source: Filter number.
fr: Numéro de filtre

source: <command>template</command>: =name
fr: <command>template</command>: =nom

source: Template name (HTML only).
fr: Nom du modèle (seulement HTML).

source: <command>papers</command>: =name
fr: <command>papers</command>: =nom

source: Paper size name.
fr: Format du papier

source: Letter
fr: Lettre

source: Display format for the outputbox.
fr: Affichage du format pour la boite de sortie

source: Gramps ID of a central person. MANDATORY
fr: ID Gramps de la personne de référence. OBLIGATOIRE

source: Whether to scale to fit on a single page.
fr: Si vous voulez adapter pour une simple page

source: Do not scale to fit
fr: Ne pas adapter à la page

source: Scale to fit
fr: Adapter à la page

source: Whether to compress chart.
fr: Si vous voulez comprimer l'arbre

source: Do not compress chart
fr: Ne pas comprimer l'arbre

source: Compress chart
fr: Comprimer l'arbre

source: Title string for the report
fr: La chaîne Titre du rapport

source: Value: <userinput>Whatever String You Wish</userinput>
fr: Valeur: <userinput>Toute les chaînes que vous voulez</userinput>

source: Whether to cite sources.
fr: Si vous voulez citer les sources

source: Do not cite sources
fr: Ne pas citer les sources

source: Cite sources
fr: Citer les sources

source: Whether to replace missing Dates with blanks.
fr: Si vous voulez remplacer des dates manquantes par un blanc

source: Do not replace missing Dates
fr: Ne pas remplacer les dates

source: Replace missing Dates
fr: Remplacer les dates

source: Whether to include source references.
fr: Si vous voulez ajouter les sources

source: Do not include sources
fr: Ne pas inclure les sources

source: Include sources
fr: Inclure les sources

source: Whether to include images.
fr: Si vous voulez inclure les photos

source: Do not include images
fr: Ne pas inclure les images

source: Include images
fr: Inclure les images

source: Whether to add descendant references in child list.
fr: Si vous voulez ajouter les descendants dans la liste des enfants

source: Do not add references
fr: Ne pas les ajouter

source: Add references
fr: Les ajouter

source: Whether to compute age.
fr: Si vous voulez calculer l'âge

source: Do not compute age
fr: Ne pas calculer l'âge

source: Compute age
fr: Calculer l'âge

source: Whether to use full dates instead of just year.
fr: Si vous voulez inclure les dates complètes plutôt que simplement l'année

source: Do not use full dates
fr: Ne pas utiliser les dates complètes

source: Use full dates
fr: Utiliser les dates complètes

source: Whether to include other names.
fr: Si vous voulez inclure d'autres noms

source: Do not include other names
fr: Ne pas inclure d'autres noms

source: Include other names
fr: Inclure d'autres noms

source: Whether to list children.
fr: Si vous voulez lister les enfants

source: Do not list children
fr: Ne pas les lister

source: List children
fr: Lister les enfants

source: Whether to include events.
fr: Si vous voulez inclure des événements

source: Do not include events
fr: Ne pas inclure d'événements

source: Include events
fr: Inclure des événements

source: Whether to use the nick name as the first name.
fr: Si vous voulez utiliser les surnoms comme nom

source: Do not use nick name
fr: Ne pas utiliser les surnoms

source: Use nick name
fr: Utiliser les surnoms

source: Whether to include notes.
fr: Si vous voulez inclure des notes

source: Do not include notes
fr: Ne pas inclure des notes

source: Include notes
fr: Inclure des notes

source: Whether to omit duplicate ancestors.
fr: Si vous ne voulez pas oublier les ancêtres

source: Do not omit duplicates
fr: Ne pas omettre les ancêtres

source: Omit duplicates
fr: Les oublier

source: Whether to replace missing Places with blanks.
fr: Si vous voulez remplacer les lieux manquants par un blanc

source: Do not replace missing Places
fr: Ne pas remplacer les lieux manquants

source: Replace missing Places
fr: Remplacer les lieux manquants

source: Gramps ID of the person's spouse.
fr: L'ID Gramps du conjoint de l'individu

source: Value: <userinput>Use show=id to get ID list.</userinput>
fr: Valeur: <userinput>Utiliser show=id pour obtenir la liste ID.</userinput>

source: FTM Style Ancestor Report
fr: Liste des ascendants (Family Tree Maker)

source: Graph direction.
fr: Orientation du graphique

source: Whether to use years only.
fr: Si vous utilisez que les années

source: Do not use years only
fr: Ne pas utiliser que les années

source: Use years only
fr: N'utiliser que les années

source: Needs to be set if font doesn't support unicode.
fr: Etre en accord avec l'unicode

source: Supports unicode
fr: Supporter unicode

source: Supports only Latin1
fr: Supporter seulement Latin1

source: Arrow styles for heads and tails.
fr: Style des flèches

source: d Descendants &lt;- Ancestors
fr: d Descendants &lt;- Ancêtres

source: a Descendants -&gt; Ancestors
fr: a Descendants -&gt; Ancêtres

source: da Descendants &lt;-&gt; Ancestors
fr: da Descendants &lt;-&gt; Ancêtres

source: Descendants - Ancestors
fr: Descendants - Ancêtres

source: Whether to use dotted lines for non-birth relationships.
fr: Si vous utilisez des pointillés pour une relation non-naturelle

source: Do not use dotted lines
fr: Ne pas utiliser de lignes pointillés

source: Use dotted lines
fr: Utiliser les lignes pointillés

source: Whether to include URLs.
fr: Si vous voulez inclure des liens internet

source: Do not include URLs
fr: Ne pas inclure les URLs

source: Include URLs
fr: Inclure les URLs

source: Number of pages in horizontal direction.
fr: Nombre de page à l'horizontal

source: Value: <userinput>Integer values</userinput>
fr: Valeur: <userinput>Valeurs intégrées</userinput>

source: Whether to replace missing dates with place/cause.
fr: Si vous voulez remplacer les dates par un lieu/cause??

source: Do not replace blank dates
fr: Ne pas remplacer les dates manquantes

source: Replace blank dates
fr: Remplacer les dates manquantes

source: Output format to convert dot file into.
fr: Format de sortie pour convertir un .dot en

source: Whether and how to colorize graph.
fr: Si vous voulez coloriser un graphique et comment

source: outline B&amp;W Outline
fr: contour B&amp;W Contour

source: colored Colored outline
fr: colorisé Contour colorisé

source: filled Color fill
fr: remplir Couleur intérieur

source: Whether to include IDs.
fr: Si vous voulez inclure les IDs

source: Do not include IDs
fr: Ne pas inclure les IDs

source: Include IDs
fr: Inclure les IDs

source: Whether to include dates.
fr: Si vous voulez inclure des dates

source: Do not include dates
fr: Ne pas inclure les dates

source: Include dates
fr: Inclure les dates

source: Number of pages in vertical direction.
fr: Nombre de page à la vertical

source: Font to use in the report.
fr: Police pour le rapport

source: Default
fr: Defaut

source: Margin size.
fr: Taille de la marge

source: Value: <userinput>Floating point value, in cm</userinput>
fr: Valeur: <userinput>Virgule flottante, en cm</userinput>

source: Whether to show family nodes.
fr: Si vous voulez afficher les noeuds familiaux

source: Do not show family nodes
fr: Ne pas montrer les noeuds familiaux

source: Show family nodes
fr: Montrer les noeuds familiaux

source: Generate Web Site (deprecated)
fr: Génération de site internet (plus supporté)

source: URL for links from GRAMPS IDs
fr: Lien URL depuis GRAMPS IDs

source: Value: <userinput>the_url_value</userinput>
fr: Valeur: <userinput>la_valeur_de_l_URL</userinput>

source: Extension for generated files
fr: Les extensions pour le format de sortie

source: Value: <userinput>Any extension you like: html, htm, php, asp, etc.</userinput>
fr: Valeur: <userinput>Les extensions que vous préférez: html, htm, php, asp, etc.</userinput>

source: Image subdirectory
fr: Sous répertoire image

source: Value: <userinput>image_subdir_name</userinput>
fr: Valeur: <userinput>image_rep_nom</userinput>

source: Split alphabetical sections to different pages
fr: Couper la section alphabétique en plusieurs parties

source: Do not split sections
fr: Ne pas la couper

source: Split sections
fr: Couper la section

source: Inclusion of people marked private
fr: Inclure les personnes privées

source: Do not include
fr: Ne pas les inclure

source: Include
fr: Les inclure

source: Include GRAMPS ID in the report
fr: Inclure le GRAMPS ID dans le rapport

source: Number of columns in the index page
fr: Nombre de colonnes dans l'index

source: Value: <userinput>Any integer number</userinput>
fr: Value: <userinput>N'importe quels nombres intégrés</userinput>

source: Inclusion of comments and text in source information
fr: Inclure des commentaires et du texte dans les sources

source: Include links to alphabetical sections in index page
fr: Inclure des liens vers l'index alphabétique

source: Create a GENDEX index
fr: Créer un index GENDEX

source: Do not create
fr: Ne pas créer

source: Create
fr: Créer

source: Depth of ancestor tree
fr: Profondeur de l'arbre des ancêtres

source: Template name for the index page
fr: Modèle de nom pour l'index

source: Value: <userinput>/full/path/to/the/tpkg</userinput>
fr: Valeur: <userinput>/full/path/to/the/tpkg</userinput>

source: Include links to the index page
fr: Inclure des liens dans l'index

source: Restrict information on living people
fr: Limitation sur les personnes vivantes

source: Do not restrict
fr: Ne pas limiter

source: Restrict
fr: Limiter

source: Use only birth year on the index page
fr: Seulement l'année de naissance sur l'index

source: Use full date
fr: Date complète

source: Use just year
fr: Juste l'année

source: Append birth dates to the names on the index page
fr: Accès aux dates de naissance sur l'index

source: Do not append
fr: Pas d'accès

source: Append
fr: Accès

source: Include short ancestor tree
fr: Inclure un petit arbre des ascendants

source: Inclusion of images
fr: Inclure des images

source: No images at all
fr: Aucune image pour tout le monde

source: No images for living people
fr: Pas d'images pour les personnes vivantes

source: Images for all people
fr: Images pour tout le monde

source: Output directory for the web site
fr: Répertoire pour le site Web

source: Value: <userinput>/full/name/of/the/dir</userinput>
fr: Valeur: <userinput>/Complet/nom/du/repertoire</userinput>

source: Create an index of all Places
fr: Créer un index pour tout les lieux

source: Book Report
fr: Livre

source: Name of the book. MANDATORY
fr: Nom du livre. OBLIGATOIRE

source: Descendant Wall Chart
fr: Arbre des descendants (Grand Format)

source: Tools
fr: Outils

source: Gramps ID of a central person.
fr: L'ID gramps de la personne de référence

source: Type of events to replace
fr: Type d'événement à remplacer

source: Value: <userinput>Event type string</userinput>
fr: Valeur: <userinput>Chaîne du type d'événement</userinput>

source: New type replacing the old one
fr: Nouveau type remplaçant l'ancien

source: Maximum number of consecutive years of widowhood
fr: Maximun d'années de veuvage consécutives

source: Value: <userinput>Number of years</userinput>
fr: Valeur: <userinput>Nombre d'années</userinput>

source: Maximum number of children for a woman
fr: Maximum d'enfants par femme

source: Value: <userinput>Number of children</userinput>
fr: Valeur: <userinput>Nombre d'enfants</userinput>

source: Maximum number of spouses for a person
fr: Maximum des conjoints pour une personne

source: Value: <userinput>Number of spouses</userinput>
fr: Valeur: <userinput>Nombre d'épouses</userinput>

source: Maximum number of children for a man
fr: Maximum d'enfants pour un homme

source: Value: <userinput>Number of chidlren</userinput>
fr: Valeur: <userinput>Nombre d'enfants</userinput>

source: Whether to estimate missing dates
fr: Si vous utilisez les dates relatives

source: Do not estimate
fr: Ne pas estimer les dates

source: Estimate dates
fr: Estimer les dates

source: Minimum age to marry
fr: Age minimum pour se marrier

source: Value: <userinput>Age in years</userinput>
fr: Valeur: <userinput>Age en années</userinput>

source: Maximum age to marry
fr: Age maximum pour se marrier

source: Maximum span of years for all children
fr: Maximum d'écart entre le premier et le dernier enfant

source: Value: <userinput>Span in years</userinput>
fr: Valeur: <userinput>Ecart en années</userinput>

source: Maximum age
fr: Age Maximum

source: Maximum age to father a child
fr: Age maximum du père pour avoir un enfant

source: Maximum husband-wife age difference
fr: Différence d'âge maximum entre conjoint

source: Value: <userinput>Age difference in years</userinput>
fr: Valeur: <userinput>Différence d'âge en années</userinput>

source: Minimum age to bear a child
fr: Age minimum pour porter un enfant

source: Minimum age to father a child
fr: Age minimum pour être père

source: Maximum age to bear a child
fr: Age maximum pour porter un enfant

source: Maximum number of years between children
fr: Maximum d'années entre les enfants

source: Generate Testcases for persons and families
fr: Génération de Testcases pour les individus et la familles

source: Whether to create test for date handling.
fr: Si vous testez l'utilisation des dates

source: Skip test
fr: Ignorer le test

source: Create date tests
fr: Création de test pour les dates

source: Number of dummy persons to generate
fr: Nombre de faux individus

source: Value: <userinput>Number of persons</userinput>
fr: Valeur: <userinput>Nombre d'individus</userinput>

source: Wheter to use one transaction or multiple small ones
fr: Si vous utilisez une transaction ou plusieurs petites

source: One transaction
fr: Une transaction

source: Multiple transactions
fr: Plusieurs transactions

source: Wheter to create short or long names
fr: Si vous utilisez les longs noms ou les courts

source: Short names
fr: Noms courts

source: Long names
fr: Noms longs

source: Whether to create invalid database references.
fr: Si vous créez des références invalides pour la base

source: Create invalid Database references
fr: Créer des références invalides

source: Whether to create a bunch of dummy persons
fr: Si vous utilisez un ensemble de faux individus

source: Dont create persons
fr: Ne pas créer d'individus

source: Create dummy persons
fr: Créer de faux individus

source: Wheter to add a serial number to every text field
fr: Si vous ajoutez un numéro à chaque champ de texte

source: No serial
fr: Pas de numéro

source: Add serial number
fr: Ajouter un numéro de série

source: Wheter to ass some special characters to every text field
fr: Si vous assignez des caractères spéciaux à chaque champ de texte

source: No special characters
fr: Pas de caractères spéciaux

source: Add special characters
fr: Ajout de caractères spéciaux

source: Checkpoint the database
fr: Contrôle de la base de données

source: Custom command line for retrieval
fr: Commande pour la récupération

source: Value: <userinput>Custom command string</userinput>
fr: Valeur: <userinput>Chaîne de commande</userinput>

source: Custom command line for archiving
fr: Commande pour l'archivage

source: Whether to archive or retrieve.
fr: Si vous utilisez une archive pour la récupération

source: Retrieve
fr: Récupérer

source: Archive
fr: Archiver

source: Whether to use RCS (ignores custom commands).
fr: Si vous utilisez RCS (ignorer les commandes de base).

source: Do not use RCS
fr: Ne pas utiliser RCS

source: Use RCS
fr: Utiliser RCS

source: Rebuild secondary indices
fr: Reconstruire les seconds indices

source: Dumps gender statistics
fr: Tableau statistique croisé du prénom et du sexe

source: Generate Commandline Plugin Reference
fr: Génération d'un plugin de référence sur les lignes de commandes

source: Whether to include into the manual
fr: Si vous voulez l'inclure à ce manuel

source: Pathname to the target file
fr: Chemin de la cible

source: Value: <userinput>Any valid pathname</userinput>
fr: Valeur: <userinput>N'importe quel chemin valide</userinput>

source: Operation
fr: Opération

source: If the first argument on the command line does not start with dash (i.e. no flag), GRAMPS will attempt to open the file with the name given by the first argument and start interactive session, ignoring the rest of the command line arguments.
fr: Si le premier argument sur la ligne de commande ne commence pas par le tiret, GRAMPS essayera d'ouvrir le dossier avec le nom donné par le premier argument et de commencer la session interactive, ignorant le reste des arguments de ligne de commande.

source: If the <command>-O</command> flag is given, then GRAMPS will try opening the supplied file name and then work with that data, as instructed by the further command line parameters.
fr: Si <command>-O</command> est donné, alors GRAMPS essayera d'ouvrir le nom de fichier fourni et fonctionnera alors avec ces données.

source: Only one file can be opened in a single invocation of GRAMPS. If you need to get data from multiple sources, use the importing options by using <command>-i</command> flag.
fr: Seulement, un fichier peut être ouvert par GRAMPS. Si vous avez besoin d'ouvrir depuis plusieurs sources, utilisez l'option d'importation <command>-i</command>.

source: With or without the <command>-O</command> flag, there could be multiple imports, exports, and actions specified further on the command line by using <command>-i</command>, <command>-o</command>, and <command>-a</command> flags.
fr: Avec ou sans option <command>-O</command> , on peut faire des imports , exports, et actions en ligne de commande avec <command>-i</command>, <command>-o</command>, et <command>-a</command>.

source: The order of <command>-i</command>, <command>-o</command>, or <command>-a</command> options with respect to each does not matter. The actual execution order always is: all imports (if any) -&gt; all exports (if any) -&gt; all actions (if any).
fr: L'ordre des options <command>-i</command>, <command>-o</command>, ou <command>-a</command> entre elles n'a pas de signification. L'ordre réel d'exécution est toujours : les lectures (s'il y en a) puis les écritures (s'il y en a) et enfin les actions (s'il y en a).

source: But opening must always be first!
fr: Mais l'ouverture doit toujours être première!

source: If no <command>-O</command> or <command>-i</command> option is given, GRAMPS will launch its main window and start the usual interactive session with the empty database, since there is no data to process, anyway.
fr: Si aucune option <command>-O</command> ou <command>-i</command> n'est donnée, gramps ouvrira sa fenêtre principale et commencera une session interactive avec un ensemble vide de données puisqu'il n'y a pas de données à traiter.

source: If no <command>-o</command> or <command>-a</command> options are given, GRAMPS will launch its main window and start the usual interactive session with the database resulted from opening and all imports (if any). This database resides in the <filename>import_db.grdb</filename> file under the <filename>~/.gramps/import/</filename> directory.
fr: Si aucune option <command>-o</command> ou <command>-a</command>n'est donnée, gramps ouvrira sa fenêtre principale et commencera une session interactive avec les données lues. <filename>import_db.grdb</filename> se situera dans le répertoire <filename>~/.gramps/import/</filename>.

source: Any errors encountered during import, export, or action, will be either dumped to stdout (if these are exceptions handled by GRAMPS) or or to stderr (if these are not handled). Use usual shell redirections of stdout and stderr to save messages and errors in files.
fr: Les erreurs trouvées pendant les phases de lecture, d'écriture et d'action sont rapportées soit sur la sortie standard quand elles sont gérées par gramps, soit sur la sortie d'erreur dans le cas contraire. Utilisez les redirections du shell pour les conserver dans des fichiers.

source: Examples
fr: Exemples

source: To import four databases (whose formats can be determined from their names) and then check the resulting database for errors, one may type:
fr: Lecture de quatre bases de données dont les formats peuvent être devinés d'après les noms, puis vérification des données :

source: To explicitly specify the formats in the above example, append filenames with appropriate <command>-f</command> options:
fr: Si vous voulez préciser les formats de fichiers dans l'exemple ci-dessus, complétez les noms de fichiers par les options <command>-f</command> appropriées :

source: To record the database resulting from all imports, supply <command>-o</command> flag (use <command>-f</command> if the filename does not allow GRAMPS to guess the format):
fr: Pour enregistrer le résultat des lectures, donnez l'option <command>-o</command>(utiliser <command>-f</command> si le nom de fichier ne permet pas à gramps de deviner le format) :
