Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: When you launch it, the <guilabel>User defined filters</guilabel> dialog appears that lists all the filters (if any) previously defined by you. Click the <guibutton>Add...</guibutton> button to define a new filter. Once you have designed your filters, you can edit, test, and delete selected filters using the <guibutton>Edit...</guibutton>, <guibutton>Test...</guibutton>, and <guibutton>Delete</guibutton> buttons, respectively. All the filters displayed in the list will be automatically saved along with your database and will be available with subsequent sessions of GRAMPS.
fr: Quand vous le lancez, la fenêtre des<guilabel>Filtres Personnalisés</guilabel> est affiché et liste tous les filtres que vous avez déjà définis (s'il y en a). Cliquez sur le bouton <guibutton>Ajouter...</guibutton> pour définir un nouveau filtre. Quand vous l'avez défini, vous pouvez modifier, tester et supprimer les filtres sélectionnés avec les boutons <guibutton>Editer...</guibutton>, <guibutton>Tester...</guibutton> et <guibutton>Supprimer</guibutton>. Tous les filtres affichés dans la liste seront automatiquement enregistrés avec votre base de données et seront disponibles pour les sessions suivantes de GRAMPS.

source: The changes made to the filters only take effect when you click the <guibutton>Apply and close</guibutton> button.
fr: Les changements faits aux filtres entrent en vigueur seulement quand vous fermez le bouton <guibutton>Fermer et Appliquer</guibutton>.

source: Clicking the <guibutton>Add...</guibutton> button invokes the following <guilabel>Define filter</guilabel> dialog:
fr: Le bouton <guibutton>Ajouter...</guibutton> lance la fenêtre suivante <guilabel>Définir un filtre</guilabel> :

source: Define filter dialog
fr: Définir un filtre

source: Shows Define filter dialog.
fr: La fenêtre de dialogue d'édition d'un filtre

source: Type the name for your new filter into the <guilabel>Name</guilabel> field. Enter any comment that would help you identify this filter in the future into the <guilabel>Comment</guilabel> field. Add as many rules to the <guilabel>Rule list</guilabel> as you would like to your filter using <guibutton>Add...</guibutton> button. If the filter has more than one rule, select one of the <guilabel>Rule operations</guilabel>. This allows you to choose whether all rules must apply, only one (either) rule must apply, or exactly one (either) rule must apply, in order for the filter to generate a match. If your filter has only one rule, this selection has no effect.
fr: Saisissez le nom de votre nouveau filtre dans le champ <guilabel>Nom</guilabel>. Mettez n'importe quel commentaire pour vous aider à identifier ce filtre plus tard dans le champ <guilabel>Commentaire</guilabel> Ajouter autant de <guilabel>Règles</guilabel> que vous voulez dans la Liste des règles en utilisant le bouton <guibutton>Ajouter...</guibutton>. Si un filtre comporte plusieurs règles, choisissez le mode d'application des <guilabel>Règles</guilabel>Ceci vous permet de choisir si toutes, au moins une ou bien une seule des règles doivent intervenir pour qu'une personne soit sélectionnée.

source: Check <guilabel>Return values that do not match the filter rules</guilabel> to invert the filter rule. For example, inverting "has a common ancestor with I1" rule will match everyone who does not have a common ancestor with that person).
fr: Cocher la case <guilabel>Afficher les valeurs qui ne répondent pas aux critères (inverser)</guilabel> pour inverser le filtrage (par exemple inverser la règle "a un ancêtre commun avec I1" sélectionnera toutes les personnes qui n'ont pas d'ancêtre commun avec cette personne).

source: Clicking the <guibutton>Add...</guibutton> button invokes the following <guilabel>Add Rule</guilabel> dialog:
fr: Le bouton <guibutton>Ajouter...</guibutton> lance la fenêtre <guilabel>Ajouter une Règle</guilabel> :

source: Add Rule dialog
fr: Ajouter une règle

source: Shows Add Rule dialog.
fr: La fenêtre de dialogue de l'ajout d'une règle

source: The pane on the left-hand side displays available filter rules arranged by their categories in an expandable tree. For detailed filter rule reference, see <xref linkend="append-filtref"/>. Click on the arrows to fold/unfold the appropriate category. Select the rule from the tree by clicking on its name. The right-hand side displays the name, the description, and the values for the currently selected rule. Once you are satisfied with your rule selection and its values, click <guibutton>OK</guibutton> to add this rule to the rule list of the currently edited filter. Clicking <guibutton>Cancel</guibutton> will abort adding the rule to the filter.
fr: La zone de gauche montre une vue en arbre des règles élémentaires. Cet arbre peut être déplié ou replié par branche en cliquant sur la flèche à l'origine de chaque branche voir <xref linkend="append-filtref"/>. Pour une documentation de référence sur les règles de filtres. Cliquez sur une règle dans l'arbre pour la sélectionner. La partie droite du dialogue présente le nom, la description et les paramètres de la règle sélectionnée. Quand vous avez trouvé la bonne règle et choisi ses paramètres, cliquez sur le bouton <guibutton>Valider</guibutton> pour l'ajouter à la liste des règles du filtre en cours de modification. Cliquez sur le bouton <guibutton>Annuler</guibutton> pour abandonner l'ajout de règle au filtre.

source: A filter you have already designed may be used as a rule for another filter. This gives you nearly infinite flexibility in custom-tailoring your selection criteria that can be later used in most of the exports, reports, and some of the tools (such as comparing individual events).
fr: Un filtre que vous avez déjà conçu peut être utilisé en règle générale pour un autre filtre. Ceci vous donne la flexibilité presque infinie, vos critères de sélection peuvent être employés dans la plupart des exportations, des rapports, et certains outils (tels que comparer différents événements).

source: Scratch Pad
fr: Le Presse-papiers

source: This tool provides a temporary note pad to store database records for easy reuse. In short, this is a sort of the copy-and-paste functionality extended from textual objects to other types of records used in GRAMPS.
fr: Cet outil permet de stocker provisoirement des notes pour une réutilisation facile. En bref, c'est un presse-papiers étendu aux objets textuels utilisés dans GRAMPS.

source: Scratch Pad makes extensive use of drag-and-drop technique.
fr: Le presse-papiers utilise la technique du glisser-déposer.

source: To invoke Scratch Pad, either choose <menuchoice><guimenu>Tools</guimenu><guisubmenu>Utilities</guisubmenu><guimenuitem>Scratch Pad</guimenuitem></menuchoice> or click the <guilabel>ScratchPad</guilabel> button on the toolbar. The following window will appear:
fr: Appeler le presse-papiers, par <menuchoice><guimenu>Outils</guimenu><guisubmenu>Utilitaires</guisubmenu><guimenuitem>Presse-Papiers </guimenuitem></menuchoice> ou cliquer sur <guilabel>Presse-Papiers </guilabel> dans la barre d'outils. La fenêtre suivante apparaîtra:

source: Scratch Pad tool
fr: Le Presse-papiers

source: Shows Add Scratch Pad tool.
fr: La fenêtre de dialogue du Presse-Papiers

source: Scratch Pad supports addresses, attributes (both personal and family), events (both personal and family), names, media objects references, source references, URLs, and of course textual information of notes and comments. To store any type of these records, simply drag the existing record on to the Scratch Pad from the corresponding editor dialog. To reuse the record, drag it from the Scratch Pad on to the corresponding place in the editor, e.g. Address tab, Attribute tab, etc.
fr: On peut stocker des adresses, des attributs (personnel et famille), des événements (personnel et famille), des noms, les médias object, des références, des références de source, des URLs, et naturellement l'information textuelle des notes et des commentaires. Pour stocker, glisser simplement le texte dans la boîte de dialogue. Pour réutiliser l'information, glisser-la à l'endroit correspondant, par exemple étiquette d'adresse, étiquette d'attribut, etc...

source: Some objects are showing the link icon on the left. This indicates that dragging such selection will produce a reference to an existing object, not copy the object itself.
fr: Quelques objets montrent l'icône de lien du côté gauche. Ceci indique que déposer un tel choix produira une référence à un objet existant, pour ne pas copier l'objet lui-même.

source: For example, the media object file will not be duplicated. Instead, the reference will be made to an existing media object, which will result in the local gallery entry.
fr: Par exemple, le fichier média ne sera pas reproduit. Au lieu de cela, la référence sera faite à un objet existant, qui aura comme conséquence l'entrée locale.

source: Scratch Pad storage is persistent within a single GRAMPS session. Closing the window will not lose the stored records. However, exiting GRAMPS will.
fr: Le stockage est persistant dans une session simple de GRAMPS. La fermeture de la fenêtre ne perdra pas les informations stockées. Seulement, sortir de GRAMPS .

source: Other tools
fr: Autres outils

source: Generate SoundEx codes
fr: Générateur de SoundEx

source: This utility generates SoundEx codes for the names of people in the database. Please visit the <ulink url="http://www.archives.gov/research_room/genealogy/census/soundex.html" type="http">NARA Soundex Indexing page</ulink> to learn more about Soundex Indexing System.
fr: Cet utilitaire génère les codes SoundEx pour les personnes de la base de données. Allez sur <ulink url="http://www.archives.gov/research_room/genealogy/census/soundex.html" type="http">la page d'indexation de Soundex NARA</ulink> pour apprendre plus au sujet du système d'indexation de Soudex.

source: Relationship calculator
fr: Calcul relationnel

source: This utility calculates and displays the relationship of any person to the active person.
fr: Cet utilitaire calcule la relation entre deux personnes de la base de données.

source: Verify the database
fr: Verifie la base de données

source: This utility allows you to verify the database based on the set of criteria specified by you.
fr: Cet utilitaire vous permet de vérifier la base de données par rapport à vos critères.

source: Difference between Verify tool and previously described Check tool
fr: Il est différent de l'outil de vérification d'intégrité décrit par ailleurs.

source: The Check tool detects inconsistencies in the database structure. The Verify tool, however, is detecting the records that do not satisfy your particular criteria.
fr: En effet, le vérificateur d'intégrité détecte les incohérences dans la structure de la base de données tandis que le vérificateur décrit ici, teste le contenu des données par rapport à vos critères.

source: For example, you may want to make sure that nobody in your database had children at the age of 98. Based on common sense, such a record would indicate an error. However, it is not a consistency error in the database. Besides, someone might have a child at the age of 98 (although this rarely happens). The Verify tool will display everything that violates your criteria so that you can check whether the record is erroneous or not. The ultimate decision is yours.
fr: Par exemple, vous voulez vous assurer qu'aucune personne dans votre base n'a des enfants à l'âge de 98 ans. Ceci serait le résultat d'une erreur de saisie de toute évidence, mais ne serait pas une erreur de structure de la base de données. A côté de cela, quelqu'un pourrait avoir un enfant à 98 ans même si c'est très improbable. L'outil de vérification affiche tout ce qui ne répond pas à vos critères pour que vous puissiez vérifier plus à fond les données.

source: Settings
fr: Configuration

source: Preferences
fr: Préférences

source: Most of the settings in GRAMPS, are configured in the <guilabel>Preferences</guilabel> dialog. To invoke it, choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences...</guimenuitem></menuchoice>.
fr: La plupart des configuration GRAMPS, sont affichables dans la boîte de dialogue <guilabel>Préférences</guilabel> Choisissez, <menuchoice><guimenu>Edition</guimenu><guimenuitem>Préférences...</guimenuitem></menuchoice>.

source: Preferences dialog
fr: Dialogue de préférences

source: The pane on the left displays the tree of available option categories. Selecting a tree node will display the corresponding options in the right side of the dialog.
fr: La fenêtre du côté gauche montre l'arbre des options disponibles. Le choix d'un noeud montrera les options correspondantes du côté droit.

source: Database
fr: Base de données

source: This category contains preferences relevant to the database itself. It has the following subcategories:
fr: Cette catégorie regroupe les préférences liées à la base de données elle-même. Vous y trouvez les sous-catégories suivantes :

source: Automatically load last database
fr: Chargement automatique de la dernière base

source: Check this box to automatically load the last open database on startup.
fr: Cochez ce choix pour charger automatiquement la dernière base ouverte, lors du lancement de GRAMPS.

source: Family name guessing
fr: Estimation du nom de famille

source: This option affects the initial family name of a child when he/she is added to the database.
fr: Cette option affecte le nom de famille initial d'un enfant quand il/elle est ajouté à la base de données.

source: This option only affects the initial family name guessed by GRAMPS when the <guilabel>Edit Person</guilabel> dialog is launched. You can modify that name the way you see fit. Set this option to the value that you will most frequently use, as it will save you a lot of typing.
fr: Cette option affecte seulement le nom de famille initial deviné par GRAMPS quand le <guilabel>dialogue d'édition</guilabel> de la personne est lancé. Placez cette option à la valeur que vous emploierez le plus fréquemment, car elle vous évitera beaucoup de dactylographie.

source: If <guilabel>None</guilabel> is selected, no guessing will be attempted. Selecting <guilabel>Father's surname</guilabel> will use the family name of the father. Selecting <guilabel>Combination of mother's and father's surname</guilabel> will use the father's name followed by the mother's name. Finally, <guilabel>Icelandic style</guilabel> will use the father's given name followed by the "sson" suffix (e.g. the son of Edwin will be guessed as Edwinsson).
fr: Si <guilabel>Aucun</guilabel> est choisi, aucune estimation sera essayé. Choix <guilabel>du nom de famille du père</guilabel> emploiera le nom. de famille du père. Choix <guilabel>de la combinaison du nom de famille de la mère et du père</guilabel> emploiera le nom du père suivi du nom de la mère. En conclusion, <guilabel>le modèle islandais</guilabel> emploiera le nom donné du père suivi du suffixe de "sson" (par exemple le fils d'Edwin sera deviné comme Edwinsson).

source: GRAMPS IDs
fr: Identifications de GRAMPS

source: Enter ID prefixes for various kinds of database entries into the corresponding text entry fields.
fr: Écrivez les préfixes d'identification pour différents genres d'entrées de base de données dans les champs correspondants d'enregistrement de texte.

source: The ID prefixes use formatting conventions common for C, Python, and other programming languages. For example, the %04d expands to an integer, prepended with zeros to have the total width of four digits. If you would like IDs to be 1, 2, 3, etc, simply set the formatting parameter to %d.
fr: Les préfixes d'identification emploient des conventions de formatage communes pour C, Python, et d'autres langages de programmation. Par exemple, le %04d augmente à un nombre entier ajouté au début de zéros, pour avoir toute la largeur des chiffres. Si vous voudriez que les identifications soient 1, 2, 3, etc.., placé simplement le paramètre de formatage à %d.

source: Researcher Information
fr: Informations sur le chercheur

source: Enter your personal information in the corresponding text entry fields. Although GRAMPS requests information about you, this information is used only so that GRAMPS can create valid GEDCOM output files. A valid GEDCOM file requires information about the file's creator. If you choose, you may leave the information empty, however none of your exported GEDCOM files will be valid.
fr: Entrez vos informations personnelles dans les champs de saisie. Bien que GRAMPS vous interroge, cette information ne sert qu' à créer des fichiers GEDCOM valides. Le format GEDCOM a besoin de données sur l'auteur du fichier. Vous pouvez laissez les données vides mais les fichiers GEDCOM exportés ne seront pas valides. GRAMPS requests information about you,

source: Display
fr: Affichage

source: This category contains preferences relevant to displaying database records and controls in GRAMPS. It has the following subcategories:
fr: Cette catégorie regroupe les préférences pour afficher le contenu de la base de données et les contrôles. Les sous-catégories suivantes existent :

source: Default view
fr: Vue de défaut

source: This determines which view will appear when you start GRAMPS. Choose between Person and Family views.
fr: Ceci détermine quelle vue apparaîtra quand vous commencez GRAMPS. Choisissez entre les vues de personne et de famille.

source: Family view style
fr: Modèle de vue de famille

source: This selects between the two available styles of the Family view layout. The <guilabel>Left to right</guilabel> style is similar to the Family Tree Maker (tm), while the <guilabel>Top to bottom</guilabel> is similar to the Reunion.
fr: Ceci choisit entre les deux modèles disponibles de vue de famille. Le style <guilabel>Gauche vers la Droite</guilabel> ressemble à Family Tree Maker (tm), alors que le style <guilabel>de Haut en Bas</guilabel> est proche de Réunion.

source: Always display the LDS ordinance tabs
fr: Toujours afficher l'onglet LDS

source: Check this box to have LDS ordinance tabs displayed. If you do not know what LDS is then you probably should not check it.
fr: Validez ce choix si vous souhaiter toujours afficher l'onglet des données LDS (Later Days Saints, Mormons en français). Si vous ne savez pas ce que c'est, ne le validez pas.

source: Display Tip of the Day
fr: Astuce d'affichage du jour

source: Check this box to have the <guilabel>Tip of the Day</guilabel> dialog appear on every startup. The tips are displayed randomly from the large collection of information bits on GRAMPS.
fr: Vérifiez cette boîte pour avoir <guilabel>l'astuce du jour</guilabel> à chaque démarrage. Les astuces sont montrés aléatoirement de la base de GRAMPS.

source: The <guilabel>Tip of the Day</guilabel> is likely to be useful for new user of GRAMPS.
fr: <guilabel>L'astuce du jour</guilabel> est susceptible d'être utile pour le nouvel utilisateur de GRAMPS.

source: Select the display format for the dates from the available formats listed in this menu.
fr: Choisissez le format d'affichage pour les dates à partir des formats disponibles énumérés dans ce menu.

source: Available date display formats are language-specific. Depending on whether or not there is a GRAMPS date displayer available for your language, you may or may not have a lot of choices.
fr: Les formats d'affichage disponibles sont spécifiques à une langue. Selon le displayer GRAMPS pour votre langue, vous pouvez ou ne pouvez pas avoir beaucoup de choix.

source: Toolbar and Statusbar
fr: Barre d'outils et Barre de Statut

source: Select the desired appearance of the toolbar icons from the menu. Selecting <guilabel>GNOME Settings</guilabel> will use the overall settings selected for your GNOME desktop.
fr: Sélectionne l'affichage des icônes de la barre d'outils. Les <guilabel>paramètres GNOME </guilabel> seront utilisés par GRAMPS. Il est possible d'afficher seulement les icônes, seulement le texte ou encore d'afficher les deux.

source: Statusbar
fr: Barre de Statut

source: Select the desired contents displayed in the statusbar using the radio buttons.
fr: Sélectionne ce qui est affiché dans la barre de statut. Il est possible d'afficher le nom de l'individu seul, accompagné de l'identifiant Gramps ou aussi le lien entre la personne sélectionnée et le probant (individu origine de la recherche généalogique ascendante). Cette dernière option n'est correctement rédigée qu'en langue Anglaise pour le moment.

source: Other settings
fr: D'autres personnalisations

source: Besides <guilabel>Preferences</guilabel> dialog, there are other settings available in GRAMPS. For various reasons they have been made more readily accessible, as listed below.
fr: Sans compter que d'autres <guilabel>Préférences</guilabel> sont disponibles dans GRAMPS.Pour différentes raisons ils ont été rendus plus aisément accessibles, comme énuméré ci-dessous.

source: The columns of the list views may be added, removed, or reordered in a <guilabel>Column Editor Dialog</guilabel>, see <xref linkend="column-editor-fig"/>. Only checked columns will be shown in the view. To change their order, drag any column to its desired place inside the editor. Clicking <guibutton>OK</guibutton> will reflect the changes in the appropriate view. To invoke <guilabel>Column Editor Dialog</guilabel>, choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Column Editor...</guimenuitem></menuchoice>.
fr: Les colonnes des vues de liste peuvent être ajoutées, enlevées, ou déplacées à nouveau dans un dialogue de <guilabel>rédacteur de colonne</guilabel>, voir <xref linkend="column-editor-fig"/>. Seulement des colonnes vérifiées seront montrées dans la vue. Pour changer leur ordre, glisser n'importe quelle colonne à son endroit désiré à l'intérieur de la fenêtre. Cliquer sur <guibutton>Valider</guibutton> reflétera les changements de la vue appropriée. Pour appeler la fenêtre d'édition de colonne choisissez<menuchoice><guimenu>Edition</guimenu><guimenuitem> Editeur de Colonne...</guimenuitem></menuchoice>.

source: The <guilabel>Column Editor</guilabel> is available and works in the same way for all list views. Specifically, it is available for People View, Family View (children list). Sources View, Places View, and Media View.
fr: L'<guilabel>éditeur de Colonne</guilabel> est disponible et travaille de la même manière pour toutes les vues. Spécifiquement, elle est disponible pour la vue des Individus, vue de famille (liste d'enfants), vue des sources, vue des Lieux et vue des médias.

source: Setting Home person
fr: Réglage de la personne de référence

source: The Home person is the person who becomes active when database opened, when <guibutton>Home</guibutton> button is clicked or the <guimenuitem>Home</guimenuitem> menu item is selected from either <guimenu>Go</guimenu> menu or the right-click context menu anywhere.
fr: La personne de référence est la personne qui devient active quand le bouton <guibutton>personne de référence</guibutton> est utilisé ou le menu contextuel (clic-droit)

source: To set Home person, make the desired person active and then choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Set Home person...</guimenuitem></menuchoice>.
fr: Pour éditer la personne de référence, sélectionner la personne désirée puis choisissez <menuchoice><guimenu>Edition</guimenu><guimenuitem>personne de référence...</guimenuitem></menuchoice>.

source: Adjusting viewing controls
fr: Ajustement des commandes de visionnement

source: Whether the toolbar, the sidebar, or the filter (People View only) are displayed in the main window is adjusted through the <guimenu>View</guimenu> menu.
fr: Les Barre d'outils, Barre de Status et Filtres (vue des Individus seulement) sont ajustables dans <guimenu>Affichage</guimenu>.
