Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: The <guilabel>Notes</guilabel> tab lets you view and edit notes associated with the relationship. These could be any comments which do not naturally fit into the "Parameter-Value" pairs available to Attributes. To add a note or modify existing notes simply edit the text in the text entry field.
fr: L'onglet <guilabel>Notes</guilabel> affiche les notes sur la relation et permet leur modification. Les notes sont un simple texte libre associé à la relation. Pour modifier les notes, changez simplement le texte dans la zone de saisie de l'onglet.

source: The <guilabel>Format</guilabel> option lets you set the way the note will appear in reports and web pages. If you select Flowed, the text generated will have single spaces put in place of all multiple spaces, tabs, and single end-of-line characters. A blank line inserted between two blocks of text will signal a new paragraph; additional inserted lines will be ignored.
fr: L'option <guilabel>Format</guilabel> vous permet de choisir le rendu de la note dans la sortie (édition ou bien page Web). Choisir "Libre" remplacera les espaces multiples, les tabulations et les changements de lignes simples par un espace. Les lignes vides (deux changements de lignes consécutifs) sont comprises comme une fin de paragraphe.

source: The <guilabel>Sources</guilabel> tab lets you view and edit the sources which provide evidence for the relationship. These might be documents that refer to the relationship, but which do not necessarily document it officially. For example, if Aunt Martha's memoirs mention that her great-grandson Paul was married, the researcher may take this as evidence of the relationship between Paul and his wife existed and cite the memoirs as the source for this assumption.
fr: L'onglet <guilabel>Sources</guilabel> affiche les sources d'information sur la relation et permet leur modification. Les sources sont liées à la relation mais pas spécifiquement à un évènement. Par exemple, le journal personnel de Tante Marthe peut mentionner le couple formé par son arrière-petit-fils Paul et Clara. Dans ce cas, le couple Paul-Clara aura comme source ce journal.

source: Sources that document specific events such as marriages or divorces are better filed in relation to those events, under the Events tab.
fr: Les sources documentant des événements spécifiques tels que des mariages ou des divorces sont mieux classées sous l'étiquette <guilabel>Evénements</guilabel>.

source: The central part of the Sources window displays the list of all source references associated with the relationship. The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> allow let you add, modify, and remove a source reference to this relationship. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when a source reference is selected from the list.
fr: La partie centrale de la fenêtre montre la liste des sources associées à la relation, conservées dans la base de données. La partie du haut montre le détail de la source sélectionnée s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> vous permettent respectivement d'ajouter, modifier et supprimer une source pour la relation. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles qu'après avoir sélectionné une source dans la liste.

source: The <guilabel>Gallery</guilabel> tab lets you store and display photos and other media objects associated with the relationship. The central part of the window lists all such objects and gives you a thumbnail preview of image files. Other objects such as audio files, movie files, etc., are represented by a generic GRAMPS icon. The buttons <guilabel>+</guilabel>, <guilabel>Select</guilabel>, <guilabel>Edit</guilabel>, and <guilabel>-</guilabel> let you add a new image, add a reference to an existing image, modify an existing image, and remove a media object's link to the relationship. Note that the <guilabel>Edit</guilabel> and <guilabel>-</guilabel> buttons become available only when a media object is selected from the list.
fr: L'onglet <guilabel>Galerie</guilabel> Galerie affiche les données des objets multimédias associés à la relation et permet leur modification. La partie centrale de la fenêtre montre tous les objets multimédias conservés dans la base de données. Les objets qui sont des fichiers-images valides sont représentés par une vignette. Les autres comme des enregistrements sonores ou video sont représentés par une icône générique. Les boutons <guibutton>+</guibutton><guibutton>Choisir</guibutton>, <guibutton>Editer</guibutton> et<guibutton>-</guibutton> vous permettent respectivement d'ajouter un fichier, une référence à un objet de la base, modifier et supprimer un objet multimedia. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles qu'après avoir sélectionné un objet dans la liste

source: The <guilabel>LDS</guilabel> (Latter Days Saints) tab displays information about the LDS <guilabel>Sealed to Spouse</guilabel> ordinance. The data can include date, LDS temple, and Place. The status of the ordinance can be described through the selections available in the <guilabel>Status</guilabel> pop-up menu and can also be referenced in the corresponding <guibutton>Sources...</guibutton> and <guibutton>Note</guibutton> buttons.
fr: L'onglet <guilabel>LDS</guilabel> affiche les informations d'ordinance LDS de la relation et permet de les modifier. Il s'agit de la notion d' <guilabel>Epoux(se) Officiel</guilabel>. Chaque ordinance est décrite par sa date, son Temple Mormon et son lieu. Chaque ordinance peut ensuite recevoir un statut par le menu déroulant <guilabel>Statut</guilabel> ainsi qu'une source et des notes par les boutons <guibutton>Sources...</guibutton> et <guibutton>Note</guibutton>.

source: Editing Information About Sources
fr: Les sources

source: To edit source data, switch to the Sources View and select the desired entry in the list of sources. Double-click that entry or click the <guibutton>Edit</guibutton> icon on the toolbar to invoke the following <guilabel>Source Editor</guilabel> dialog:
fr: Pour modifier les données sur les sources, allez dans la vue Sources et sélectionnez celle que vous voulez modifier. Double-cliquez sur la ligne voulue ou cliquez sur le bouton <guibutton>Editer</guibutton> dans la barre d'outils pour lancer la fenêtre <guilabel>Editeur de Source</guilabel> dialog:

source: Source Editor dialog
fr: Editeur de Source

source: Shows Source Editor dialog.
fr: La fenêtre de dialogue d'édition d'une source

source: The main part of the window displays four notebook tabs containing different categories of information. Click a tab to view or edit its contents. The bottom part of the window has <guibutton>OK</guibutton> and <guibutton>Cancel</guibutton> buttons. Clicking <guibutton>OK</guibutton> will apply all the changes made in all tabs and close the dialog window. Clicking the <guibutton>Cancel</guibutton> button will close the window without applying any changes.
fr: Le haut de la fenêtre contient le titre <guilabel>Source d'information</guilabel>. La partie principale de la fenêtre contient des onglets pour afficher différentes catégories d'information. Le bas de la fenêtre contient les boutons <guibutton>Valider</guibutton> et <guibutton>Annuler</guibutton>. Le bouton <guibutton>Valider</guibutton> a pour effet d'appliquer toutes les modifications dans la base de données et de fermer la fenêtre. Le bouton <guibutton>Annuler</guibutton> ferme la fenêtre sans modifier la base de données.

source: Clicking <guibutton>OK</guibutton> will immediately save changes to the database (write on disk). All changes are immediate.
fr: En cliquant sur <guibutton>Valider</guibutton>GRAMPS sauvera immédiatement les changements à la base de données (écriture sur le disque). À la différence des versions précédentes, cette version de GRAMPS n'a pas de fonction d'enregistrement, tous les changements sont immédiats.

source: The tabs provide the following information categories of source data:
fr: Les onglets donnent accès aux types d'informations suivants :

source: The <guilabel>General</guilabel> tab lets you define basic information about the source: its <guilabel>Title</guilabel>, <guilabel>Author</guilabel>, <guilabel>Abbreviation</guilabel>, and <guilabel>Publication information</guilabel>. You can type this information directly into the adjacent fields.
fr: L'onglet <guilabel>Général</guilabel> permet l'édition d'informations générales au sujet de la source: son <guilabel>titre</guilabel>, <guilabel>auteur</guilabel>, <guilabel>abrégé du titre</guilabel>, et l'<guilabel>information de publication</guilabel>. Cette information peut être introduite au clavier dans les champs appropriés d'enregistrement de texte.

source: The <guilabel>Note</guilabel> tab provides a place to record various information about the source that does not fit neatly into other categories. To add a note or modify existing notes simply edit the text in the text entry field.
fr: L'onglet <guilabel>Note</guilabel> contient les notes concernant la source. Si vous voulez ajouter ou modifier des notes, il vous suffit de modifier le contenu de la zone de texte.

source: Data
fr: Données

source: The <guilabel>Data</guilabel> tab displays "Key/Value" pairs that may be associated with the source. These are similar to the "Attributes" used for other types of GRAMPS records. The difference between these Key/Value pairs and Attributes is that Attributes may have source references and notes, while Key/Value data may not.
fr: L'onglet <guilabel>Données</guilabel> montrent les paires de "clés/valeurs" qui peuvent être associées à la source. Elles sont semblables aux "attributs" utilisés pour d'autres types d'enregistrement. La différence reste que les attributs peuvent avoir des références, des sources et des notes, les données ne peuvent pas.

source: The central part of the window lists all existing Key/Value pairs. The buttons <guibutton>+</guibutton> and <guibutton>-</guibutton> let you add and remove pairs. To modify the text of Key or Value, first select the desired entry. Then click in either the Key or Value cell of that entry and type your text. When you are done, click outside the cell to exit editing mode.
fr: La partie centrale montre la liste de toutes les paires de valeurs clefs éventuelles.Les boutons <guibutton>+</guibutton> et <guibutton>-</guibutton>vous permettent également d'ajouter et enlever des paires. Pour modifier le texte, choisissez d'abord l'entrée désirée (peut être une entrée vide). Cliquer alors à l'intérieur du champ. Quand vous avez fini, cliquer en dehors de la cellule pour sortir.

source: The <guilabel>Gallery</guilabel> tab lets you store and display photos and other media objects associated with a given source (for example, a photo of a birth certificate). The central part of the window lists all such media objects and gives you a thumbnail preview of image files. Other objects such as audio files, movie files, etc., are represented by a generic GRAMPS icon. The buttons <guibutton>+</guibutton>, <guibutton>Select</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> let you add a new image, add a reference to an existing image, modify an existing image, and remove a media object's link to the source. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when a media object is selected from the list.
fr: L'onglet <guilabel>Galerie</guilabel> affiche les données des objets multimédias associés à la source et permet leur modification. La partie centrale de la fenêtre montre tous les objets multimédias conservés dans la base de données. Les objets qui sont des fichiers-images valides sont représentés par une vignette. Les autres comme des enregistrements sonores ou video sont représentés par une icône générique. Les boutons <guibutton>+</guibutton>, <guibutton>Choisir</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> vous permettent respectivement d'ajouter un fichier, une référence à un objet déjà dans la base, modifier et supprimer un objet multimedia. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles qu'après avoir sélectionné un objet dans la liste.

source: References
fr: Références

source: The <guilabel>References</guilabel> tab lists all the database records that refer to this source, if any. The list can be ordered by any of its column headings: <guilabel>Type</guilabel>, <guilabel>ID</guilabel>, or <guilabel>Name</guilabel>. Double-clicking an entry allows you to view and edit the record.
fr: L'onglet <guilabel>Références</guilabel> liste les objets de la base de données qui font référence à la source. Si cette source n'est citée dans aucun objet, la liste est vide. Si au contraire elle est citée de nombreuses fois, la liste les montrera tous. Elle peut être triée par n'importe quelle colonne, en cliquant sur son en-tête : <guilabel>Type</guilabel>, <guilabel>ID</guilabel>, ou <guilabel>Nom</guilabel>. Double-cliquer sur une source de la liste permet d'ouvrir l'éditeur de source

source: Only primary objects can be shown in the <guilabel>References</guilabel> tab: Person, Family, Event, Place, or Media object. Secondary objects such as Names and Attributes can only be accessed through the primary objects to which they belong.
fr: Seul les objets primaires peuvent être montrés dans l'onglet <guilabel>Références</guilabel> : l'individu, la famille, l'événement, l'endroit, ou les objets média. Les objets secondaires tels que des noms et des attributs, bien que pouvant se référer à la source, apparaîtront seulement par leurs objets primaires.

source: Editing Information About Places
fr: Les lieux

source: To edit information about places, switch to the Places View and select the desired entry from the list of places. Double-click that entry or click the <guibutton>Edit</guibutton> button on the toolbar to bring up the following <guilabel>Place Editor</guilabel> dialog:
fr: Pour modifier les données sur un lieu, allez dans la vue Lieux, sélectionner celui que vous voulez puis double-cliquez ou utilisez l'icône <guibutton>Edit</guibutton> dans la barre d'outils pour lancer la fenêtre de dialogue <guilabel>Editeur de Lieux</guilabel>:

source: Place Editor dialog
fr: Editeur de Lieux

source: Shows Place Editor dialog.
fr: La fenêtre d'édition de lieux

source: The main part of the window displays seven notebook tabs containing different categories of information. Click a tab to view or edit its contents. The bottom part of the window has <guibutton>OK</guibutton> and <guibutton>Cancel</guibutton> buttons. Clicking <guibutton>OK</guibutton> will apply all the changes made in all tabs and close the dialog window. Clicking the <guibutton>Cancel</guibutton> button will close the window without applying any changes.
fr: Le haut de la fenêtre contient son titre <guilabel>Editeur de Lieux</guilabel>. La partie principale de la fenêtre montre des onglets présentant différentes informations. La partie du bas contient les boutons <guibutton>Valider</guibutton> et <guibutton>Annuler</guibutton>. Le bouton <guibutton>Valider</guibutton> a pour effet d'appliquer toutes les modifications dans la base de données et de fermer la fenêtre. Le bouton <guibutton>Annuler</guibutton> ferme la fenêtre sans modifier la base de données.

source: Clicking <guibutton>OK</guibutton> will immediately save changes to the database). All changes are immediate.
fr: En cliquant sur <guibutton>Valider</guibutton>GRAMPS sauvera immédiatement les changements à la base de données (écriture sur le disque). À la différence des versions précédentes, cette version de GRAMPS n'a pas de fonction d'enregistrement, tous les changements sont immédiats.

source: The tabs represent following categories of place data:
fr: Les onglets donnent accès aux types d'informations suivants :

source: The <guilabel>General</guilabel> tab you view and edit the basic information about the place: the <guilabel>Title</guilabel> which labels it in the database, <guilabel>City</guilabel>, <guilabel>Church parish</guilabel>, <guilabel>County</guilabel>, <guilabel>State</guilabel>, <guilabel>Country</guilabel>, <guilabel>Longitude</guilabel>, and <guilabel>Latitude</guilabel>. You can type this information directly into the adjacent fields.
fr: L'onglet <guilabel>Général</guilabel> permet la modification des caractéristiques les plus communes du lieu : le nom sous lequel il apparaît dans la base de données, la ville, la paroisse, le département, la région, le pays, la longitude et la latitude. Toutes ces informations sont saisies dans des zones de texte.

source: Other names
fr: Autres Noms

source: The <guilabel>Other names</guilabel> tab lets you view and edit other names by which the place might be known. The bottom part of the window lists all other names of the place stored in the database. The top part of the window shows the details of the currently selected name in the list (if any). The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> let you add, modify, and remove a name record. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when a name is selected from the list.
fr: L'onglet <guilabel>Autres Noms</guilabel> noms affiche les autres noms sous lesquels les lieux peuvent être connus et autorise leur modification. La partie du bas montre tous les autres noms de tous les lieux déclarés dans la base de données. La partie du haut montre le détail de la dénomination sélectionnée s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> vous permettent respectivement d'ajouter, modifier et supprimer un autre nom pour le lieu en cours d'édition. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles qu'après avoir sélectionné une dénomination dans la liste.

source: The <guilabel>Note</guilabel> tab displays any comments or notes concerning the place. To add a note or modify existing notes simply edit the text in the text entry field.
fr: L'onglet <guilabel>Note</guilabel> contient les notes concernant le lieu. Si vous voulez ajouter ou modifier des notes, il vous suffit de modifier le contenu de la zone de texte.

source: The <guilabel>Sources</guilabel> tab lets you view and edit sources relevant to a place. The central part of the window lists all such source references stored in the database. The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> let you add, modify, and remove a source reference associated with a place. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when a source reference is selected from the list.
fr: L'onglet <guilabel>Sources</guilabel> affiche les sources d'information sur le lieu et permet leur modification. La partie centrale de la fenêtre montre la liste des sources associées au lieu, conservées dans la base de données. La partie du haut montre le détail de la source sélectionnée s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> vous permettent respectivement d'ajouter, modifier et supprimer une source pour le lieu. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles qu'après avoir sélectionné une source dans la liste.

source: The <guilabel>Gallery</guilabel> tab lets you store and display photos and other media objects associated with a given place. The central part of the window lists all such media objects and gives you a thumbnail preview of image files. Other objects such as audio files, movie files, etc., are represented by a generic GRAMPS icon. The buttons <guibutton>+</guibutton>, <guibutton>Select</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> let you add a new image, add a reference to an existing image, modify an existing image, and remove a media object's link to the place. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when a media object is selected from the list.
fr: L'onglet <guilabel>Galerie</guilabel> affiche les données des objets multimédias associés au lieu et permet leur modification. La partie centrale de la fenêtre montre tous les objets multimédias conservés dans la base de données. Les objets qui sont des fichiers-images valides sont représentés par une vignette. Les autres comme des enregistrements sonores ou video sont représentés par une icône générique. Les boutons <guibutton>+</guibutton>, <guibutton>Choisir</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> vous permettent respectivement d'ajouter un fichier, une référence à un objet de la base, modifier et supprimer un objet multimedia. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles qu'après avoir sélectionné un objet dans la liste.

source: The <guilabel>Internet</guilabel> tab contains Internet addresses relevant to the place. The bottom part of the window lists all such Internet addresses stored in the database. The top part shows the details of the currently selected address in the list (if any). The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> let you add, modify, and remove an Internet address. The <guibutton>Go</guibutton> button (represented by an icon with a green arrow and yellow circle) opens your browser and takes you to the web page corresponding to the highlighted Internet address. Note that the <guibutton>Edit</guibutton>, <guibutton>-</guibutton>, and <guibutton>Go</guibutton> buttons become available only when an address is selected from the list.
fr: L'onglet <guilabel>Internet</guilabel> présente les informations sur les adresses Internet (URL) associées aux lieux. La partie du bas affiche la liste de tous les adresses Internet du lieu considéré. La partie du haut montre le détail de l'adresse sélectionnée s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> permettent respectivement l'ajout, la modification et la suppression d'une adresse. Le bouton <guibutton>Ouvrir cette page</guibutton> permet d'ouvrir une page Internet avec votre navigateur favori. Notez que les boutons <guibutton>Editer</guibutton>, <guibutton>-</guibutton> et <guibutton>Ouvrir cette page</guibutton> ne sont disponibles que lors de la sélection d'une adresse dans la liste.

source: The <guilabel>References</guilabel> tab indicates any database records (events or LDS ordinances) that refer to a place. This information cannot be modified from the Place Editor dialog. Instead, the corresponding database record (e.g., a birth event) has to be brought up and its place reference edited.
fr: L'onglet <guilabel>Références</guilabel> liste les objets de la base de données qui font référence à ce lieu. S'il n'est cité dans aucun objet, la liste est vide. Si au contraire il est cité de nombreuses fois, la liste les montrera tous. On ne peut pas modifier les liens des objets de la base de données vers les lieux à l'aide de l'<guilabel>éditeur de lieux</guilabel>. Il faut ouvrir l'objet citant le lieu (par exemple un évènement de naissance) puis modifier la référence de lieu.

source: Editing Information About Media Objects
fr: Les médias
