Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: The top of the window shows the name of the person whose data is being edited. Below this name are ten "notebook tabs" containing different categories of available information. Click any tab to view and edit its contents. Clicking the <guibutton>OK</guibutton> button at the bottom will apply all the changes made in all tabs and close the dialog window. Clicking the <guibutton>Cancel</guibutton> button will close the window without applying any changes. If any data in any tabs were modified, an alert window will appear, prompting you to choose from the following options: close the dialog without saving changes, cancel the initial cancel request, or save the changes.
fr: Le haut de la fenêtre présente le nom de la personne dont les données sont en modification. La partie principale de la fenêtre présente des onglets correspondant à chaque catégorie d'information disponible. Cliquez sur le nom de l'onglet pour faire apparare son contenu et donc permettre l'accès à ses données. Le bas de la fenêtre contient les boutons <guibutton>Valider</guibutton> et <guibutton>Annuler</guibutton>. Le bouton <guibutton>Valider</guibutton> a pour effet d'appliquer toutes les modifications dans la base de données et de fermer la fenêtre. Le bouton <guibutton>Annuler</guibutton> ferme la fenêtre sans modifier la base de données. Si des modifications avaient été faites, une fenêtre d'avertissement proposera le choix entre fermer sans écrire les données dans la base, annuler la commande de fermeture ou écrire les données dans la base.

source: Clicking <guibutton>OK</guibutton> will immediately save changes to the database. There is no need for a Save operation, since all changes are immediate.
fr: Cliquer sur <guibutton>Valider</guibutton> enregistrera immédiatement les changements dans la base de données (écriture sur le disque). Cette version de GRAMPS n'a pas une fonction séparée d'enregistrement, tous les changements sont immédiats.

source: If a tab label is in boldface type, this means it contains data. If not, it has no data.
fr: Les onglets (étiquettes) reflètent la présence d'information correspondante: si l'étiquette contient n'importe quelles données, elle apparaît avec des caractères gras; si l'étiquette n'a aucune donnée, elle semble régulière (non "bold").

source: The tabs reflect the following categories of personal data:
fr: Les onglets donnent accès aux types d'informations suivantes :

source: General
fr: Général

source: The <guilabel>General</guilabel> tab contains general information about the person. This includes <guilabel>Given name</guilabel>, <guilabel>Family name</guilabel>, <guilabel>Family prefix</guilabel> (such as "de" or "van"), <guilabel>Suffix</guilabel> (e.g. Jr. or III), <guilabel>Title</guilabel> (e.g. Dr. or Rev.), <guilabel>Nickname</guilabel> (Bob for Robert), <guilabel>Type</guilabel> of the name (birth name, married name, etc.) and <guilabel>Date</guilabel> and <guilabel>Place</guilabel> of birth and death. Some of these (<guilabel>Family name</guilabel>, <guilabel>Type</guilabel>, and both <guilabel>Place</guilabel> fields), also provide "autocompletion" feature: as you type in these fields, a menu appears below the field containing database entries that match your partial input. This gives you a shortcut by letting you select an entry that already exists in the database rather than having to type it all out. You can select the entry using your mouse or using your arrow and <keycap>Enter</keycap> keys.
fr: L'onglet <guilabel>Général</guilabel> permet la modification des informations générales de la personne. Ceci comprend les zones de saisie suivantes : <guilabel>Prénom</guilabel>, <guilabel>Nom de famille</guilabel>, <guilabel>Particule</guilabel> (comme "de" ou "van"), <guilabel>Suffixe</guilabel> (par exemple Jr. ou III), <guilabel>Titre</guilabel> (par exemple Dr. ou Pr.), <guilabel>Surnom </guilabel> (par exemple Jeannot pour Jean), <guilabel>Type</guilabel> du nom (nom de naissance, nom marital...) et <guilabel>Date</guilabel> et <guilabel>Lieux</guilabel> de naissance et de décès. Certains de ces champs de saisie (<guilabel>Nom</guilabel>, <guilabel>Type</guilabel>, ainsi que <guilabel>Lieux</guilabel>), permettent d'ouvrir la liste des possibilités par un menu déroulant, à l'aide de la flèche vers le bas présente à droite du champ. Les choix proposés par le menu déroulant sont ceux déjà connus dans la base de données. GRAMPS essaiera aussi de deviner la suite du texte que vous aurez commencé à saisir à partir des données déjà connues. Si ce que vous propose GRAMPS vous convient, acceptez-le avec la touche <keycap>Entrée</keycap> key.

source: The <guilabel>Edit</guilabel> (that is, the "pen and paper" icon) next to the <guilabel>Family name</guilabel> entry field invokes the <guilabel>Name Editor</guilabel> dialog. This dialog allows editing the preferred name in full detail (see <xref linkend="adv-an"/>).
fr: Le bouton <guilabel>Editer</guilabel> situé près du <guilabel>Nom de famille</guilabel> permet d'éditer le nom dans le détail, à l'aide de l'<guilabel>éditeur de Nom</guilabel> (voyez <xref linkend="adv-an"/>).

source: The <guilabel>Gender</guilabel> radio buttons offer the choice of person's gender : <guilabel>male</guilabel>, <guilabel>female</guilabel>, and <guilabel>unknown</guilabel>.
fr: Le bouton radio <guilabel>Genre</guilabel> donnent le choix entre <guilabel>masculin</guilabel>, <guilabel>feminin</guilabel>, et <guilabel>inconnu</guilabel>.

source: Clicking the colored "LED" buttons located next to the birth and death Date fields will bring up the <guilabel>Date Selection</guilabel> dialog allowing detailed modification of the date, see <xref linkend="adv-dates"/>. Clicking either the <guibutton>Edit</guibutton> button located next to the birth and death LED buttons will bring up a dialog allowing you to edit the birth or death details (see <xref linkend="adv-ev"/>).
fr: Cliquer sur les boutons colorés (cercle vert, jaune, ou rouge, également appelé des boutons LED), situés à côté des champs de date de naissance et de mort <guilabel>Sélection de la Date</guilabel>, ce qui permettera la modification détaillée de la date, voir <xref linkend="adv-dates"/>. En cliquant sur le bouton <guibutton>Editer</guibutton> situés à côté des dates de naissance et de mort LED, vous pourrez éditer les détails correspondants à l'événement (naissance ou mort), voir <xref linkend="adv-ev"/>.

source: The field <guilabel>ID</guilabel> displays the GRAMPS ID number which identifies the user in the database. This value helps you distiguish between people who have the same name. You may enter any unique value you want. If you do not provide a value, GRAMPS will automatically select a value for you.
fr: Le champ <guilabel>ID</guilabel> présente l'identifiant interne que GRAMPS attribue à chaque individu de la base de données. La zone <guilabel>Image</guilabel> montre la première image de la <guilabel>Galerie</guilabel> pour cette personne (s'il y en a).

source: The <guilabel>Image</guilabel> area shows the first image available in the <guilabel>Gallery</guilabel> of this person (if any exist).
fr: Le champ <guilabel>Image</guilabel> affiche la première image disponible dans la <guilabel>Galerie</guilabel> de cette personne (si il y en a).

source: Finally, the <guilabel>Information is complete</guilabel> and <guilabel>Information is private</guilabel> check buttons let you mark whether or not the person's record is complete and whether or not the record is private.
fr: Enfin, les cases à cocher <guilabel>Information complète</guilabel> et <guilabel>Information privée</guilabel> permettent de marquer les données de cet individu.

source: Names
fr: Noms

source: The <guilabel>Names</guilabel> tab lets you view and edit any alternate names the person may have. The bottom part of the window lists all alternate names for the person stored in the database. The top part shows the details of the currently selected name in the list (if any). The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> allow the addition, modification, and removal of an alternate name from the database. Note that the Edit and - buttons become available only when an alternate name is selected from the list.
fr: L'onglet <guilabel>Noms</guilabel> affiche les informations sur les autres dénominations de la personne et permet leur modification. La partie du bas affiche la liste de tous les autres dénominations de la personne considérée. La partie du haut montre le détail de la dénomination sélectionnée s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton>, et <guibutton>-</guibutton> permettent respectivement l'ajout, la modification et la suppression d'une dénomination. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles que lors de la sélection d'une dénomination dans la liste.

source: Edit Person dialog - Names
fr: Éditer un individu - Noms

source: Shows Names Tab of Edit Person dialog.
fr: La fenêtre de dialogue d'un individu - noms

source: When you add a new name or edit an existing name, the <guilabel>Name Editor</guilabel> dialog is invoked. This dialog is described in the section below (see <xref linkend="adv-an"/>).
fr: Quand vous ajoutez un nouveau nom ou éditez un nom existant, le dialogue de l'<guilabel>éditeur de nom</guilabel> est appelé. Ce dialogue est décrit dans la section suivante (voir <xref linkend="adv-an"/>).

source: Events
fr: Événements

source: The <guilabel>Events</guilabel> tab lets you view and edit any events relevant to the person. The bottom part of the window lists all such events stored in the database. The top part shows the details of the currently selected event in the list (if any). The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> allow you to add, modify, and remove an event record from the database. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when an event is selected from the list.
fr: L'onglet <guilabel>Evénement</guilabel> Evènements présente les données des évènements liés à la personne pour permettre leur modification. La partie du bas de la fenêtre affiche cette liste d'évènements. La partie du haut montre le détail de l'évènement sélectionné s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton>, et <guibutton>-</guibutton> vous permettent respectivement d'ajouter, modifier et supprimer un évènement Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles que lors de la sélection d'une dénomination dans la liste.

source: Edit Person dialog - Events
fr: Éditer un individu - Evénements

source: Shows Events Tab of Edit Person dialog.
fr: La fenêtre de dialogue d'un individu - événements

source: Attributes
fr: Attributs

source: The <guilabel>Attributes</guilabel> tab lets you view and assign attributes to the person. You have complete freedom to define and use attributes. For example, attributes might be assigned to describe the person's physical characteristics or personality traits.
fr: L'onglet <guilabel>Attributs</guilabel> affiche les valeurs d'attributs de l'individu et permet leur modification. Un attribut est en fait n'inmporte quelle couple Paramètre-Valeur. Par exemple, attribut peut être défini pour décrire les caractéristiques physique ou la personnalité d'un individu.

source: Note that each attribute listed in the <guilabel>Attribute</guilabel> dialog consists of two parts: the Attribute itself and a Value associated with that Attribute. This so-called "Parameter-Value" pairing can help you organize and systematize your research. For example, if you define "Hair color" as an Attribute for a person, "Hair Color" will become a selectable Attribute for all other people. The Value of Hair Color for person A might be red, and brown for person B. In similar fashion, you might define an Attribute like "Generosity" and use the Value of "Enormous" to describe a particularly generous person.
fr: Notez que chaque attributs est listé dans le dialogue <guilabel>attributs</guilabel> défini en deux parties: l'attribut lui-même et sa valeur associée. Défini comme un paire "Paramètre-Valeur" pouvant vous aider dans votre organisation et recherche. Par exemple, si vous définissez "couleur de cheveux" comme un attribut pour une personne, "couleur de cheveux" deviendra un attribut disponible à tous les autres individus. La valeur pourra être blond pour la personne A et roux ou brun pour la personne B. Dans le même esprit, vous pouvez définir un attribut comme "générosité" et utiliser la valeur "énorme" pour décrire une personne particulièrement généreuse.

source: The bottom part of the dialog window displays the list of all Attributes stored in the database. The top part shows the details of the currently selected attribute in the list (if any). The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> let you add, modify, and remove an attribute record from the database. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when an attribute is selected from the list.
fr: La partie du bas de la fenêtre montre la liste de tous les attributs conservés dans la base de données. La partie du haut montre le détail de l'attribut sélectionné s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton>, et <guibutton>-</guibutton> vous permettent respectivement d'ajouter, modifier et supprimer un attribut et sa valeur pour la personne active. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles que lors de la sélection d'une dénomination dans la liste.

source: Edit Person dialog - Attributes
fr: Éditer un individu - Attributs

source: Shows Attributes Tab of Edit Person dialog.
fr: La fenêtre de dialogue d'un individu - attributs

source: Addresses
fr: Adresses

source: The <guilabel>Addresses</guilabel> tab lets you view and record the various addresses of the person. The bottom part of the window lists all addresses stored in the database. The top part shows the details of the currently selected address in the list (if any). The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> allow you to correspondingly add, modify, and remove an address record from the database. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when an address is selected from the list.
fr: L'onglet <guilabel>Adresses</guilabel> affiche les adresses de l'individu et permet leur modification. La partie du bas de la fenêtre montre la liste des adresses de la personne active conservées dans la base de données. La partie du haut montre le détail de l'adresse sélectionnée s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton>, et <guibutton>-</guibutton> vous permettent respectivement d'ajouter, modifier et supprimer une adresse pour la personne active. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles que lors de la sélection d'une dénomination dans la liste.

source: Some reports allow you to restrict data on living people. In particular, that option will omit their addresses.
fr: Certains rapports vous permettent de restreindre les données sur les personnes vivantes. En particulier, les adresses sont omises pour celles-ci.

source: Edit Person dialog - Addresses
fr: Éditer un individu - Adresses

source: Shows Addresses Tab of Edit Person dialog.
fr: La fenêtre de dialogue d'un individu - adresses

source: Edit Person dialog - Notes
fr: Éditer un individu - Notes

source: Shows Notes Tab of Edit Person dialog.
fr: L'onglet notes de la personne éditée

source: The <guilabel>Notes</guilabel> tab provides a place to record various items about the person that do not fit neatly into other categories. To add a note or modify existing notes simply edit the text in the text entry field.
fr: L'onglet <guilabel>Notes</guilabel> affiche les notes sur l'individu et permet leur modification. Les notes sont un simple texte libre associé à la personne. Pour modifier les notes, simplement modifiez le texte dans la zone de saisie de l'onglet.

source: The <guilabel>Format</guilabel> option lets you set the way the note will appear in reports and web pages. If you select "Flowed," the text generated will have single spaces put in place of all multiple spaces, tabs, and single end-of-line characters. A blank line inserted between two blocks of text will signal a new paragraph; additional inserted lines will be ignored.
fr: L'option <guilabel>Format</guilabel> vous permet de choisir le rendu de la note dans la sortie (édition ou bien page Web). Choisir "Libre" remplacera les espaces multiples, les tabulations et les changements de lignes simples par un espace. Les lignes vides (deux changements de lignes consécutifs) sont comprises comme une fin de paragraphe.

source: If you select the Preformatted option, the text in reports and web pages will appear exactly as you enter it in the Notes dialog.
fr: Au contraire, choisir "Préformaté" conservera à l'identique les espaces multiples, les tabulations et les changements de ligne comme ils ont été saisis dans la zone de texte.

source: Edit Person dialog - Sources
fr: Éditer un individu - Sources

source: Shows Sources Tab of Edit Person dialog.
fr: La fenêtre de dialogue d'un individu - notes

source: The <guilabel>Sources</guilabel> tab allows you to view and document the sources for the information you collect. These might be general sources that do not describe a specific event, but which nevertheless yield information about the person. For example, if Aunt Martha's memoirs mention her great-grandson Paul, the researcher may assume that this Paul actually existed and cite Aunt Martha's memoirs as the source that justifies this assumption.
fr: L'onglet <guilabel>Sources</guilabel> affiche les sources d'information sur l'individu et permet leur modification. Les sources sont liées à la personne mais pas spécifiquement à un évènement. Par exemple, le journal personnel de Tante Marthe peut mentionner son arrière-petit-fils Paul. Dans ce cas, Paul aura comme source ce journal.

source: Sources which document specific events are best recorded as sources of the event (under the <guilabel>Events</guilabel> tab) instead of as a source of the person. The person's <guilabel>Sources</guilabel> tab is best used for any sources not specificly connected to any other data.
fr: Sources documenting si une source est liée à un <guilabel>Evénements</guilabel> il est préférable de la déclarer dans le dialogue de définition de cet évènement, dans l'onglet Evènements.

source: The central part displays the list of all source references stored in the database in relation to the person. The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> allow you to correspondingly add, modify, and remove a source reference to this person. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when a source reference is selected from the list.
fr: La partie centrale de la fenêtre montre la liste des sources associées à la personne active conservées dans la base de données. La partie du haut montre le détail de la source sélectionnée s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton>, et <guibutton>-</guibutton> vous permettent respectivement d'ajouter, modifier et supprimer une source pour la personne active. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles qu'après avoir sélectionné une source dans la liste.

source: Gallery
fr: Galerie

source: The <guilabel>Gallery</guilabel> tab lets you view and store photos, videos, and other media objects that are associated with the person. The central part of the window lists all such media objects. Any object in the form of a valid image file will result in the display of a thumbnail view of the image. For other objects such as audio files, movie files, etc., a corresponding file type icon is displayed instead.
fr: L'onglet <guilabel>Galerie</guilabel> affiche les données des objets multimédias associés à l'individu et permet leur modification. La partie centrale de la fenêtre montre tous les objets multimédias conservés dans la base de données. Les objets qui sont des fichiers-images valides sont représentés par une vignette. Les autres comme des enregistrements sonores ou video sont représentés par une icône générique.

source: The first available image in the gallery will be also displayed in the <guilabel>Image</guilabel> area in the <guilabel>General</guilabel> tab.
fr: Remarquez que la première image est aussi présentée dans la zone <guilabel>Image</guilabel> de l'onglet <guilabel>Général</guilabel>

source: The buttons <guibutton>+</guibutton>, <guibutton>Select</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> let you add a new image to the database, link to an image already stored in the database, modify an image, and remove a given media object from the person's gallery. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when a media object is selected from the list.
fr: Les boutons <guibutton>+</guibutton>, <guibutton>Choisir</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> vous permettent respectivement d'ajouter une nouvelle image, ajouter une référence à image déjà dans la base, modifier et supprimer la référence à un objet multimedia. Notez que les boutons<guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles qu'après avoir sélectionné un objet dans la liste.

source: Edit Person dialog - Gallery
fr: Éditer un individu - Galerie

source: Shows Gallery Tab of Edit Person dialog.
fr: La fenêtre de dialogue d'un individu - galerie

source: Removing a media object from a person's gallery does not remove it from the database. It only removes the reference to that object from this person's record.
fr: Retirer un objet multimedia de la galerie d'une personne ne le supprime pas de la base de données. Cela ne retire que le lien entre la personne et l'objet.
