Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: This category includes the following rules that match people based on their ancestral relations to other people:
fr: Cette catégorie comprend les règles suivantes qui sélectionnent les personnes d'après leurs relations d'ascendance avec d'autres personnes :

source: Is an ancestor of
fr: Est l'ancêtre de

source: This rule matches people who are ancestors of the specified person. The Inclusive option determines whether the specified person should be considered his/her own ancestor (useful for building reports).
fr: Cette règle sélectionne les personnes ancêtres de la personne désignée. L'option Inclusif précise si la personne désignée est à considérer comme ancêtre d'elle-même, ce qui est utile pour construire des éditions.

source: Is an ancestor of person at least N generations away
fr: Est l'ascendant d'un individu sur au moins N générations

source: This rule matches people who are ancestors of the specified person and are at least N generations away from that person in their lineage. For example, using this rule with the value of 2 for the number of generations will match grandparents, great-grandparents, etc., but not the parents of the specified person.
fr: Cette règle sélectionne les personnes ancêtres de la personne désignée à au moins N générations d'écart. Par exemple, un écart de 2 sélectionnera les grands-parents, les arrière-grands-parents..., mais pas les parents de la personnes désignée.

source: Is an ancestor of person not more than N generations away
fr: Est l'ascendant d'un individu sur moins de N générations

source: This rule matches people who are ancestors of the specified person and are no more than N generations away from that person in their lineage. For example, using this rule with the value of 2 for the number of generations will match parents and grandparents, but not great-grandparents, etc., of the specified person.
fr: Cette règle sélectionne les personnes ancêtres de la personne désignée à au plus N générations d'écart. Par exemple, un écart de 2 sélectionnera les parents et les grands-parents, mais pas les arrière-grands-parents... de la personnes désignée.

source: Has a common ancestor with
fr: A un ancêtre commun avec

source: This rule matches people who have common ancestors with the specified person.
fr: Cette règle sélectionne les personnes qui ont un ancêtre commun avec la personne désignée.

source: Has a common ancestor with filter match
fr: A un ascendant commun avec les individus résultant du filtrage

source: This rule matches people who have common ancestors with someone who is matched by the specified filter. The specified filter name should be selected from the menu.
fr: Cette règle sélectionne les personnes qui ont un ancêtre commun avec les personnes sélectionnées par un filtre. Le filtre est choisi par son nom dans un menu.

source: Is an ancestor of filter match
fr: Est l'ascendant d'un individu résultant du filtrage

source: This rule matches people who are ancestors of someone who is matched by the specified filter. The specified filter name should be selected from the menu.
fr: Cette règle sélectionne les personnes qui sont ancêtres d'une des personnes sélectionnées par un filtre. Le filtre est choisi par son nom dans un menu.

source: Descendant filters
fr: Filtres descendants

source: This category includes the following rules that match people based on their descendant relations to other people:
fr: Cette catégorie comprend les règles suivantes qui sélectionnent les personnes d'après leurs relations de descendance avec d'autres personnes :

source: Is a descendant of
fr: Est descendant(e) de

source: This rule matches people who are descendants of the specified person. The Inclusive option determines whether the specified person should be considered his/her own descendant (useful for building reports).
fr: Cette règle sélectionne les personnes qui descendent de la personne désignée. L'option Inclusif précise si la personne désignée est à considérer comme descendant d'elle-même, ce qui est utile pour construire des rapports.

source: Is a descendant of person at least N generations away
fr: Est descendant d'un individu sur au moins N générations

source: This rule matches people who are descendants of the specified person and are at least N generations away from that person in their lineage. For example, using this rule with the value of 2 for the number of generations will match grandchildren, great-grandchildren, etc., but not the children of the specified person.
fr: Cette règle sélectionne les personnes qui descendent de la personne désignée à au moins N générations d'écart. Par exemple, un écart de 2 sélectionnera les petits-enfants, les arrière-petits-enfants..., mais pas les enfants de la personnes désignée.

source: Is a descendant of person not more than N generations away
fr: Est descendant d'un individu sur moins de N générations

source: This rule matches people who are descendants of the specified person and are no more than N generations away from that person in their lineage. For example, using this rule with the value of 2 for the number of generations will match children and grandchildren, but not great-grandchildren, etc., of the specified person.
fr: Cette règle sélectionne les personnes qui descendent de la personne désignée à au plus N générations d'écart. Par exemple, un écart de 2 sélectionnera les enfants et les petits-enfants, mais pas les arrière-petits-enfants... de la personnes désignée.

source: Is a descendant of filter match
fr: Est descendant d'un individu résultant du filtrage

source: This rule matches people who are descendants of someone who is matched by the specified filter. The specified filter name should be selected from the menu.
fr: Cette règle sélectionne les personnes qui descendent d'une des personnes sélectionnées par un filtre. Le filtre est choisi par son nom dans un menu.

source: Is a descendant family member of
fr: Est un membre de la famille descendante de

source: This rule not only matches people who are descendants of the specified person, but also those descendants' spouses.
fr: Cette règle sélectione en plus des descendants directs de la personne désignée, ceux des époux(ses) des descendants directs.

source: Relationship filters
fr: Filtres relationnels

source: This category includes the following rules that match people based on their mutual relationship:
fr: Cette catégorie comprend les règles suivantes qui sélectionnent les personnes d'après leurs relations :

source: Relationship path between two people
fr: Relation entre deux individus

source: This rule matches all ancestors of both people back to their common ancestors (if exist). This produces the "relationship path" between these two people, through their common ancestors.
fr: Cette règle sélectionne les ancêtres des deux personnes jusqu'à leur ancêtre commun s'il existe. Ceci donne la "liaison relationnelle" entre ces individus à travers leur(s) ancêtre(s) commun(s).

source: You can either enter the ID of each person into the appropriate text entry fields, or select people from the list by clicking their <guibutton>Select...</guibutton> buttons. In the latter case, the ID will appear in the text field after the selection was made.
fr: Vous pouvez soit saisir l'identifiant des personnes dans une zone de saisie, soit les sélectionner dans la liste en cochant leur bouton <guibutton>Sélectionner...</guibutton>.Dans ce cas, l'identifiant apparaîtra dans la zone de saisie après la sélection.

source: Miscellaneous filters
fr: Filtres divers

source: This category includes the following rules which do not naturally fit into any of the above categories:
fr: Cette catégorie comprend les règles suivantes qui n'appartiennent pas aux autres catégories :

source: Has the personal attribute
fr: A l'attribut individuel

source: This rule matches people who have the personal attribute of the specified value. The specified personal attribute name should be selected from the menu. The specified value should be typed into the text entry field.
fr: Cette règle sélectionne les personnes qui ont l'attribut individuel avec une valeur donnée. L'attribut sur lequel porte la sélection est choisi dans un menu déroulant. La valeur désirée pour cet attribut est saisie dans une zone de texte.

source: Has the family attribute
fr: A l'attribut familial

source: This rule matches people who have the family attribute of the specified value. The specified family attribute should be selected from the menu. The specified value should be typed into the text entry field.
fr: Cette règle sélectionne les personnes qui ont l'attribut familial avec une valeur donnée. L'attribut sur lequel porte la sélection est choisi dans un menu déroulant. La valeur désirée pour cet attribut est saisie dans une zone de texte.

source: Matches the filter named
fr: Correspond au filtre suivant

source: This rule matches people who are matched by the specified filter. The specified filter name should be selected from the menu.
fr: Cette règle sélectionne les personnes par un filtre. Le filtre est choisi par son nom dans un menu.

source: Command line reference
fr: Références en ligne de commande

source: This appendix provides the reference to the command line capabilities available when launching GRAMPS from the terminal.
fr: Cette annexe décrit les possibilités offertes par GRAMPS en ligne de commande, depuis un terminal.

source: GRAMPS was designed to be an interactive program. Therefore it uses graphical display and cannot run from the true non-graphical console. It would take an enormous amount of effort to enable it to run in a text-only terminal. This is why the set of command line options does not aim to completely get rid of dependency on the graphical display. Rather, it merely makes certain (typical) tasks more convenient. It also allows one to execute these tasks from the scripts. However, the graphical display must be accessible at all times!
fr: GRAMPS est écrit pour être piloté à travers son interface graphique. Il ne peut pas être utilisé dans un mode strictement limité au texte. Les modifications pour le faire seraient très importantes. C'est pourquoi les options de la ligne de commande ne visent pas l'indépendance par rapport au mode graphique. En fait, elles rendent seulement certaines tâches fréquentes plus commodes et exécutables depuis des scripts. L'affichage graphique doit cependant toujours être accessible.

source: To summarize, the use of the command line options provides non-interactive behavior, but does not get rid of graphical display dependency. Take it or leave it!
fr: En résumé, les options de la ligne de commande fournissent un mode non-interactif mais n'affranchissent pas d'un affichage graphique. C'est comme çà !

source: Available options
fr: Options disponibles

source: This section provides the reference list of all command line options available in GRAMPS. If you want to know more than just a list of options, see next sections: <xref linkend="cmdline-operation"/> and <xref linkend="cmdline-examples"/>.
fr: Voici la liste des options de lancement de GRAMPS. Si vous voulez connaître plus d'options, voir <xref linkend="cmdline-operation"/> et <xref linkend="cmdline-examples"/>.

source: Format options
fr: Options de format

source: The format of any file destined for opening, importing, or exporting can be specified with the <command>-f <replaceable>format</replaceable></command> option. The acceptable <replaceable>format</replaceable> values are listed below.
fr: Le format des fichiers de lecture ou d'écriture est donné par l'option <command>-f <replaceable>format</replaceable></command> Les valeurs acceptables <replaceable>format</replaceable> sont énumérées ci-dessous.

source: GRAMPS database. This format is available for opening, import, and export. When not specified, it can be guessed if the filename ends with .grdb
fr: Base de données de GRAMPS.Ce format est prêt à l'ouverture, à l'importation, et à l'exportation. Une fois indiqué, il peut deviner si le fichier porte l'extension grdb

source: GRAMPS XML database. This format is available for opening, import, and export. When not specified, it can be guessed if the filename ends with .gramps
fr: Base de données de GRAMPS. Ce format est prêt à l'ouverture, à l'importation, et à l'exportation. Une fois indiqué, il peut deviner si le fichier représente un dossier-gramps.

source: GEDCOM file. This format is available for opening, import, and export. When not specified, it can be guessed if the filename ends with .ged
fr: Fichier GEDCOM.Ce format est prêt à l'ouverture, à l'importation, et à l'exportation. Une fois indiqué, il peut deviner si le fichier porte l'extension ged

source: GRAMPS package. This format is available for import and export. When not specified, it can be guessed if the filename ends with .gpkg
fr: Paquet de GRAMPS.Ce format est prêt à l'importation et à l'exportation. Une fois indiqué, il peut deviner si le fichier porte l'extension tgz

source: GeneWen file This format is available for import and export. When not specified, it can be guessed if the filename ends with .gw
fr: Le fichier de GeneWen.Ce format est prêt à l'importation et à l'exportation. Une fois indiqué, il peut deviner si le fichier porte l'extension gw

source: Web Family Tree. This format is available for export only. When not specified, it can be guessed if the filename ends with .wft
fr: Web Family Tree. Ce format est prêt à l'exportation seulement. Une fois indiqué, il peut deviner si le fichier porte l'extension wft

source: CD image. This format is available for export only. It must always be specified explicitly.
fr: Image de CD. Ce format est prêt à l'exportation seulement. Il doit toujours être indiquer explicitement.

source: Opening options
fr: Options d'ouverture

source: There are two ways to give GRAMPS the name of the file to be opened:
fr: Il y a deux manières de donner à GRAMPS le nom du fichier à ouvrir:

source: supply bare file name
fr: chemin du fichier

source: use the <command>-O <filename>filename</filename></command> or <command>-open=<filename>filename</filename></command> option
fr: use the <command>-O <filename>nom du fichier</filename></command> ou <command>-open=<filename>nom du fichier</filename></command>

source: If the filename is given without any option flag, the attempt to open the file will be made, and then the interactive GRAMPS session will be launched.
fr: Si le nom du fichier est donné sans options, GRAMPS ouvrira sa fenêtre principale et commencera une session.

source: If no option is given, just the file name, GRAMPS will ignore the rest of the command line arguments. Use the -O flag to open the file and do something with the data.
fr: Si aucune option n'est donnée, juste le nom de fichier, GRAMPS ignorera le reste des arguments de ligne de commande. Employer -o pour ouvrir le fichier et pour faire quelque chose avec les données.

source: The format can be specified with the <command>-f <replaceable>format</replaceable></command> or <command>--format=<replaceable>format</replaceable></command> option, immediately following the <filename>filename</filename>. If not specified, the guess will be attempted based on the <filename>filename</filename>.
fr: Le format peut être indiqué avec l'option <command>-f <replaceable>format</replaceable></command> ou <command>--format=<replaceable>format</replaceable></command> juste après <filename>le nom du fichier</filename>. Pour le format gramps-xml,<filename>nom de fichier</filename> est réellement le nom du répertoire sous lequel la base de données de gramps réside. Pour le grdb et le gedcom, <filename>le nom de fichier</filename> est le nom du fichier correspondant.

source: Only grdb, gramps-xml, and gedcom formats can be opened directly. For other formats, you will need to use the import option which will set up the empty database and then import data into it.
fr: Seulement grdb, gramps-xml, et les formats gedcom peuvent être ouverts directement. Pour d'autres formats, vous devrez employer l'option d'importation qui installera la base de données vide puis importera des données.

source: Only a single file can be opened. If you need to combine data from several sources, you will need to use the import option.
fr: Seulement un fichier simple peut être ouvert. Si vous devez combiner des données depuis plusieurs sources, vous devrez employer l'option d'importation.

source: Import options
fr: Options d'importation

source: The files destined for import can be specified with the <command>-i <filename>filename</filename></command> or <command>--import=<filename>filename</filename></command> option. The format can be specified with the <command>-f <replaceable>format</replaceable></command> or <command>--format=<replaceable>format</replaceable></command> option, immediately following the <filename>filename</filename>. If not specified, the guess will be attempted based on the <filename>filename</filename>.
fr: Les dossiers destinés à l'importation peuvent être indiqués avec <command>-i <filename>nom du fichier</filename></command> ou <command>--import=<filename>nom du fichier</filename></command> Le format peut être indiqué avec l'option <command>-f <replaceable>format</replaceable></command> ou <command>--format=<replaceable>format</replaceable></command> juste après<filename>nom de fichier</filename>. Pour le format gramps-xml,<filename>le nom du fichier</filename> est réellement le nom du répertoire sous lequel la base de données de gramps réside. Pour grdb, gedcom, gramps-pkg, et geneweb, <filename>le nom du fichier</filename> est le nom du fichier correspondant.

source: More than one file can be imported in one command. If this is the case, GRAMPS will incorporate the data from the next file into the database available at the moment.
fr: Plus d'un fichier peut être importé dans une commande. Si c'est le cas, GRAMPS incorporera les données à partir du prochain fichier à la base de données disponible à l'heure actuelle.

source: When more than one input file is given, each has to be preceded by <command>-i</command> flag. The files are imported in the specified order, i.e. <command> -i <filename>file1</filename> -i <filename>file2</filename></command> and <command> -i <filename>file2</filename> -i <filename>file1</filename></command> might produce different GRAMPS IDs in the resulting database.
fr: Quand plus d'un dossier d'entrée est donné, chacun doit être par précédé de<command>-i</command>Les dossiers sont importés dans l'ordre indiqué, c.-à-d.. <command> -i <filename>fichier1</filename> -i <filename>fichier2</filename></command> and <command> -i <filename>fichier2</filename> -i <filename>fichier1</filename></command> pourraient produire différentes versions dans la base de données résultant.

source: Export options
fr: Options d'exportation

source: The files destined for export can be specified with the <command>-o <filename>filename</filename></command> or <command>--output=<filename>filename</filename></command> option. The format can be specified with the <command>-f</command> option immediately following the <filename>filename</filename>. If not specified, the guess will be attempted based on the <filename>filename</filename>. For iso format, the <filename>filename</filename> is actually the name of directory the GRAMPS database will be written into. For grdb, gramps-xml, gedcom, wft, geneweb, and gramps-pkg, the <filename>filename</filename> is the name of the resulting file.
fr: Les dossiers destinés à l'exportation peuvent être indiqués avec <command>-o <filename>nom du fichier</filename></command> ou <command>--output=<filename>nom du fichier</filename></command> Le format peut être indiqué avec l'option <command>-f</command> juste après <filename>le nom du fichier</filename>. Pour gramps-xml et les formats iso, <filename>nom du fichier</filename> est réellement le nom du répertoire la base de données de gramps. Pour grdb, gedcom, wft, geneweb, et gramps-pkg,<filename>le nom du fichier</filename> est le nom du dossier résultant.

source: More than one file can be exported in one command. If this is the case, GRAMPS will attempt to write several files using the data from the database available at the moment.
fr: Plus d'un fichier peut être exporté dans une commande. Si c'est le cas, GRAMPS essayera d'écrire plusieurs fichiers en utilisant les données de la base de données disponible à l'heure actuelle.

source: When more than one output file is given, each has to be preceded by <command>-o</command> flag. The files are written one by one, in the specified order.
fr: Quand plus d'un fichier est donné, chacun doit être par précédé par <command>-o</command> Les dossiers sont écrits dans l'ordre indiqué.

source: Action options
fr: Options d'action

source: The action to perform on the imported data can be specified with the <command>-a <replaceable>action</replaceable></command> or <command>--action=<replaceable>action</replaceable></command> option. This is done after all imports are successfully completed.
fr: L'action à exécuter sur les données importées peut être indiquée avec <command>-a <replaceable>action</replaceable></command> ou <command>--action=<replaceable>action</replaceable></command> Ceci est fait après que toutes les importations soient accomplies avec succès.

source: Currently available actions are:
fr: Les actions actuellement disponibles sont:

source: This action is the same as <menuchoice><guimenu>Reports</guimenu><guisubmenu>View</guisubmenu><guimenuitem>Summary</guimenuitem></menuchoice>
fr: Cette action est identique à <menuchoice><guimenu>Rapports</guimenu><guisubmenu>Vue</guisubmenu><guimenuitem>Sommaire</guimenuitem></menuchoice>

source: This action is the same as <menuchoice><guimenu>Tools</guimenu><guisubmenu>Database Processing</guisubmenu><guimenuitem>Check and Repair</guimenuitem></menuchoice>.
fr: Cette action est identique à <menuchoice><guimenu>Outils</guimenu><guisubmenu>Traitement de la Base de données</guisubmenu><guimenuitem>contrôle et réparation</guimenuitem></menuchoice>.

source: This action allows producing reports from the command line. As reports generally have many options of their own, this action should be followed by the report option string. The string is given using the <command>-p <replaceable>option_string</replaceable></command> or <command>--options=<replaceable>option_string</replaceable></command> option.
fr: Cette action laisse produire des rapports à partir de la ligne de commande. Car les rapports ont généralement beaucoup d'options propres, cette action devrait être suivie de la chaîne d'option du rapport. La chaîne est donnée en utilisant <command>-p <replaceable>option_string</replaceable></command> ou <command>--options=<replaceable>option_string</replaceable></command>

source: The report option string should satisfy the following conditions:
fr: La chaîne d'option de rapport devrait satisfaire les conditions suivantes:

source: It must not contain any spaces. If some arguments need to include spaces, the string should be enclosed with quotation marks.
fr: Elle ne doit contenir aucun espaces. Si quelques arguments doivent inclure les espaces, la chaîne devrait être enfermée avec des guillemets.

source: Within a pair, option name and value must be separated by the equal sign.
fr: La chaîne d'option doit énumérer des paires de noms et de valeurs séparées par le signe égal.

source: Different pairs must be separated by commas.
fr: Différentes paires doivent être séparées par des virgules.

source: Most of the report options are specific for every report. However, there some common options.
fr: La plupart des options de rapport sont spécifiques pour chaque rapport. Cependant, il y a quelques options communes.
