Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: The surest way to see it happen is to get it done by yourself. Since GRAMPS is free/open source, nobody prevents you from taking all of the code and continuing its development in whatever direction you see fit. In doing so, you may consider giving your new project another name to avoid confusion with the continuing GRAMPS development. If you would like the GRAMPS project to provide advice, expertise, filters, etc., we will gladly cooperate with your new project, to ensure compatibility or import/export options to your new format of a project.
fr: Le meilleur moyen que cela se fasse est de le faire vous-même. Comme GRAMPS est libre et open-source, personne ne vous interdit de prendre tout le code et de continuer le développement dans la direction qui vous convient. Vous devrez donner un autre nom à votre projet pour éviter les confusions avec la suite du development de GRAMPS. Si vous voulez que le projet GRAMPS vous fournisse des avis, de l'expertise, des outils ou n'importe quoi, nous serons heureux de coopérer avec votre projet, pour assurer la compatibilité ou bien des opérations de lecture-écriture de et vers le format de données de votre projet.

source: If, however, you would like the GRAMPS project to to adopt your strategy, you would need to convince GRAMPS developers that your strategy is good for GRAMPS and superior to the present development strategy.
fr: Cependant, si vous souhaitez que le projet GRAMPS suive votre stratégie, vous devrez convaincre les développeurs de GRAMPS que votre stratégie est bonne pour et meilleure que celle prévue.

source: Keybindings reference
fr: Raccourcis clavier

source: Most of the standard menu items define equivalent keybindings. These are apparent because they are displayed on the right of the menu item. However, some keybindings are not associated with any items in the menu.
fr: La plupart des commandes du menu ont un équivalent au clavier.

source: This appendix contains the list of keybindings that are not displayed in menus of GRAMPS.
fr: Cette annexe décrit les commandes clavier qui ne sont pas affichées dans les menus de GRAMPS.

source: List Views
fr: Vue Individuelle

source: The following bindings are available in all list views: People View, Sources View, Places View, and Media View.
fr: Les commandes suivantes sont disponibles dans la Vue des Individus, des Sources, des Lieux, des Médias.

source: Key
fr: Clé

source: Function
fr: Fonction

source: Enter
fr: Entrée

source: Invoke <guilabel>Edit Person</guilabel> dialog with the selected person.
fr: Ouvre le dialogue <guilabel>Edition de l'individus</guilabel> sur la personne sélectionnée

source: The bindings available in the Family View depend on where the focus is. The following tables list the bindings for all focus targets.
fr: Les commandes disponibles dans la Vue Famille dépendent de l'élément actif. Le tableau suivante liste les commandes pour tous les types d'éléments.

source: Focus on the Active Person
fr: Personne active sélectionnée

source: Invoke <guilabel>Edit Person</guilabel> dialog with the active person.
fr: Ouvre le dialogue <guilabel>Edition de l'individus</guilabel> sur la personne sélectionnée

source: <keycap>Ctrl</keycap>+<keycap>Down</keycap> or <keycap>Ctrl</keycap>+<keycap>Right</keycap>
fr: <keycap>Ctrl</keycap>+<keycap>Bas</keycap> or <keycap>Ctrl</keycap>+<keycap>Droite</keycap>

source: Swap the Active Person and the selected spouse. Use <keycap>Ctrl</keycap>+<keycap>Down</keycap> in standard Family View and <keycap>Ctrl</keycap>+<keycap>Right</keycap> in alternative Family View.
fr: Echange la personne active et son époux(se) sélectionné(e). Utilisez <keycap>Ctrl</keycap>+<keycap>Bas</keycap> dans la Vue Famille standard et <keycap>Ctrl</keycap>+<keycap>Droite</keycap> à droite dans la vue alternative Famille.

source: Focus on the Spouse box
fr: Boîte de l'époux(se) activée

source: Edit relationship between the Active Person and the selected spouse.
fr: Modifie la relation entre la personne active et l'époux(se) sélectionné(e).

source: <keycap>Shift</keycap>+<keycap>Enter</keycap>
fr: <keycap>Shift</keycap>+<keycap>Entrée</keycap>

source: Edit the personal information for the selected spouse.
fr: Modifie les informations de l'époux(se) sélectionné(e).

source: Add a person from the database to the spouse list.
fr: Ajoute une personne existante à la liste des époux(ses).

source: Add a new person to the database and to the spouse list.
fr: Ajoute une nouvelle personne à la liste des époux(ses).

source: Delete
fr: Suppr

source: Delete the selected spouse from the spouse list. The spouse is not deleted from the database.
fr: Enlève l'époux(se) sélectionné(e) de la liste des époux(ses). L'époux(se) enlevée n'est pas supprimé(e) de la base de données.

source: <keycap>Ctrl</keycap>+<keycap>Up</keycap> or <keycap>Ctrl</keycap>+<keycap>Left</keycap>
fr: <keycap>Ctrl</keycap>+<keycap>Haut</keycap> ou <keycap>Ctrl</keycap>+<keycap>Gauche</keycap>

source: Swap the selected spouse and the Active Person. Use <keycap>Ctrl</keycap>+<keycap>Up</keycap> in standard Family View and <keycap>Ctrl</keycap>+<keycap>Left</keycap> in alternative Family View.
fr: Swap Echange l'époux(se) sélectionné(e) et la personne active. Utilisez <keycap>Ctrl</keycap>+<keycap>Haut</keycap> dans la vue Famille standard et <keycap>Ctrl</keycap>+<keycap>Gauche</keycap> dans l'autre vue. View.

source: Focus on the Parents box
fr: Zone des parents activée

source: Edit relationship between the parents and their child (either the Active Person or the selected spouse, depending which parents box the focus is in).
fr: Ouvre la relation entre les parents et leur enfant

source: Add a new set of parents from the database to the list.
fr: Ajoute une famille existante dans la liste (des parents de la mersonne active).

source: Add a new set of parents to the database and to the list.
fr: Ajoute une nouvelle famille dans la liste (des parents de la mersonne active).

source: Delete the selected parents from the list. The parents are not deleted from the database.
fr: Enlève la famille sélectionnée de la liste. Les parents ne sont pas supprimés de la base de données.

source: <keycap>Ctrl</keycap>+<keycap>Right</keycap> or <keycap>Ctrl</keycap>+<keycap>Down</keycap>
fr: <keycap>Ctrl</keycap>+<keycap>Droite</keycap> or <keycap>Ctrl</keycap>+<keycap>Bas</keycap>

source: Make the selected parents the active family. Use <keycap>Ctrl</keycap>+<keycap>Right</keycap> in standard Family View and <keycap>Ctrl</keycap>+<keycap>Down</keycap> in alternative Family View.
fr: Prend comme famille active les parents sélectionnés. Utilisez <keycap>Ctrl</keycap>+<keycap>Droite</keycap> dans la vue famille standard et <keycap>Ctrl</keycap>+<keycap>Bas</keycap> vers le bas dans l'autre vue.

source: Focus on the Children box
fr: Zone Enfants activée

source: Edit relationship between the child and his/her parents (the Active Person and the selected spouse).
fr: Ouvre la relation entre l'enfant et son parent (la personne active et l'époux(se) sélectionnée).

source: Edit the personal information for the selected child.
fr: Ouvre les informations personnelles de l'enfant sélectionné.

source: Add a new person from the database to the children list.
fr: Ajoute une personne de la base de données à la liste des enfants.

source: Add a new person to the database and to the children list.
fr: Ajoute une personne nouvelle à la liste des enfants.

source: Delete the selected child from the list. The child is not deleted from the database.
fr: Enlève l'enfant sélectionné de la liste. Cet enfant n'est pas supprimé de la base de données.

source: <keycap>Ctrl</keycap>+<keycap>Left</keycap> or <keycap>Ctrl</keycap>+<keycap>Up</keycap>
fr: <keycap>Ctrl</keycap>+<keycap>Gauche</keycap> or <keycap>Ctrl</keycap>+<keycap>Haut</keycap>

source: Make the selected child the Active Person. Use <keycap>Ctrl</keycap>+<keycap>Left</keycap> in standard Family View and <keycap>Ctrl</keycap>+<keycap>Up</keycap> in alternative Family View.
fr: Prend l'enfant sélectionné comme Personne Active. Utilisez <keycap>Ctrl</keycap>+<keycap>Gauche</keycap> dans la vue Famille standard et <keycap>Ctrl</keycap>+<keycap>Haut</keycap> dans l'autre vue. View.

source: Filter rules reference
fr: Les règles de filtrage

source: This appendix lists of all the filter rules currently defined in GRAMPS. Each of these rules is available for use when creating custom filters, see <xref linkend="tools-util-cfe"/>. The rules are listed by their categories.
fr: Cette annexe décrit les fonctions de filtrage actuellement définies dans GRAMPS (voir <xref linkend="tools-util-cfe"/>. Ces règles sont présentées ici par catégories.

source: General filters
fr: Filtres généraux

source: This category includes the following most general rules:
fr: Cette catégorie comprend les fonctions les plus générales :

source: Has complete record
fr: A un enregistrement complet

source: This rule matches all people whose records are marked as complete. Currently, the completeness of personal information is marked manually, in the <guilabel>Edit Person</guilabel> dialog.
fr: Cette règle accepte toutes les personnes dont l'enregistrement est marqué comme complet. Pour le moment, la complétude de l'enregistrement est marquée par le chercheur dans le dialogue Modifie Personne.

source: People with incomplete names
fr: Individus ayant des noms incomplets

source: This rule matches all people with either given name or family name missing.
fr: Cette règle sélectionne toutes les personnes ayant des noms incomplets.

source: Is bookmarked person
fr: Individus marqués

source: This rule matches all people who are on the bookmark list.
fr: Cette règle sélectionne toutes les personnes qui sont sur la liste de signet.

source: Has text matching substring of
fr: Noms qui contiennent une chaîne

source: This rule matches all people whose records contain specified substring. All textual records are searched. Optionally, the search can be made case sensitive, or a regular expression match.
fr: Cette fonction sélectionne toutes les personnes dont l'identité contient la chaîne donnée. Par exemple, Jacques Dupont, Jean Dupond seront sélectionnés par cette fonction, utilisée avec la valeur "pon". Des chaînes séparées peuvent être utilisées pour le prénom, le nom de famille, le suffixe et le titre. La fonction sélectionne un individu quand toutes les chaînes non vides font partie du nom d'une personne. Si vous voulez utiliser une seule valeur, laissez les autres vides.

source: Everyone
fr: Tout le monde

source: This rule matches any person in the database. As such it is not very useful on its own except for testing purposes. However, it may be useful in combinations with other rules.
fr: Cette fonction accepte toutes les personnes de la base de données. Elle n'est pas très utile seule sauf pour tester. Par contre, elle sert en combinaison avec d'autres fonctions.

source: People probably alive
fr: Individus probablement en vie

source: This rule matches all people whose records do not indicate their death and who are not unreasonably old, judging by their available birth data and today's date.
fr: Cette règle sélectionne toutes les personnes dont les dates n'indiquent pas leur mort et qui ne sont pas anormalement vieilles, jugeant à leurs données disponibles de naissance et aujourd'hui.

source: Has a name
fr: Individus dont le nom contient

source: This rule matches any person whose name matches the specified value in full or in part. For example, Marta Ericsdotter will be matched by the rule using the value "eric" for the family name.
fr: Cette règle sélectionne toute personne dont le nom contient la valeur indiquée, complètement ou en partie. Par exemple, Marta Ericsdotter sera trouvée par la règle sous-chaîne= "eric" pour le nom de famille.

source: Separate values can be used for Given name, Family name, Suffix, and the Title. The rule returns a match if, and only if, all non-empty values are (partially) matched by a person's name. To use just one value, leave the other values empty.
fr: Des valeurs séparées peuvent être employées pour le nom indiqué, le nom de famille, le suffixe, et le titre. La règle est efficace si et seulement si, toutes les valeurs non vides (partiellement) sont assorties par le nom d'une personne. Pour employer juste une valeur, laissez les autres valeurs vides.

source: Has the Id
fr: A l'identifiant

source: This rule matches any person with a specified GRAMPS ID. The rule returns a match only if the ID is matched exactly.
fr: Cette fonction sélectionne la personne ayant exactement l'identifiant GRAMPS donné.

source: You can either enter the ID into a text entry field, or select a person from the list by clicking <guibutton>Select...</guibutton> button. In the latter case, the ID will appear in the text field after the selection was made.
fr: Vous pouvez entrer l'identifiant dans un champ texte, ou bien sélectionner une personne dans la liste en cliquant le bouton <guibutton>Sélectionner...</guibutton>. Dans ce cas, l'identifiant apparaîtra dans le champ de saisie de texte après la sélection.

source: Is default person
fr: Est la personne de référence

source: This rule matches the default (home) person.
fr: Cette règle sélectionne la personne de référence.

source: People marked private
fr: Individus marqués comme privés

source: This rule matches people whose records are marked as private.
fr: Cette règle sélectionne les personnes dont les informations sont marquées comme privés.

source: Is a female
fr: Est une femme

source: This rule matches any female person.
fr: Cette fonction sélectionne les femmes.

source: People who have images
fr: Individus qui ont des images

source: This rule matches people with images in their galleries.
fr: Cette règle sélectionne les personnes avec des images dans leurs galeries.

source: People without a birth date
fr: Individus sans date de naissance

source: This rule matches people missing birth date.
fr: Cette règle sélectionne les personnes sans date de naissance.

source: Is a male
fr: Est un homme

source: This rule matches any male person.
fr: Ce filtre sélectionne les hommes.

source: Event filters
fr: Filtres d'événements

source: This category includes the following rules that match people based on their recorded events:
fr: Cette catégorie regroupe les fonctions qui utilisent les évènements des personnes :

source: Has the birth
fr: A la naissance

source: This rule matches people whose birth event matches specified values for Date, Place, and Description. The rule returns a match even if the person's birth event matches the value partially. The matching rules are case-insensitive. For example, anyone born in Sweden will be matched by the rule using the value "sw" for the Place.
fr: Cette fonction sélectionne les personnes dont la naissance correspond aux valeurs données pour Date, Lieu, et Description. La correspondance est faite même quand l'évènement n'est que partiellement identique.

source: The rule returns a match if, and only if, all non-empty values are (partially) matched by a person's birth. To use just one value, leave the other values empty.
fr: Les correspondances sont insensibles à la casse des caractères. Par exemple, toute personne née en France sera sélectionnée par la valeur "fr" pour le lieu. La règle sélectionne l'entrée si et seulement si toutes les valeurs non vides correspondent (partiellement) à la naissance de la personne. Si vous voulez sélectionner sur un seul champ, laissez les autres champs vides.

source: Has the death
fr: Au décès

source: This rule matches people whose death event matches specified values for Date, Place, and Description. The rule returns a match even if the person's death event matches the value partially. The matching rules are case-insensitive. For example, anyone who died in Sweden will be matched by the rule using the value "sw" for the Place.
fr: Cette fonction sélectionne les personnes dont le décès correspond aux valeurs données pour Date, Lieu, et Description. La correspondance est faite même quand l'évènement n'est que partiellement identique. Les correspondances sont insensibles à la casse des caractères. Par exemple, toute personne décédée en France sera sélectionnée par la valeur "fr" pour le lieu.

source: The rule returns a match if, and only if, all non-empty values are (partially) matched by a person's death. To use just one value, leave the other values empty.
fr: La règle sélectionne l'entrée si et seulement si toutes les valeurs non vides correspondent (partiellement) à la naissance de la personne. Si vous voulez sélectionner sur un seul champ, laissez les autres champs vides.

source: Has source of
fr: A la source

source: This rule matches people whose records refer to the specified source.
fr: Cette règle sélectionne les personnes dont les informations se rapportent à la source indiquée.

source: Has the personal event
fr: A l'évènement personnel

source: This rule matches people that have a personal event matching specified values for the Event type, Date, Place, and Description. The rule returns a match even if the person's event matches the value partially. The matching rules are case-insensitive. For example, anyone who graduated in Sweden will be matched by the rule using the Graduation event and the value "sw" for the Place.
fr: Cette fonction sélectionne les personnes dont un évènement personnel correspond aux valeurs données pour Date, Lieu, Type et Description. La correspondance est faite même quand l'évènement n'est que partiellement identique. Les correspondances sont insensibles à la casse des caractères. Par exemple, toute personne ayant obtenu un diplômee en France sera sélectionnée par la valeur "fr" pour le lieu.

source: The personal events should be selected from a pull-down menu. The rule returns a match if, and only if, all non-empty values are (partially) matched by the personal event. To use just one value, leave the other values empty.
fr: L'évènement personnel est sélectionné dans une liste déroulante. La règle sélectionne l'entrée si et seulement si toutes les valeurs non vides correspondent (partiellement) à un évènement de la personne. Si vous voulez sélectionner sur un seul champ, laissez les autres champs vides.

source: Has the family event
fr: A l'évènement familial

source: This rule matches people that have a family event matching specified values for the Event type, Date, Place, and Description. The rule returns a match even if the person's event matches the value partially. The matching rules are case-insensitive. For example, anyone who was married in Sweden will be matched by the rule using the Marriage event and the value "sw" for the Place.
fr: Cette fonction sélectionne les personnes dont un évènement familial correspond aux valeurs données pour Date, Lieu, Type et Description. La correspondance est faite même quand l'évènement n'est que partiellement identique. Les correspondances sont insensibles à la casse des caractères. Par exemple, toute personne s'étant mariée en France sera sélectionnée par la valeur Mariage pour l'évènement et "fr" pour le lieu.

source: The family events should be selected from a pull-down menu. The rule returns a match if, and only if, all non-empty values are (partially) matched by the personal event. To use just one value, leave the other values empty.
fr: L'évènement familial est sélectionné dans une liste déroulante. La règle sélectionne l'entrée si et seulement si toutes les valeurs non vides correspondent (partiellement) à un évènement de la famille de la personne. Si vous voulez sélectionner sur un seul champ, laissez les autres champs vides.

source: Witness
fr: Témoin

source: This rule matches people who are present as a witness in the event. If the personal or family event type is specified, only the events of this type will be searched.
fr: Cette règle sélectionne les personnes qui sont présentes comme témoin. Si et seulement si le type d'événement (Individuel ou Familial) est indiqué, les événements de ce type seront recherchés.

source: People with incomplete events
fr: Individus ayant des événements incomplets

source: This rule matches people missing date or place in any personal event.
fr: Cette règle recherche la date ou le lieu absent dans n'importe quel événement personnel.

source: Families with incomplete events
fr: Familles ayant des événements incomplets

source: This rule matches people missing date or place in any family event of any of their families.
fr: Cette règle recherche la date ou le lieu absent dans n'importe quel événement familial.

source: Family filters
fr: Filtres familiaux

source: This category includes the following rules that match people based on their family relationships:
fr: Cette catégorie comprend les règles suivantes qui sélectionnent les personnes d'après leurs relations familiales :

source: People with children
fr: Individus avec des enfants :

source: This rule matches people with children.
fr: Cette règle sélectionne les personnes avec des enfants.

source: People with multiple marriage records
fr: Individus avec mariages multiples

source: This rule matches people with more than one spouse.
fr: Cette règle sélectionne des personnes avec plus d'un conjoint.

source: People with no marriage records
fr: Individus sans mariage

source: This rule matches people with no spouses.
fr: Cette règle sélectionne des personnes sans conjoints.

source: People who were adopted
fr: Individus adoptés

source: This rule matches adopted people.
fr: Cette règle sélectionne les personnes adoptées.

source: Has the relationships
fr: A les relations

source: This rule matches people with a particular relationship. The relationship must match the type selected from the menu. Optionally, the number of relationships and the number of children can be specified.
fr: Cette règle sélectionne des personnes avec une relation particulière. Le nombre de relations et le nombre d'enfants peuvent être indiqués.

source: The rule returns a match if, and only if, all non-empty values are (partially) matched by a person's relationship. To use just one value, leave the other values empty.
fr: La règle est efficace si, et seulement si, toutes les valeurs non vides (partiellement) correspondent. Pour employer juste une valeur, laissez les autres valeurs vides.

source: Is spouse of filter match
fr: Est le conjoint résultant du filtrage

source: This rule matches people married to someone who is matched by the specified filter. The specified filter name should be selected from the menu.
fr: Cette règle sélectionne des personnes mariées à un individu associé à un filtre. Le nom du filtre doit être choisi parmi le menu.

source: Is a child of filter match
fr: Est un enfant résultant du filtrage

source: This rule matches people for whom either parent is matched by the specified filter. The specified filter name should be selected from the menu.
fr: Cette règle sélectionne les personnes pour qui l'un ou l'autre parent est associé à un filtre. Le nom du filtre doit être choisi parmi le menu.

source: Is a parent of filter match
fr: Est un parent résultant du filtrage

source: This rule matches people whose child is matched by the specified filter. The specified filter name should be selected from the menu.
fr: Cette règle sélectionne les personnes dont l'enfant est associé à un filtre. Le nom du filtre doit être choisi parmi le menu.

source: Is a sibling of filter match
fr: Est un enfant résultant du filtrage

source: This rule matches people whose sibling is matched by the specified filter. The specified filter name should be selected from the menu.
fr: Cette règle sélectionne les personnes dont l'enfant de mêmes parents est associé à un filtre. Le nom du filtre doit être choisi parmi le menu.

source: Ancestral filters
fr: Filtres ascendants
