Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: The top of the window shows the dialog title including the name of the person whose attribute is being edited. The central part of the window displays three notebook tabs containing different categories of available information. You can bring any tab to the top for viewing or editing by clicking on the appropriate tab heading. The bottom part has <guibutton>OK</guibutton> and <guibutton>Cancel</guibutton> buttons. Clicking the <guibutton>OK</guibutton> button at any time will apply all the changes made in all tabs and close the dialog window. Clicking the <guibutton>Cancel</guibutton> button at any time will close the window without applying any changes.
fr: Le haut de la fenêtre présente le titre du dialogue, comprenant le nom de la personne dont les attributs sont affichés. La partie principale de la fenêtre montre des onglets contenant différents types d'informations. Le bas de la fenêtre contient les boutons<guibutton>Valider</guibutton> et <guibutton>Annuler</guibutton>. Le bouton <guibutton>Valider</guibutton> permet d'écrire les modofications dans la base de données et ferme la fenêtre. Le bouton <guibutton>Annuler</guibutton> ferme la fenêtre sans modifier la base de données.

source: The tabs provide the following information categories of the attribute data:
fr: Les onglets donnent accès aux types d'informations suivants :

source: The <guilabel>General</guilabel> tab allows editing of the most general information about the attribute: name of the attribute and its value. The information can be typed in the appropriate text entry fields. The attribute name can also be selected from available choices (if any) listed in the <guilabel>Attribute </guilabel> drop-down menu. Check the <guilabel>Private record</guilabel> box to mark this attribute record as private. This will give you a chance to omit this attribute from being included in the reports, if you choose so among the report generation options.
fr: L'onglet <guilabel>Général</guilabel> permet la modification des caractéristiques les plus communes de l'attribut : le nom et la valeur. Toutes ces informations sont saisies dans des zones de texte. Le nom de l'attribut peut aussi être sélectionné dans le menu déroulant <guilabel>Attribut</guilabel>. Cochez la case <guilabel>Enregistrement Privé</guilabel> pour marquer cet attribut comme privé. Ceci sera utilisé dans les impressions, pour ne pas montrer les attributs privés si tel est votre choix lors de l'activation de l'édition.

source: The <guilabel>Sources</guilabel> tab displays information about sources relevant to this attribute and controls allowing its modification. The central part displays the list of all such sources references stored in the database. The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> allow you to correspondingly add, modify, and remove a source reference to this attribute. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when a source reference is selected from the list.
fr: L'onglet <guilabel>Sources</guilabel> affiche les sources d'information sur l'attribut et permet leur modification. La partie centrale de la fenêtre montre la liste des sources associées à l'attribut, conservées dans la base de données. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> vous permettent respectivement d'ajouter, modifier et supprimer une source pour l'attribut. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles qu'après avoir sélectionné une source dans la liste

source: The <guilabel>Note</guilabel> tab displays any notes concerning the attribute. To add a note or modify existing notes simply edit the text in the text entry field.
fr: L'onglet <guilabel>Note</guilabel> contient les notes concernant l'attribut. Si vous voulez ajouter ou modifier des notes, il vous suffit de modifier le contenu de la zone de texte.

source: Addresses are edited through the following <guilabel>Address Editor</guilabel> dialog:
fr: Les adresses sont modifiées en utilisant la fenêtre <guilabel>Editeur d'adresse</guilabel>:

source: Address Editor dialog
fr: Editeur d'adresse

source: Shows Address Editor dialog.
fr: La fenêtre d'édition d'adresse

source: The top of the window shows the dialog title including the name of the person whose address is being edited. The central part of the window displays three notebook tabs containing different categories of available information. You can bring any tab to the top for viewing or editing by clicking on the appropriate tab heading. The bottom part has <guibutton>OK</guibutton> and <guibutton>Cancel</guibutton> buttons. Clicking the <guibutton>OK</guibutton> button at any time will apply all the changes made in all tabs and close the dialog window. Clicking the <guibutton>Cancel</guibutton> button at any time will close the window without applying any changes.
fr: Le haut de la fenêtre contient le titre, incluant le nom de la personne dont l'adresse est en cours de modification. La partie médiane de la fenêtre contient des onglets pour différents types d'information. Le bas de la fenêtre contient les boutons <guibutton>Valider</guibutton> et <guibutton>Annuler</guibutton>. Le bouton <guibutton>Valider</guibutton> a pour effet d'appliquer toutes les modifications dans la base de données et de fermer la fenêtre. Le bouton <guibutton>Annuler</guibutton> ferme la fenêtre sans modifier la base de données.

source: The tabs provide the following information categories of the address data:
fr: Les onglets donnent accès aux types d'informations suivants :

source: The <guilabel>General</guilabel> tab allows editing of the most general information about the address: date, street address, city or county, state or province, country, the postal code, and the phone number. The information can be typed in the appropriate text entry fields. Check the <guilabel>Private record</guilabel> box to mark this address record as private. This will give you a chance to omit this address from being included in reports, if you choose so among the report generation options.
fr: L'onglet <guilabel>Général</guilabel> permet la modification des informations générales de l'adresse. Ceci comprend les zones de saisie suivantes : date, rue et numéro, ville ou département, état ou province, pays, code postal et numéro de téléphone. Ces données sont saisies dans des zones de texte libre. Cochez la case <guilabel>Enregistrement Privé</guilabel> pour marquer cette adresse comme privée. Ceci sera utilisé dans les rapports, pour ne pas montrer les adresses privées si tel est votre choix lors de l'activation de l'édition.

source: The <guilabel>Sources</guilabel> tab displays information about sources relevant to this address and controls allowing its modification. The central part displays the list of all such sources references stored in the database. The buttons <guibutton>+</guibutton>, <guibutton>Edit</guibutton>, and <guibutton>-</guibutton> allow you to correspondingly add, modify, and remove a source reference to this address. Note that the <guibutton>Edit</guibutton> and <guibutton>-</guibutton> buttons become available only when a source reference is selected from the list.
fr: L'onglet <guilabel>Sources</guilabel> affiche les sources d'information sur l'adresse et permet leur modification. La partie centrale de la fenêtre montre la liste des sources associées à l'adresse, conservées dans la base de données. La partie du haut montre le détail de la source sélectionnée s'il y a lieu. Les boutons <guibutton>+</guibutton>, <guibutton>Editer</guibutton> et <guibutton>-</guibutton> vous permettent respectivement d'ajouter, modifier et supprimer une source pour l'adresse. Notez que les boutons <guibutton>Editer</guibutton> et <guibutton>-</guibutton> ne sont disponibles qu'après avoir sélectionné une source dans la liste

source: The <guilabel>Note</guilabel> tab displays any notes concerning the address. To add a note or modify existing notes simply edit the text in the text entry field.
fr: L'onglet <guilabel>Note</guilabel> affiche les notes sur l'adresse et permet leur modification. Les notes sont un simple texte libre associé à la personne. Pour modifier les notes, simplement modifiez le texte dans la zone de saisie de l'onglet.

source: Witnesses are edited through the following <guilabel>Witness Editor</guilabel> dialog:
fr: Les données sur les témoins peuvent être modifiées par le dialogue <guilabel>Editeur de témoins</guilabel>:

source: Witness Editor dialog
fr: Editeur de témoins

source: Shows Witness Editor dialog.
fr: La fenêtre d'édition des témoins

source: The top of the window shows the dialog title. The central part of the window displays information about the witness. The bottom part has <guibutton>OK</guibutton> and <guibutton>Cancel</guibutton> buttons. Clicking the <guibutton>OK</guibutton> button at any time will apply all the changes made and close the dialog window. Clicking the <guibutton>Cancel</guibutton> button at any time will close the window without applying any changes.
fr: Le haut de la fenêtre contient le titre. La partie médiane de la fenêtre contient les données du témoin. Le bas de la fenêtre contient les boutons <guibutton>Valider</guibutton> et <guibutton>Annuler</guibutton>. Le bouton <guibutton>Valider</guibutton>a pour effet d'appliquer toutes les modifications dans la base de données et de fermer la fenêtre. Le bouton <guibutton>Annuler</guibutton> ferme la fenêtre sans modifier la base de données.

source: The witness name can be entered in two ways, depending upon whether the witness is a person already stored in the database or not (unrelated person).
fr: Le nom du témoin peut être saisi de deux façons différentes, selon que le témoin est connu de la base de données ou pas (cas d'une personne sans relation familiale avec les individus de la base).

source: If the person you would like to add as a witness is in fact a member of the database, it is better to use the first method below.
fr: Si la personne désignée comme témoin fait partie de la base de donnée, il est préférable d'utiliser la première méthode.

source: Person from the database
fr: Personne de la base de données

source: If the person's data are stored in a database, check <guilabel>Person is in the database</guilabel> box. Then click the <guibutton>Select</guibutton> button to invoke <guilabel>Select Person</guilabel> dialog. Choose the person from that dialog and click the <guibutton>OK</guibutton> button. The <guilabel>Person</guilabel> text field will display the name of the person you selected.
fr: Si la personne témoin est déjà dans la base de données, cochez la case Individu dans la Base de Données. Vous pouvez alors utiliser le bouton <guibutton>Choisir</guibutton> pour appeler le dialogue Choix d'une Personne. Sélectionnez la personne dans ce dialogue et fermez par le bouton <guibutton>Valider</guibutton>. La zone de texte Personne contiendra alors le nom de la personne que vous avez sélectionnée.

source: Even though the person's name is displayed in the <guilabel>Person</guilabel> field, it is not available for direct editing.
fr: Le nom de l'<guilabel>individu</guilabel> n'est alors pas modifiable directement dans la zone de texte Personne.

source: Unrelated person
fr: Personne sans relation familiale dans la base de données

source: If the person is not in the database, make sure that <guilabel>Person is in the database</guilabel> box is unchecked. Then enter the name or any description of a person into the <guilabel>Person</guilabel> text entry field. This information is stored as entered, and this is the only place it is stored. In other words, there is no reference to that person in the entire database except for this witness reference. If the person is in fact a member of the database, it is advised to use the former method.
fr: Si le témoin n'est pas dans la base de données, vérifiez que la case <guilabel>Individu dans la Base de Données</guilabel> n'est pas cochée. Saisissez alors le nom ou la désignation de la personne dans la zone de texte <guilabel>Personne</guilabel>. Cette information est conservée en l'état. Autrement dit, aucune autre données dans la base ne décrit ce témoin. Si la personne est en réalité dans la base de données, il est préférable d'utiliser la méthode précédente.

source: The <guilabel>Comment</guilabel> text area allows you to enter any comments concerning the witness. To add a comment or to modify existing comments simply edit the text in the text area.
fr: Le champ <guilabel>Commentaire</guilabel> vous permet de conserver tout commentaire concernant le témoignage. Si vous voulez une quelconque donnée sur ce témoignage, il vous suffit de saisir votre texte dans la zone de saisie.

source: Merging records
fr: Fusionner des enregistrements

source: Sometime several records in the database turn out to be describing the same object: same person, same place, or same source. It could happen either when the data is entered twice by mistake, or when new information reveals that the two entries refer to the same person. It can also happen after importing GEDCOM obtained from a relative, whose database overlaps with your existing data.
fr: Il arrive que des enregistrements dans la base de données ne soient qu'un seul.

source: Whenever you detect duplicate records, merging them a useful way of correcting the situation.
fr: Quand cela se produit, la fusion est le moyen de corriger ces données.

source: To make a merge, exactly two records have to be selected in the appropriate view (People View, Sources View, or Places View). This is accomplished by selecting one entry and then selecting another person while holding down <keycap>Ctrl</keycap> key.
fr: Pour exécuter une fusion, sélectionnez la Vue (Individus, Lieux, Sources). Ceci se fait en sélectionnant la première entrée, puis la seconde en maintenant enfoncée la touche <keycap>Ctrl</keycap>.

source: Merge People
fr: Fusion des Individus

source: There are two ways of merging personal records: <guilabel>Compare and Merge</guilabel> and <guilabel>Fast Merge</guilabel>, both available from the <guimenu>Edit</guimenu> menu.
fr: Il y a deux moyens de fusionner des individus : <guilabel>Comparaison et Fusion</guilabel> et <guilabel>Fusion Rapide</guilabel>, tous les deux disponibles depuis le menu <guimenu>Edition</guimenu>.

source: Merging people does not discard any information with either method. The decisions you make during the merge only affect which data will become primary and which will become secondary for the resulting merged record.
fr: Vous pouvez conserver des données de chacune des personnes pour la description de la nouvelle personne résultant de la fusion. Les données non prises peuvent être gardées en réserve (alternatives) si vous le voulez.

source: Compare and Merge
fr: Comparaison et Fusion

source: When exactly two people are selected, choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Compare and Merge...</guimenuitem></menuchoice> to invoke <guilabel>Compare People</guilabel> dialog.
fr: Quand les deux individus sont sélectionnés, choisissez <menuchoice><guimenu>Edition</guimenu><guimenuitem>Comparaison et Fusion...</guimenuitem></menuchoice> pour appeler <guilabel>la fenêtre de Comparaison des individus</guilabel>

source: Compare People dialog
fr: Comparaison des individus

source: Shows Compare People dialog.
fr: La fenêtre de Comparaison des individus

source: The dialog allows you to make a decision on whether or not the selected records should be merged. If you decide that the records should not be merged, despite similar names, you may click <guibutton>Cancel</guibutton> to close the dialog without making any changes. If you decide to proceed with merging, select the appropriate <guilabel>Select</guilabel> radio button to specify the record to be used as the source of primary data, then click <guibutton>Merge and close</guibutton>.
fr: La fenêtre vous permet de garder ou non les données de chaques individus. Si vous ne voulez pas fusionner les données, choisissez le bouton <guibutton>Annuler</guibutton>, pour fermer la fenêtre sans fusion. Sinon, <guilabel>Sélectionner</guilabel> les boutons "radio" pour chaque enregistrement à conserver, puis cliquer sur <guibutton>Valider</guibutton>.

source: The data from the other record will be kept as alternate data. Specifically, all names from the other record will become alternate names of the merged record. Similarly, parents, spouses, and children of the other record will become alternate parents, spouses, and children of the merged record, and so on.
fr: Les données non prises peuvent être gardées en réserve si vous le voulez. Les parents, conjoints, et enfants de l'autre enregistrement peuvent devenir alternatifs.

source: Fast Merge
fr: Fusion Rapide

source: When exactly two people are selected, choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Fast Merge</guimenuitem></menuchoice> to invoke <guilabel>Merge People</guilabel> dialog.
fr: Quand deux enregistrements sont sélectionnées, choisissez <menuchoice><guimenu>Edition</guimenu><guimenuitem>Fusion Rapide</guimenuitem></menuchoice> pour appeler la fenêtre de <guilabel>Fusion des individus</guilabel>.

source: Merge People dialog
fr: Fusionner des individus

source: Shows Merge People dialog.
fr: La fenêtre Fusion des individus

source: The dialog allows you to quickly merge two records, specifying the record to be used as the source of primary data. The data from the other record will be kept as alternate data. Specifically, all names from the other record will become alternate names of the merged record. Similarly, parents, spouses, and children of the other record will become alternate parents, spouses, and children of the merged record, and so on.
fr: Vous pouvez conserver des données de chacune des personnes pour la description de la nouvelle personne résultant de la fusion. Les données non prises peuvent être gardées en réserve (alternatives) si vous le voulez.

source: If you are not certain whether or not you need to merge the records, or which record to specify as the source of primary data, use <guilabel>Compare and Merge</guilabel> method described above..
fr: Si vous n'êtes pas sûr des données à fusionner, utilisez <guilabel>Comparaison et Fusion</guilabel> voir ci-dessus ...

source: Merge Sources
fr: Fusionner des sources

source: When exactly two sources are selected, choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Compare and Merge...</guimenuitem></menuchoice> to invoke <guilabel>Merge Sources</guilabel> dialog.
fr: Quand deux sources sont sélectionnées, choisissez <menuchoice><guimenu>Edition</guimenu><guimenuitem>Comparaison et Fusion...</guimenuitem></menuchoice> pour appeler la fenêtre de <guilabel>Fusion des sources</guilabel>.

source: Merge Sources dialog
fr: Fusion des sources

source: Shows Merge Sources dialog.
fr: La fenêtre Fusion des sources

source: The dialog allows you to make a decision on whether or not the selected records should be merged. If you decide that the records should not be merged, despite similar titles, you may click <guibutton>Cancel</guibutton> to close the dialog without making any changes. If you decide to proceed with merging, choose the appropriate radio button to specify the title, author, abbreviated title, publication information, and the ID to be used for the merged record, then click <guibutton>OK</guibutton>.
fr: La fenêtre vous permet de garder ou non les données de chaques sources. Si vous ne voulez pas fusionner les données, choisissez le bouton <guibutton>Annuler</guibutton>, pour fermer la fenêtre sans fusion. Sinon, <guilabel>Sélectionner</guilabel> les boutons "radio" pour chaque enregistrement à conserver, puis cliquer sur <guibutton>Valider</guibutton>.

source: Merge Places
fr: Fusionner des Lieux

source: When exactly two places are selected, choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Compare and Merge...</guimenuitem></menuchoice> to invoke <guilabel>Select title</guilabel> dialog.
fr: Quand deux lieux sont sélectionnées, choisissez <menuchoice><guimenu>Edition</guimenu><guimenuitem>Comparaison et Fusion...</guimenuitem></menuchoice> pour appeler la fenêtre de <guilabel>Choix du titre </guilabel>

source: Merge Places dialog
fr: Fusionner des lieux

source: Shows Select title dialog.
fr: La fenêtre de sélection du titre

source: The dialog allows you to make a decision on whether or not the selected records should be merged. If you decide that the records should not be merged, despite similar titles, you may click <guibutton>Cancel</guibutton> to close the dialog without making any changes. If you decide to proceed with merging, choose the appropriate radio button to specify the title of the merged record, or specify <guilabel>Other</guilabel> and enter new text, then click <guibutton>OK</guibutton>.
fr: La fenêtre vous permet de garder ou non les données de chaques sources. Si vous ne voulez pas fusionner les données, choisissez le bouton <guibutton>Annuler</guibutton>, pour fermer la fenêtre sans fusion. Sinon, <guilabel>Sélectionner</guilabel> les boutons "radio" pour chaque enregistrement à conserver, puis cliquer sur <guibutton>Valider</guibutton>.

source: As long as any database is open, GRAMPS is focused on a single person usually referred to as an Active person. This allows you to view or modify the data concerning this person, his or her immediate family, etc. Navigating in the database (i.e. moving from person to person) is in fact nothing else but changing the Active person. This section describes many alternative ways to navigate through the database using both the complex and the convenient interfaces GRAMPS provides. All these ways eventually accomplish the same thing, but some are more convenient than others, depending what you are doing in GRAMPS at the moment.
fr: Tant qu'une base de données est ouverte, GRAMPS reste centré sur une personne désignée comme la personne active. Vous pouvez modifier les données de cette personne et de sa famille proche. La navigation dans la base de données consiste en fait à changer de personne active. Cette section décrit tous les moyens pour parcourir la base de données en utilisant l'interface utilisateur riche et pratique de GRAMPS. Toutes les méthodes produisent finalement le même résultat mais le choix du meilleur outil à utiliser dépend de ce que vous faites.

source: Using the People View
fr: Utilisation de la vue des individus

source: The most intuitive way to select an active person is to use the People View (see <xref linkend="people-view"/>). When in the People View, just select the name of the desired person from the list by clicking that list entry. The person you have selected becomes active. The statusbar updates to reflect the change of the active person.
fr: La façon la plus intuitive de sélectionner la personne active est d'utiliser la <xref linkend="people-view"/>. Quand vous êtes dans cette vue, sélectionnez la personne voulue en cliquant sur la ligne qui la désigne. La personne devient alors active et la barre de statut est mise à jour avec son identification.

source: Using the Family View
fr: Utilisation de la vue des familles

source: When in the Family View (see <xref linkend="family-view"/>), you can easily navigate between the members of the displayed family as follows:
fr: Quand vous êtes dans la <xref linkend="family-view"/>,vous pouvez facilement choisir entre les membres de la famille affichée comme suit :
