Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: To import data, select <menuchoice><guimenu>File</guimenu><guisubmenu>Import</guisubmenu></menuchoice>. The <guilabel>Import database</guilabel> dialog will open, asking you to specify the file you wish to import.
fr: Pour importer des données sélectionnez <menuchoice><guimenu>Fichier</guimenu><guisubmenu>Importer</guisubmenu></menuchoice>. Le dialogue d'<guilabel>importation de la base de données</guilabel> s'ouvrira, vous demandant quel fichier vous voulez importer.

source: Data loss with some formats
fr: La perte de données avec certains formats

source: It is important to note that the importing process is not perfect for GEDCOM and GeneWeb databases. There is a chance that some of the data in these databases will not be imported into GRAMPS.
fr: Il est important de noter que le processus d'importation n'est pas parfait pour les bases de données GEDCOM et GeneWeb. Malheureusement, il est possible que certaines données ne soient pas importées dans GRAMPS.

source: The GRAMPS database (grdb), GRAMPS XML, and GRAMPS package are all native GRAMPS formats. There is no risk of information loss when import or exporting to these formats.
fr: base de données GRAMPS (grdb), GRAMPS XML, et le paquet GRAMPS sont tous des formats natis de GRAMPS. Ainsi, on ne perd pas d'information en les utilisant.

source: GRAMPS database (grdb)
fr: Base de données GRAMPS (grdb)

source: The native GRAMPS database format is a specific form of Berkeley database (BSDDB) with a special structure of data tables. This format is binary and architecture-dependent. It is very quick and efficient, but not generally portable across computers with different binary architecture (e.g. i386 vs alpha).
fr: Le format par défaut de GRAMPS est une forme spécifique de la base de données de Berkeley (BSDDB) avec la structure spéciale des tables de données. Ce format est binaire et architecture-dépendant. Il est très rapide et efficace, mais pas généralement portatif à travers des ordinateurs avec l'architecture binaire différente (par exemple i386 contre l'alpha).

source: The GRAMPS XML file was the default format for older versions of GRAMPS. Unlike the grdb format, it is architecture independent and human-readable. The database may also have references to non-local (external) media objects, therefore it is not guaranteed to be completely portable. The GRAMPS XML database is created by saving ( <menuchoice><guimenu>File</guimenu><guimenuitem>Save As...</guimenuitem></menuchoice> ) or exporting ( <menuchoice><guimenu>File</guimenu><guimenuitem>Export...</guimenuitem></menuchoice> ) data in that format
fr: Le dossier de GRAMPS XML était le format de défaut pour la version stable précédente de GRAMPS. À la différence du format de grdb, c'est architecture indépendante et lisible pour l'homme. La base de données peut également avoir des références aux objets (externes) non-local de médias, donc on ne le garantit pas d'être complètement portatif. La base de données de GRAMPS XML est créée en enregistrant (<menuchoice><guimenu>Fichier</guimenu><guimenuitem>Enregistrer sous...</guimenuitem></menuchoice>) ou par l'exportation (<menuchoice><guimenu>Fichier</guimenu><guimenuitem>Exporter...</guimenuitem></menuchoice> les données dans ce format).

source: The GRAMPS package is a compressed archive containing the GRAMPS XML file and all media objects (images, sound files, etc.) to which the database refers. Because it contains all the media objects, this format is completely portable. The GRAMPS package is created by exporting ( <menuchoice><guimenu>File</guimenu><guimenuitem>Export...</guimenuitem></menuchoice> ) data in that format.
fr: Le paquet contient des archives comprimées avec le dossier de GRAMPS XML et tous les médias object (des images, des dossiers sains, etc...) ,toute les références de la base. Le paquet de GRAMPS est créé par l'exportation (<menuchoice><guimenu>Fichier</guimenu><guimenuitem> Exporter...</guimenuitem></menuchoice> les données dans ce format).

source: If you import information from another GRAMPS database or GRAMPS XML database, you will see the progress of the operation in the progress bar of GRAMPS' main window.
fr: Pour importer des informations d'une base de données GRAMPS ou GRAMPS XML, vous verrez une barre de progression dans la fenêtre principale de GRAMPS.

source: If you import a GEDCOM database, you will see the import dialog shown in <xref linkend="gedcom-import-fig"/>. The information in the dialog is updated as the import progresses.
fr: Pendant l'importation du GEDCOM, GRAMPS affichera cette boîte de dialogue avec un résumé des informations <xref linkend="gedcom-import-fig"/> Ces informations sont affichées en temps réel.

source: GEDCOM Import
fr: Importation de GEDCOM

source: Shows GEDCOM Import Window.
fr: Boîte de dialogue lors de l'importation d'un GEDCOM

source: If a media file is not found during import, you'll be prompted to take one of the actions indicated in <xref linkend="missing-media-im"/>.
fr: Si un média n'est pas trouvé pendant l'import, ce dialogue (<xref linkend="missing-media-im"/>) vous demandera quoi faire :

source: Missing Media dialog
fr: Dialogue d'objet multimédia absent

source: Shows Missing Media dialog.
fr: Boîte de dialogue d'objet multimédia absent

source: If you don't have the missing file and have no possibility of replacing it, click the <guibutton>Remove Object</guibutton> button. This will remove the object that corresponds to the missing file as well as all the references in the database to that object.
fr: Si vous voulez supprimer l'objet qui utilise le fichier absent ainsi que toutes les références qui y sont faites, choisissez le bouton <guibutton>Supprime Objet</guibutton>. Ceci modifiera la base de données pour qu'elle soit dans un état cohérent mais toutes les références au fichier absent auront été supprimées. Faites ce choix si le fichier est perdu à jamais et si vous n'avez aucune possibilité de le retrouver.

source: If you're not sure where the missing file is, but think you still have it or may be able to find it, click the <guibutton>Keep Reference</guibutton> button. If and when you find the file, you can simply copy it into your database directory and have access to it through GRAMPS.
fr: Si vous voulez conserver les références à l'objet qui utilise le fichier manquant, faites le choix <guibutton>Conserver Référence</guibutton>. Ceci conservera les données comme elles sont, c'est à dire dans un état incohérent. Vous pourrez donner le fichier plus tard et vous aurez alors à le copies dans le répertoire de la base de données. Faites ce choix si le remplacement est possible mais pas tout de suite.

source: If you can supply the missing file during the import operation, click the <guibutton>Select File</guibutton> button. This will copy the file you select in place of the missing file. No references will be altered in the database.
fr: Si vous voulez fournir le fichier manquant pendant le chargement, faites le choix <guibutton>Choisir Fichier</guibutton>. Ceci copiera le fichier que vous sélectionnerez à la place du fichier absent. Rien ne sera changé dans la base de données et elle sera dans un état cohérent. Ce choix se fait quand le fichier de remplacement est disponible tout de suite.

source: To automatically use the selection made in this dialog for all missing media files, check the <guilabel>Use this selection for all missing media files</guilabel> box. This will remember your choice and use it for all media files missing during this import, so that no further dialogs will be presented. Use this option if you anticipate many missing files and want to deal with all of them in the same manner.
fr: Si vous voulez conserver le choix fait dans ce dialogue pour tous les fichiers manquants, cochez la case <guilabel>Utiliser cette option pour toute absence de fichier media</guilabel>. Ceci enregistrera votre choix et l'utilisera pour tous les fichiers manquant lors de l'importation en évitant de réafficher le dialogue. Utilisez cette possibilité quand vous prévoyez que beaucoup de fichiers manqueront et que vous voulez les traiter tous de la même façon.

source: Exporting Data
fr: Exportation des Données

source: Exporting allows you to share any portion of your GRAMPS database with other researchers as well as to enable you to transfer your data to another computer. Currently, GRAMPS can export data to the following formats: GRAMPS database (grdb), GRAMPS XML, GEDCOM, GRAMPS package, Web Family Tree, and GeneWeb.
fr: L'export de données vous permet de partager une partie de votre base de données avec d'autres chercheurs en généalogie et aussi de rendre votre base de données transportable vers un autre ordinateur. GRAMPS peut actuellement exporter ses données aux formats : Base de données de GRAMPS (grdb), paquet de GRAMPS XML, de GEDCOM, de GRAMPS, arbre de famille d'enchaînement, et GeneWeb.

source: Export is saving a copy
fr: L'exportation sauve une copie

source: When you export, you are saving a copy of the currently opened database. Exporting creates another file with a copy of your data. Note that the database that remains opened in your GRAMPS window is NOT the file saved by your export. Additional editing of the currently opened database will not alter the copy produced by the export.
fr: L'exportation créera un autre fichier avec la copie de vos données. La base de données actuellement ouverte dans votre fenêtre de GRAMPS n'est pas le dossier sauvé par votre exportation. La future édition de la base de données actuellement ouverte ne changera pas la copie produite par l'exportation.

source: To export data, choose <menuchoice><guimenu>File</guimenu><guimenuitem>Export</guimenuitem></menuchoice>. This will bring up the <guilabel>Export</guilabel> assistant. Its pages will guide you through the format selection (see <xref linkend="export-druid-fig"/>), file selection, and format specific export options (see <xref linkend="gedcom-export-fig"/>). After a final confirmation page, the export will be performed according to the choices you have made. At any time, you can click the <guibutton>Back</guibutton> and revise any selection, and then go forward to redo the export.
fr: Pour exporter des données, choisissez <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Exporter</guimenuitem></menuchoice>. Ceci appelera le guide à l'exportation <guilabel>Export</guilabel>. Ses pages vous guideront par le choix de format (voir <xref linkend="export-druid-fig"/>) , le choix du fichier, et composez les options spécifiques d'exportation (voir <xref linkend="gedcom-export-fig"/>). Après une page finale de confirmation, l'exportation sera exécutée selon les choix que vous avez faits. À tout moment, vous pouvez cliquer et mettez à jour n'importe quel choix, et puis allez refaire l'exportation. Le bouton <guibutton>Retour</guibutton> permettant de revenir en arrière.

source: Export assistant: format selection
fr: Guide d'exportation: choix de format

source: Shows format selection page of an Export assistant
fr: Fenêtre d'exportation

source: Exporting into the GEDCOM format
fr: Exportation de GEDCOM

source: GRAMPS allows you to export a database into the common GEDCOM format. It provides options that allow you to fine tune your export (see <xref linkend="gedcom-export-fig"/>).
fr: Les options d'exportation de GEDCOM vous permettent de modifier votre exportation (voir<xref linkend="gedcom-export-fig"/>).

source: Encoding
fr: Encodage

source: Since different languages use different characters, it is important to tell a GEDCOM file what character set is used. The two formats traditionally accepted are ASCII and ANSEL. Since all ASCII characters are valid ANSEL characters, GRAMPS does not provide an option for ASCII.
fr: Puisque différents languages utilisent différents caractères, il est important d'indiquer au fichier GEDCOM quel caractère est utilisé. Les formats traditionnellement acceptés sont ASCII et ANSEL. Puisque tout les caractères ASCII sont valides ANSEL, GRAMPS ne propose pas d'option pour ASCII.

source: Because ANSEL is not commonly used, some genealogy programs will accept ANSI (more commonly know as ISO-8859-1) and Unicode character sets. Only select ANSI or Unicode if you know any program that attempts to read the GEDCOM file will understand these character sets.
fr: Parce que ANSEL n'est pas communément utilisé, plusieurs programmes de généalogie accepteront les caractères ANSI (souvent connu comme ISO-8859-1) et Unicode. Seulement séctionner ANSI ou Unicode si vous connaissez un programme capable de lire un fichier GEDCOM comprenant ce type de caractères.

source: Filter
fr: Filtre

source: The filter allows you to export a limited amount of data, based on the criteria you select.
fr: Le filtre vous permet de filtrer vos données, basé sur vos critères.

source: Target
fr: Cible

source: While GEDCOM is a standard, not every program implements it in the same way. This can lead to data loss. GRAMPS can reduce the data loss in some cases. You can tell GRAMPS what program is the target, and GRAMPS will customize the exported file for that program. If your program is not listed, choose the "GEDCOM 5.5 Standard".
fr: Alors que GEDCOM est un standard, aucun programme ne le gère de la même façon. Celà peut conduire à des pertes de données. GRAMPS peut limiter ces pertes dans certains cas. Vous pouvez spécifier à GRAMPS quel programme est la cible, et GRAMPS améliorera le fichier exporté pour ce programme. Si votre programme n'est pas listé, choisissez "GEDCOM 5.5 Standard".

source: Allows you to select a statement to describe your Copyright claim.
fr: Vous permet de sélectionner une déposition qui décrira votre droit à la copie

source: No not include records marked private
fr: Ne pas inclure les enregistrements marqués privé

source: Check this box to prevent private records from being included in the exported file.
fr: Pour prévenir de l'exportation d'enregistrements privés.

source: Restrict data on living people
fr: Restreindre les données sur les personnes vivantes

source: Check this box to limit the information exported for living people. This means that all information concerning their birth, death, addresses, significant events, etc., will be omitted in the exported GEDCOM file. If you choose this option, you will be given additional options to limit further the data on living people. For example, you can choose to substitute the word "Living" for the first name; you can exclude notes; and you can exclude sources for living people.
fr: Celà veut dire que toutes les informations sur leur naissance, adresses, autres événements, etc., seront absentes de l'exportation. Si vous choisissez cette option, vous aurez d'autres options pour limiter les données sur les personnes vivantes. Par exemple, vous pouvez substituer le mot "Living" par le nom; vous pouvez exclure les notes; et les sources des personnes vivantes.

source: Sometimes, it is not always obvious from the data if someone is actually alive. GRAMPS uses an advanced algorithm to try to determine if a person could still be alive. Remember, GRAMPS is making its best guess, and it may not always be able to guess correctly all the time. Please double check your data.
fr: Parfois, il n'est pas évident de savoir si une personne est toujours en vie. GRAMPS utilise un algorithme avancé pour le déterminer. Rappelez-vous, GRAMPS fait de son mieux pour deviner, et n'a peut être pas toujours raison. S'il vous plaît vérifiez deux fois vos données.

source: Reference images from path
fr: Référencer les images depuis un chemin (path)

source: Check this box to tell GRAMPS to use the specific path for your images when writing image references in GEDCOM.
fr: Demande à GRAMPS d'utiliser un chemin spécifique pour vos images quand une référence est écrite dans le GEDCOM.

source: This option allows specify where your image files are located. This is useful when you are transfering your GEDCOM file from one computer to another. It tells the program that is importing the data where your images are.
fr: Cette option vous permet de spécifier ou les images sont stockées. C'est utile quand vous transférez votre fichier GEDCOM d'un ordinateur à l'autre.

source: Export assistant: GEDCOM options
fr: Guide d'exportation: Options de GEDCOM

source: Shows GEDCOM options page of an Export druid
fr: Fenêtre d'exportation de GEDCOM

source: Export into GRAMPS formats
fr: Exportation dans GRAMPS

source: GRAMPS database (grdb) export
fr: Exportation de base de données de GRAMPS (grdb)

source: Exporting to the GRAMPS native format will simply make a copy of your data under another name. Exporting to this format can also be useful if you have directly opened an XML or GEDCOM file and would like to save it as the grdb file.
fr: L'exportation vers le format "défaut" tirera simplement une copie de vos données sous un autre nom. Il peut également être utile si vous avez directement ouvert le dossier XML ou GEDCOM et vous voudriez le sauver comme dossier de grdb.

source: GRAMPS XML database export
fr: Exportation de base de données de GRAMPS XML

source: Exporting into GRAMPS XML format will produce a database compatible with the previous versions of GRAMPS. As XML is a text-based human-readable format, you may also use it to take a look at your data.
fr: L'exportation dans le format de GRAMPS XML produira une base de données compatible avec les versions précédentes de GRAMPS. Car XML est un format lisible pour l'homme basé sur du texte, vous pouvez également l'employer pour jeter un coup d'oeil à vos données.

source: GRAMPS package export
fr: Exportation de paquet GRAMPS

source: Exporting to the GRAMPS package format will create a compressed file that contains the database and copies of all associated media files. This is useful if you want to move your database to another computer or to share it with someone.
fr: L'export en paquetage GRAMPS crée une archive tar compressée par gzip (appelée fréquemment tarball) contenant la base de données, les objets multimedia locaux et une copie des objets multimedia externes. Ce format est pratique pour déplacer vos données entre ordinateurs ou pour les partager avec quelqu'un autre sans dégrader les informations.

source: Export to CD
fr: Exportation vers le CD

source: Exporting to CD will prepare your database and copies of all media object files for recording onto a CD. To actually burn the CD, you will need to go to the GNOME <guilabel>burn:///</guilabel> location, which can be accessed by navigating through Nautilus: After exporting to CD, select <menuchoice><guimenu>Go</guimenu><guisubmenu>CD Creator</guisubmenu></menuchoice> in the Nautilus menu. Your database directory will show up. To burn it to the CD, click the CD icon on the Nautilus toolbar, or select <menuchoice><guimenu>File</guimenu><guisubmenu>Write to CD</guisubmenu></menuchoice> in the Nautilus menu.
fr: Exporter vers un CD-Rom prépare un répertoire avec toutes les données, prêt à être mis sur un CD. Ceci se fait par <guilabel>burn:///</guilabel> dans Nautilus. Après l'exportation, allez-y en sélectionnant <menuchoice><guimenu>Aller à</guimenu><guisubmenu>Créateur de CD</guisubmenu></menuchoice> dans le menu de Nautilus. Votre répertoire de base de données exportée apparaîtra alors. Pour l'enregistrer sur le CD, cliquer sur l'icône de CD dans la barre d'outils de Nautilus, ou sélectionnez <menuchoice><guimenu>Fichier</guimenu><guisubmenu>Ecrire un CD</guisubmenu></menuchoice> dans le menu de Nautilus.

source: If a media file is not found during export, you will see the same <guilabel>Missing Media</guilabel> dialog you encounter with GEDCOM export.
fr: Si un dossier de médias n'est pas trouvé pendant l'exportation, le dialogue suivant <guilabel>Média manquant</guilabel> apparaitra

source: Export into other formats
fr: Exportation dans d'autres formats

source: Exporting to Web Family Tree will create a text file that can be used by the Web Family Tree program. Export options include filter selection and the ability to limit data on living people to that of their family ties.
fr: L'export en format Web Family Tree, crée un fichier que le programme WFT peut lire. Utilisez le menu déroulant Filtre pour restreindre l'ensemble de données exportées selon votre choix. Cochez Restreindre les informations sur les personnes vivantes pour réduire les données portant sur des personnes vivantes.

source: Exporting to GeneWeb will save a copy of your data into a popular web genealogy format. To find out more about GeneWeb and its format, visit <ulink url="http://cristal.inria.fr/~ddr/GeneWeb/en/" type="http">http://cristal.inria.fr/~ddr/GeneWeb/en/</ulink>.
fr: L'exportation vers GeneWeb sauvera une copie de vos données dans un format populaire de genealogie. Pour découvrir GeneWeb et de son format, visitez <ulink url="http://cristal.inria.fr/~ddr/GeneWeb/en/" type="http">ce site.</ulink>

source: vCalendar and vCard
fr: vCalendar et vCard

source: Exporting to vCalendar or vCard will save information in a format used in many calendaring and addressbook applications, sometimes called PIM for Personal Information Manager.
fr: L'exportation vers vCalendar ou le vCard sauvera l'information dans un format utilisé dans les beaucoup d'applications d'addressbook, parfois appelées PIM pour le directeur personnel de l'information.

source: Entering and Editing Data: Quick Start Overview
fr: Édition des données en deux mots

source: This section is designed to give you the basic knowledge necessary to start putting your genealogical information into GRAMPS. It will explain how to enter people into the database and how to specify their family relationships. (A more detailed explanation will follow in the section entitled <xref linkend="gramps-edit-complete"/>.)
fr: Cette section traite principalement des éléments de menus et des boutons comme support de l'utilisation de GRAMPS.Vous pouvez modifier n'importe quelle information conservées dans la base de données. Ceci inclut les données liées à des individus et à leurs parents, les sources d'information, les lieux et les objets multimedia référencés. En bref, tout ce qui est conservé dans la base de données peut être modifié. En fait, ajouter de l'information c'est créer une donnée vide puis la modifier (<xref linkend="gramps-edit-complete"/>).

source: First, let's identify the types of information you can enter into your GRAMPS database. These include:
fr: Premièrement, indentifier les types d'information que vous pouvez saisir dans une base de données GRAMPS. Celà inclut:

source: Personal information about an individual (names, addresses, birth and death dates, etc.)
fr: Les informations personnelles d'un individu (noms, adresses, dates de naissance et de décès, etc.)

source: Information about an individual's relationships (marriages, divorces, civil unions, etc.)
fr: Les informations sur ses liens, types de relations (marriages, divorces, unions civil , etc.)

source: Information about an individual's parents and children
fr: Les informations sur ses parents et enfants

source: Sources that document your research
fr: Les sources qui illustrent vos recherches

source: Keybindings
fr: Raccourcis clavier

source: In addition to interacting with GRAMPS through menu items and buttons, you can use its extensive set of "keybindings." For more information, see <xref linkend="append-keybind"/>.
fr: En plus des menus, items et boutons, vous pouvez utiliser les "raccourcis clavier". Pour plus d'informations, voir <xref linkend="append-keybind"/>.

source: Now let's take a quick look at how you can enter and edit these various types of information.
fr: Maintenant jetons un rapide coup d'oeil sur comment entrer et éditer ces différents types d'informations.

source: To Add or Edit a Person
fr: Pour ajouter une personne
