Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: To add a person to the database, switch to the People View (<xref linkend="side-nofilt-fig"/>) and then click the <guibutton>Add</guibutton> on the toolbar. Enter any data you know about this person into the <guilabel>Edit Person</guilabel> dialog (see <xref linkend="edit-pers-fig"/> for details).
fr: Pour ajouter une personne, aller dans la vue des individus (<xref linkend="side-nofilt-fig"/>) puis cliquer sur <guibutton>Ajouter</guibutton> dans la barre d'outils. Saisissez tout ce que vous savez sur la personne dans le dialogue <guilabel>Edition de l'individu</guilabel> (voir <xref linkend="edit-pers-fig"/> pour plus de détails)

source: To edit information about a person already present in the database, select the person from the People View and click the <guibutton>Edit</guibutton> button on the toolbar.
fr: Si vous voulez modifier les données sur une personne déjà présente dans la base, sélectionnez la personne que vous voulez voir ou modifier puis cliquez sur le bouton <guibutton>Editer</guibutton> dans la barre d'outils.

source: Alternate ways of adding or editing a person
fr: Alternative pour l'ajout ou l'édition d'une personne

source: You can also use <guilabel>Add...</guilabel> and <guilabel>Edit...</guilabel> menu items available under <guimenu>Edit</guimenu>. Or you can right-click on the person and select <guilabel>Add...</guilabel> or <guilabel>Edit...</guilabel> from the context menu that pops up.
fr: Vous pouvez aussi utiliser l'élément de menu <guilabel>Ajouter...</guilabel> et <guilabel>Editer...</guilabel> disponible sous le menu <guimenu>Edition</guimenu>. Ou vous pouvez faire un clic-droit puis selectionner <guilabel>Ajouter...</guilabel> ou <guilabel>Editer...</guilabel> dans le menu contextuel.

source: To Specify a Relationship
fr: Pour spécifier une relation

source: To specify a relationship, select the person for whom the relationship applies. Switch to the Family View (<xref linkend="family-fig"/>) and you'll see this individual indicated as the "Active person".
fr: Pour spécifier une relation entre deux personnes, aller d'abord dans la vue par famille (<xref linkend="family-fig"/>).Cliquez ensuite dans l'un des deux boutons en haut à droite de la zone de l'époux/se. Celui du haut ajoute une nouvelle personne dans la base de données et la met en relation avec la personne active. Le second bouton prend une personne déjà déclarée et la met en relation avec la personne active.

source: Now a question: Does the person who will form the relationship with the Active person already exist in the database? If yes, click the middle button to the right of the Spouse box. You'll then be able to browse through the list of people in the database to select the one you want. If not, click the topmost button to the right of the Spouse box. This will allow you to add a new person to the database and to specify the relationship this person has to the Active person.
fr: Dans le second cas, sélectionnez le époux ou partenaire dans la liste et précisez la nature de leur relation par le menu du haut. Si nécessaire, vous pouvez ajouter une personne à la liste en cliquant le bouton <guibutton>+</guibutton>.GRAMPS filtrera la liste affichée selon le type de relation. Les relations "mariés", "non mariés", "relation inconnue" et "autre relation" afficheront seulement les personnes du sexe opposé à la personne active.La relation "partenaire" proposera seulement les personnes de même sexe que la personne active.

source: Filtering
fr: Filtrer

source: By default, GRAMPS filters the displayed list to show only those people who could theoretically have a relationship with the Active Person. That is, GRAMPS only shows those people whose birth dates and death dates fit within the lifetime of the Active Person. If you wish, you can add a person to the list by clicking the <guibutton>+</guibutton> button. To completely override the filter and display all people from the database, check the <guilabel>Show all</guilabel> box.
fr: Par defaut, GRAMPS filtre la liste d'affichage pour ne lister que ceux qui ont théoriquement une relation avec la personne active. C'est pourquoi, GRAMPS n'affiche que les personnes dont les dates de naissances et de décès correspondes. Si vous le souhaitez, vous pouvez ajouter une personne avec le bouton <guibutton>+</guibutton>. Pour annuler le filtre et afficher toute la base, cocher <guilabel>Tout afficher</guilabel>.

source: To edit an existing relationship, double-click in the Spouse box. If there is more than one relationship in the list, you can select the spouse or partner you want from the list before double-clicking.
fr: Pour modifier la relation déjà déclarée dans la base de données, placez le curseur de la souris sur la zone du <guilabel>Conjoint</guilabel> de la personne active puis double-cliquez. Si la personne active est en relation avec plus d'une personne, vous pouvez préciser laquelle en sélectionnant dans le menu contextuel disponible en cliquant avec le bouton droit de la souris dans la zone d'époux/se.

source: Alternate ways of editing relationships.
fr: Alternative pour éditer une relation

source: Most of the functions described above are also available in the context menu that pops up when you right-click.
fr: La plupart des fonctions décrites sont également dans le menu contextuel disponibles par un clic-droit.

source: To Specify Parents
fr: Pour préciser les parents

source: To specify the parents for a person, highlight that individual in the People View and then switch to the Family View (<xref linkend="family-fig"/>). Your selected person will be indicated as the Active person. Click the <guibutton>+</guibutton> button to the right of the <guilabel>Active person's parents</guilabel> list box. This will bring up the <guilabel>Choose Parents</guilabel> dialog. You will see three sections, one for father, one for mother, and one for specifying the relationships between everyone.
fr: Pour préciser les parents de la personne active, allez d'abord dans la vue Famille(<xref linkend="family-fig"/>). Puis cliquez sur le bouton <guibutton>+</guibutton> à droite de la liste des <guilabel>parents de la personne active</guilabel>. Il apparaitra 3 listes, une pour le père, une pour la mère et une pour la relation

source: If the father and mother of the Active person are already stored in your database, you can scroll through the lists and make your selections. If they are not in the database, you can click <guibutton>+</guibutton> to add them.
fr: Choisissez les parents dans chacune des listes et précisez leur relation avec la personne active. Vous pouvez aussi préciser leur relation entre eux. Si nécessaire, vous pouvez ajouter une personne à la liste par le bouton <guibutton>Ajouter...</guibutton>.

source: By default, GRAMPS will limit both lists to people who could possibly be the parents (judged by the date of birth) of the Active person. To override this, check the Show all box for each list.
fr: Par défaut, GRAMPS limitera la liste aux individus qui pourront être les parents (par les dates de naissance) de la personne active. Pour annuler le filtre et afficher toute la base, cocher Tout afficher.

source: To specify parents of the Active person's spouse, switch to Family View and then click the <guibutton>+</guibutton> button to the right of the Spouse's parents list box.
fr: Pour préciser les parents de l'époux/se de la personne active, allez dans la vue Famille puis cliquez sur le bouton <guibutton>+</guibutton> à droite da la zone de l'époux/se

source: To edit information about parents who are already present in the database, move the mouse over the corresponding parents' box and double-click.
fr: Si vous voulez modifier les données sur des parents déjà déclarés dans la base de données, placez le curseur de la souris sur la zone des parents choisis et double-cliquez.

source: Alternate ways of specifying parents
fr: Alternative pour préciser des parents

source: These functions can also be performed by right-clicking on the parents' box and using the context menu that pops up.
fr: Ces fonctions sont également disponibles dans le menu contextuel par un clic-droit.

source: To Specify Children
fr: Pour préciser des enfants

source: To specify children of an Active person, switch to the Family View (<xref linkend="family-fig"/>) and then click either the second or the third button from the top right of the children list box. The second button adds a child to the database and to the family, while the third button adds a child to the family who is already present in the database.
fr: Pour préciser les enfants de la personne active, allez dans la vue Famille (<xref linkend="family-fig"/>) puis cliquez sur le deuxième ou le troisième bouton en haut à droite de la liste des enfants. Le deuxième bouton déclare une personne dans la base de données et l'ajoute à la liste des enfants tandis que le troisième ajoute une personne déjà déclarée à la famille.

source: If using the third button, select a child from the list and specify the child's relationship with father and mother using menus at the bottom. If you want, you can add a person to the list by clicking the <guibutton>Add...</guibutton> button. By default, GRAMPS will limit the lists to people who could possibly be the child (judged by the date of birth) of the active person. To override this, check the <guilabel>Show all</guilabel> box.
fr: Quand vous utilisez le troisième bouton, sélectionnez un enfant dans la liste et précisez sa relation avec le père et la mère en utilisant les menus du bas. Vous pouvez si nécessaire ajouter une personne à la liste avec le bouton <guibutton>Ajouter...</guibutton> Par défaut, GRAMPS ne présentera que les personnes qui peuvent être enfant de la personne active en se fondant sur la date de naissance. Si vous voulez avoir toutes les personnes, cochez la case <guilabel>Afficher tout</guilabel>.

source: The relationship of the child to the parents can be modified by right-clicking in the children's box and using the context menu that pops up. Again, most of the above functions are available through this context menu.
fr: La nature de la relation entre l'enfant et les parents peut être changée par le menu contextuel obtenu en cliquant avec le bouton droit de la souris dans la zone des enfants. La plupart des fonctions décrites ci-dessus sont aussi accessibles par le menu contextuel.

source: Adding Photos and Other Media Objects
fr: Pour ajouter des images

source: You can add photos and other media objects to individual people, events, sources, and places. You can also add images that might not be limited to a single person or event (for example, group family photos).
fr: Vous pouvez associer des images (ainsi que d'autres objets multimedia) à des individus, des évènements, des sources, des lieux et même des images liées plus généralement à la base de données (par exemple des photos de famille).

source: If you want to add an image to a single person, switch to the People View (<xref linkend="side-nofilt-fig"/>), select a person, and then click the <guibutton>Edit</guibutton> icon on the toolbar. This will bring up the <guilabel>Edit Person</guilabel> dialog (<xref linkend="edit-pers-fig"/>). Next, select the <guilabel>Gallery</guilabel> tab, and click the <guibutton>+</guibutton> button to call up the <guilabel>Select a media object</guilabel> dialog. Type a filename or browse to find the image file you want and then provide a title for that image. Keep adding images until you are done.
fr: Pour ajouter des images à une seule personne, allez dans la vue Individus (<xref linkend="side-nofilt-fig"/>) sélectionnez une personne puis cliquez sur l'icône <guibutton>Editer</guibutton> dans la barre d'outils pour lancer le dialogue <guilabel>Edition de l'individu</guilabel> (<xref linkend="edit-pers-fig"/>). pour les détails) A ce moment, sélectionnez l'onglet <guilabel>Galerie</guilabel>puis cliquez sur le bouton <guibutton>+</guibutton>pour ouvrir le dialogue <guilabel>Selection d'un media </guilabel>. Saisissez le nom du fichier ou allez le chercher avec le bouton <guilabel>Parcourir...</guilabel>.

source: To add images related to a relationship (for example, a marriage), switch to the Family View (<xref linkend="family-fig"/>) and double-click on the Spouse box. This calls up the <guilabel>Marriage/Relationship editor</guilabel> dialog. Select the <guilabel>Gallery</guilabel> tab and click the <guibutton>+</guibutton> button to add an image.
fr: Pour associer des images à une relation (par exemple un mariage), allez dans la vue Famille (<xref linkend="family-fig"/>) uis double-cliquez dans la zone de l'époux/se pour ouvrir le dialogue <guilabel> Affichage Mariage/Relation</guilabel>. Selectionner l'onglet <guilabel>Galerie</guilabel> puis le bouton <guibutton>+</guibutton>pour ajouter une image.

source: To add images related to a source or a place, first switch to the Source View (<xref linkend="sources-fig"/>) or Place View (<xref linkend="places-fig"/>). Select the source or place you want and then either double-click on it or click the <guibutton>Edit</guibutton> icon on the toolbar. Select the <guilabel>Gallery</guilabel> tab and click the <guibutton>+</guibutton> button to add an image.
fr: Pour associer une image à une source ou un lieu, allez d'abord dans la vue Sources (<xref linkend="sources-fig"/>) ou Vue des Lieux (<xref linkend="places-fig"/>).Sélectionnez l'élément cherché puis double-cliquez dessus ou cliquez sur l'icône <guibutton>Editer</guibutton> dans la barre d'outils pour appeler le dialogue <guilabel>Editeur de Sources</guilabel> (ou <guilabel>Editeur de Lieux</guilabel>) Sélectionnez l'onglet <guilabel>Galerie</guilabel> puis cliquez sur le bouton <guibutton>+</guibutton> pour ajouter une image.

source: Finally, to add images that you want to include in the database, but hare are not limited to any particular person, relationship, source or place, switch to the Media View (<xref linkend="media-fig"/>). Then click the <guibutton>Add</guibutton> icon on the toolbar to add an image. If you have already added any images to any individual galleries, you will also find them listed in the Media View.
fr: Enfin, pour ajouter des images dans la base de données mais qui ne sont pas liées à une personne, une relation, une source ou un lieu en particulier, allez dans la vue Média (<xref linkend="media-fig"/>). Cliquez alors sur l'icône <guibutton>Ajouter</guibutton> de la barre d'outils pour ajouter une image. Si vous avez déjà ajouté des images dans n'importe quelle Galerie, vous les trouverez listées dans la vue des Médias.

source: Alternate way of adding images to galleries
fr: Alternative pour l'ajout d'images aux galeries

source: An image can always be added to any gallery by using drag-and-drop. Items can be dragged from the Media View, any gallery, the desktop, the file manager or a web browser and dropped on the target gallery, adding the image to the gallery.
fr: Une image peut toujours être ajoutée par un glisser/déposer. Les items peuvent être glissés depuis la vue des médias, une galerie, le bureau, le gestionnaire de fichiers ou un navigateur web et glisser vers la galerie cible, ajoutant l'image à la galerie.

source: In any gallery, you can also use the <guibutton>Edit</guibutton> to edit image information and the <guibutton>-</guibutton> button and to remove the image reference from that gallery.
fr: Dans toutes les Galeries, vous pouvez utiliser les boutons <guibutton>Editer</guibutton> and <guibutton>-</guibutton> pour modifier les informations sur les images et supprimer la référence à l'image depuis cette Galerie. Remarquez que supprimer la reéférence à une image depuis une Galerie ne supprime pas l'image de la base de données.

source: Removing an image from a gallery
fr: Enlever une image de la galerie

source: Removing a media object from a gallery does not remove the image from the database. To completely remove the image from the database, delete it from Media View by first selecting it and then clicking the <guibutton>Remove</guibutton> icon on the toolbar.
fr: Pour supprimer complètement une image de la base de données, il faut la détruire dans la vue des Médias en la sélectionnant puis en cliquant sur l'icône <guibutton>Enlever</guibutton> dans la barre d'outils.

source: To Edit Sources and Places
fr: Pour modifier des sources et des lieux

source: To add a source or a place to the database, switch to the appropriate Source View (<xref linkend="sources-fig"/>) or Place View (<xref linkend="places-fig"/>). Then click the <guibutton>Add</guibutton> icon on the toolbar to add a source/place. Enter the information into the <guilabel>Source Editor</guilabel> (or <guilabel>Place Editor</guilabel>) dialog.
fr: Pour ajouter une source ou un lieu à la base de données, allez dans la vue Sources (<xref linkend="sources-fig"/>) ou Vue des Lieux (<xref linkend="places-fig"/>). Puis cliquer sur l'icône <guibutton>Ajouter</guibutton> dans la barre d'outils pour créer une source ou un lieu. Saisissez les caractéristiques du nouvel élément dans le dialogue <guilabel>Editeur de sources</guilabel> (ou <guilabel>Editeur de Lieux</guilabel>).

source: To edit information about sources and places already present in the database, switch to the appropriate view, select an entry you would like to view/modify, and then click the <guibutton>Edit</guibutton> icon on the toolbar. Alternatively, you may double-click on the entry to edit it.
fr: Si vous voulez modifier des données à propos de sources ou de lieux déjà déclarés dans la base de données, allez dans la vue concernée (sources ou lieux), sélectionnez l'élément à modifier puis cliquez sur l'icône <guibutton>Editer</guibutton> de la barre d'outils. Vous pouvez aussi double-cliquer sur l'élément dans sa liste pour l'éditer.

source: Enterng and Editing Data: Complete Description
fr: Édition des données : description détaillée

source: The previous section offered you a quick overview of how to enter and edit data in GRAMPS. This section continues that discussion in much greater detail.
fr: Cette section fournit une description complète de toutes les options de modification de tous les éléments de la base de données GRAMPS. Vous disposez aussi de nombreux raccourcis claviers décrits dans <xref linkend="append-keybind"/>.

source: As we have seen above, GRAMPS offers you a series of Views. Each of these Views gives you opportunities to enter and edit information. In fact, you can often get to the same information from different Views.
fr: Comme nous l'avons vu plus haut, GRAMPS vous permet plusieurs vues. Chacune vous offre la possibilité d'entrer et d'éditer l'information. En fait, vous obtenez souvent la même information dans différentes vues.

source: In GRAMPS, information is entered and edited through what we call dialogs. Since we use that term frequently, we should define what we mean by it:
fr: Dans GRAMPS, l'information est entrée et éditée dans un dialogue. Nous utilisons ce terme fréquement, voici sa définition:

source: A dialog is a pop-up window that provides one or more forms for entering and editing data that fits a certain category. Examples in GRAMPS include the Edit Person dialog and the Marriage/Relationship dialog, among many others.
fr: Un dialogue est une fenêtre pop-up qui propose au minimum un formulaire pour entrer et éditer des données correspondant à une catégorie. Par Exemple, GRAMPS inclut un dialogue d'édition d'individu et un dialogue de mariage/relation , parmi d'autres.

source: A dialog often includes a series of "notebook tabs" that group the information into subcategories. For example, the Edit Person dialog has notebook tabs for subcategories such as Events, Attributes, Addresses, and Notes, among others.
fr: Un dialogue inclut souvent une serie d'"onglets" qui regroupe les informations dans des sous-catégories. Par example, le dialogue d'édition d'individu a pour sous-catégories : événements, attributs, adresses, et notes, parmi d'autres.

source: Add, Remove, and Edit buttons
fr: Les boutons Ajouter, Supprimer, et Editer

source: In most cases, GRAMPS uses a <guibutton>+</guibutton> to correspond to <guibutton>Add</guibutton>, a <guibutton>-</guibutton> correspond to <guibutton>Remove</guibutton>, and an icon of a pen on a sheet of paper to denote <guibutton>Edit</guibutton>. We will continue referring to the latter as the <guibutton>Edit</guibutton> button, while using <guibutton>+</guibutton> and <guibutton>-</guibutton> to denote the two former buttons.
fr: Afin de ménager de l'espace précieux à l'écran, les boutons <guibutton>Ajouter</guibutton>, <guibutton>Supprimer</guibutton>, et <guibutton>Editer</guibutton> ne sont pas marqués avec le texte. Ils sont respectivement remplacés par les icône <guibutton>+</guibutton>, <guibutton>-</guibutton> et une icône dépeignant un stylo sur une feuille de papier.

source: Editing Information About People
fr: L'information personnelle

source: Information about people is entered and edited through the <guilabel>Edit Person</guilabel> dialog. This dialog can be invoked from different Views in the following ways:
fr: La modification des informations sur un individu peut se faire de plusieurs manières :

source: From the People View:
fr: De la vue des Individus:

source: Double-click the name of the person whose data you would like to edit
fr: Double-cliquez sur la personne dont vous voulez modifier les données

source: Select the name by single click and then click the <guibutton>Edit</guibutton> button on the toolbar.
fr: Sélectionnez-la avec un simple clic, puis demander la modification par l'icône <guibutton>Editer</guibutton> de la barre d'outils.

source: Select the name and then press <keycap>Enter</keycap>.
fr: Vous pouvez aussi lancer la modification en frappant <keycap>Entrée</keycap>après l'avoir sélectionnée.

source: Select <guimenuitem>Edit...</guimenuitem> from the <guisubmenu>Edit</guisubmenu> menu of GRAMPS
fr: Enfin, vous pouvez choisir <guimenuitem>Editer...</guimenuitem> du menu <guisubmenu>Edition</guisubmenu> de GRAMPS.

source: Select <guimenuitem>Edit</guimenuitem> from the context menu that appears upon right-click on the name.
fr: Sélectionnez <guimenuitem>Editer</guimenuitem> dans le menu contextuel activé en cliquant avec le bouton droit de la souris.

source: From the Family View:
fr: De la vue des familles:

source: To edit active person's data, move the mouse into the <guilabel>Active person</guilabel> box.
fr: Pour éditer les données, entrez la souris dans la boite de la <guilabel>personne active</guilabel>.

source: To edit Spouse's data, shift-click the <guilabel>Spouse</guilabel> entry.
fr: Pour éditer les données du conjoint, double-cliquer sur l'entrée du conjoint.

source: From the <guilabel>Spouse</guilabel> and <guilabel>Children</guilabel> boxes you can select the desired person, right-click, and use the context menu that pops up.
fr: En outre, pour le <guilabel>Conjoint</guilabel> et les <guilabel>Enfants</guilabel>, vous pouvez utiliser le clic-droit, puis éditer les données de la personne choisie.

source: From the Pedigree View:
fr: De la vue de l'arborescence:

source: Double-click in the box having the name of the person whose data you want to edit.
fr: Mettez la souris dans la zone de la Personne Active, puis double-cliquez, ou encore utilisez les sous-menus décrits ci-dessus.

source: In each of the above cases, the <guilabel>Edit Person</guilabel> dialog will appear:
fr: Quelle que soit la méthode utilisée, le dialogue suivant apparaîtra:

source: Edit Person dialog
fr: Édition de l'individu

source: Shows Edit Person dialog.
fr: Fenêtre d'édition de l'individu
