Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: To open a database that you have recently opened, choose the top selection, select your database from the menu and click <guibutton>OK</guibutton>.
fr: Si vous voulez ouvrir une base récente, cochez le bouton radio du haut puis le bouton <guibutton>OK</guibutton>. Il vous sera alors demandé le nom de la base à ouvrir.

source: To open an existing database you have not recently opened, choose the middle selection and click <guibutton>OK</guibutton>. GRAMPS will then ask you to specify the name of the database you wish to open.
fr: Si vous voulez ouvrir une base existante, cochez le bouton radio du haut puis le bouton <guibutton>OK</guibutton>. Il vous sera alors demandé le nom de la base existante à ouvrir.

source: As you might guess, to create a new database, choose "Create a new database"
fr: Comme vous pouvez le deviner, pour créer une nouvelle base de données, choisissez "Créer une nouvelle base"

source: Selecting file
fr: Choix du fichier

source: If you're familiar with version 1.0.X of GRAMPS, you'll note that version 2.0 does not require you to select a directory in which to store the database.
fr: À la différence de la version 1.0.X de , cette version n'exige pas de choisir un dossier pour la base de données. Choisissez juste un Nom de fichier, comme dans n'importe quelle autre application.

source: Obtaining Help
fr: Obtenir de l'Aide

source: GRAMPS has a <menuchoice><guimenu>Help</guimenu></menuchoice> menu that you can consult at any time. It includes the following items:
fr: Les possibilités suivantes vous sont toujours accessibles à partir du menu <menuchoice><guimenu>Aide</guimenu></menuchoice>

source: User manual
fr: Manuel utilisateur

source: An electronic version of the manual that you can access while you work in GRAMPS.
fr: Ce choix vous permet de lire ce manuel dans le navigateur d'aide.

source: A list of Frequently Asked Questions about GRAMPS.
fr: Ce choix vous donne accès à la Foire Aux Questions via votre navigateur web.

source: GRAMPS home page
fr: La page d'accueil de GRAMPS

source: A link to the GRAMPS' project web site.
fr: Ce choix ouvre la page d'accueil du site de GRAMPS

source: GRAMPS mailing lists
fr: Listes de diffusion GRAMPS

source: Gives you direct access to GRAMPS' mailing list archives.
fr: Ce choix guide votre navigateur web vers les listes de diffusion de GRAMPS.

source: Report a bug
fr: Rapporter une erreur

source: Choose this item to file a bug report in our bug tracking system. (Remember, GRAMPS is a living project. We want to know about any problems you encounter so we can work to solve them for everyone's benefit.)
fr: Choissez ce lien pour rapporter un bug dans le système de suivie de bug . (Rappelez vous, GRAMPS est un projet vivant. Nous voulons connaître les problèmes rencontrés, tout le monde pourra en bénéficier.)

source: Show plugin status
fr: Montrez le statut plugin

source: Use this item to display the status of any plugins you may have added.
fr: Employez cet article pour montrer le statut de plugins chargés.

source: Open example database
fr: Ouvrir une base exemple

source: Select this item to load the example database that is included in your GRAMPS package. This database is composed of fictitious people and serves as a useful example for learning how to work with GRAMPS.
fr: Ce choix ouvre la base de données exemple installée avec GRAMPS. Elle décrit des personnes fictives et sert à apprendre à utiliser GRAMPS.

source: Main Window
fr: Fenêtre Principale

source: When you open a database (either existing or new), the following window is displayed:
fr: La fenêtre suivante est affichée quand vous ouvrez une base de données (nouvelle ou existante):

source: GRAMPS Main Window
fr: Fenêtre principale de GRAMPS

source: The main GRAMPS window contains the following elements:
fr: La fenêtre de GRAMPS contient les éléments suivants:

source: Menubar
fr: Barre de menu

source: The menubar is located at the very top of the window (right below the window title) and provides access to all the features of GRAMPS.
fr: La barre de menu est placée tout en haut de la fenêtre (juste à droite du titre de la fenêtre) et donne accès à toutes les fonctions de GRAMPS à travers ses menus.

source: Toolbar
fr: Barre d'outils

source: The toolbar is located right below the menubar. It gives you access to the most frequently used functions of GRAMPS. You can set options that control how it appears by going to <menuchoice><guimenu>Edit</guimenu><guisubmenu>Preferences</guisubmenu></menuchoice>. You can also hide it entirely by going to <menuchoice><guimenu>View</guimenu><guisubmenu>Toolbar</guisubmenu></menuchoice>.
fr: La barre d'outils est placée juste sous la barre de menu.Elle donne accès aux fonctions les plus utilisées de GRAMPS.Sa présentation peut être changée dans le menu <menuchoice><guimenu>Edition</guimenu><guisubmenu>Préférences</guisubmenu></menuchoice>. Vous pouvez également la cacher entièrement en allant sous <menuchoice><guimenu>Affichage</guimenu><guisubmenu>Barre d'outils</guisubmenu></menuchoice>.

source: Progress Bar
fr: Barre de progression

source: The Progress Bar is located in the lower left corner of the GRAMPS window. It displays the progress of time consuming operations, such as opening and saving large data bases, importing and exporting to other formats, generating web sites, etc. When you are not doing these types of operations, the Progress Bar is blank.
fr: La barre de progression se trouve en bas, à gauche de la fenêtre principale de GRAMPS. Elle montre l'avancement des opérations longues comme le chargement ou l'écriture de grosses bases de données, l'importation ou l'exportation de données de et vers d'autres formats ou la génération de sites web, etc.

source: Status Bar
fr: La barre d'état

source: The Status Bar is located to the right of the Progress Bar, on the very bottom of the GRAMPS window. It displays information about current GRAMPS activity and contextual information about the selected items. The behavior of the Status Bar can be adjusted in the Preferences dialog, which can be found by selecting <menuchoice><guimenu>Edit</guimenu><guisubmenu>Preferences</guisubmenu></menuchoice>.
fr: La barre d'état est placée à droite de la barre de progression, tout en bas de la fenêtre de GRAMPS. Elle informe sur le travail en cours avec GRAMPS et explique les éléments de menu. Son comportement peut être changé dans le dialogue Préferences sous <menuchoice><guimenu>Edition </guimenu><guisubmenu>Préférences </guisubmenu></menuchoice>

source: Display area
fr: Zone d'affichage

source: The largest area in the center of the GRAMPS window is the display area. What it displays depends on the currently selected View. We'll discuss Views in detail below.
fr: Le plus grand espace dans la fenêtre de GRAMPS est la zone d'affichage. Elle montre une vue des données généalogiques, selon le type d'affichage en cours.

source: Views
fr: Vues

source: Genealogical information is very broad and can be extremely detailed. Displaying it poses a challenge that GRAMPS takes on by dividing and organizing the information into a series of Views. Each View displays a portion of the total information, selected according to a particular category. This will become clearer as we explore the six different Views, listed below:
fr: Les vues sont les différentes façons d'afficher les données généalogiques. Comme l'information est vaste et hétérogène, il vaut mieux en réaliser l'affichage en catégories homogènes plus restreintes. Chaque vue représente une de ces catégories. Les six types d'affichage suivants sont disponibles dans GRAMPS:

source: People View
fr: Vue par Individus

source: Family View
fr: Vue Familiale

source: Pedigree View
fr: Vue par Arborescence

source: Sources View
fr: Vue des Sources

source: Places View
fr: Vue par Lieux

source: Media View
fr: Vue des Medias

source: Before we launch into a description of each View, let's first explain how to switch between Views.
fr: Le changement de vue est décrit ci-dessous, avant leur description détaillée.

source: Switching Views and Viewing Modes
fr: Le changement entre les vues et les modes d'affichage

source: As mentioned above there are six different Views. In addition, there are two different Viewing Modes. You can tell at a glance which Viewing Mode you are in: If you see icons listed vertically in a sidebar at the left of the window, you are in the Sidebar Viewing Mode. If instead you see a series of "notebook tabs" (labeled People, Family, Pedigree, Sources, Places, Media) that run horizontally across the window, then you are in the Tabbed Viewing Mode. You can switch from one Viewing Mode to another by selecting <menuchoice><guimenu>View</guimenu><guimenuitem>Sidebar</guimenuitem></menuchoice> from the Sidebar menu item.
fr: Selon l'état du menu <menuchoice><guimenu>Affichage</guimenu><guimenuitem>Barre latérale</guimenuitem></menuchoice>, le mode d'affichage peut être changé soit dans la barre verticale, soit dans les onglets en haut de la fenêtre.

source: If you're in the Sidebar Viewing Mode, you can select the View you want by clicking one of the sidebar icons.
fr: Pour changer de Vue dans la barre latérale, cliquez sur l'icône de la vue que vous désirez.

source: Sidebar Viewing Mode
fr: Mode avec barre latérale

source: Shows sidebar viewing mode.
fr: Vue avec la barre latérale

source: If you're in the Tabbed Viewing Mode, you can select the View you want by clicking the corresponding notebook tab.
fr: Pour changer de vue en mode "Onglet", cliquez sur l'onglet désiré.

source: Tabbed Viewing Mode
fr: Mode Onglets

source: Shows tabbed viewing mode.
fr: Vue en Mode Onglets

source: When GRAMPS first opens a database, it displays the People View (<xref linkend="side-nofilt-fig"/> and <xref linkend="noside-nofilt-fig"/>). This view lists all the people stored in the database.
fr: Quand GRAMPS ouvre une base de données, la Vue est celle des individus (<xref linkend="side-nofilt-fig"/> et <xref linkend="noside-nofilt-fig"/>).La Vue Individus liste les personnes dont les données sont enregistrées dans la base de données.

source: You'll note that people are grouped according to their family names. To the left of each family name is an arrow. Clicking it once will reveal the entire list of people sharing that name. Clicking the arrow again will "roll up" the list and show only the family name.
fr: Les personnes sont présentées en arbre, selon leur nom de famille. Chaque nom est un noeud de l'arbre. Cliquer sur la croix à gauche du noeud le déploie ou le replie selon son état. Quand un arbre est déployé, le contenu du noeud est affiché. Quand il est replié, le contenu n'est pas visible. Les données sont cependant conservées, elles sont seulement masquées.

source: By default, the People View, displays the following columns: <guilabel>Names</guilabel>, GRAMPS <guilabel>ID</guilabel> numbers, <guilabel>Gender</guilabel>, and their <guilabel>Birth</guilabel> and <guilabel>Death dates</guilabel>. You can add or remove columns to and from the display by calling up the <guilabel>Column Editor</guilabel> dialog (<menuchoice><guimenu>Edit</guimenu><guimenuitem>Column Editor</guimenuitem></menuchoice>) and checking or unchecking the boxes listed. You can also change the position of a column in People View by clicking and dragging it to a new position in the Editor. Once you have made the changes you want, click <guibutton>OK</guibutton> to exit the Editor and see your changes in the People View.
fr: Par défaut, la Vue des Individus affiche ces différentes colonnes: <guilabel>Noms</guilabel>, <guilabel>Identifiants GRAMPS</guilabel>, <guilabel>Genre</guilabel>, et leurs dates de <guilabel>Naissance</guilabel> et de <guilabel>Décès</guilabel>. La liste peut être triée par rapport par n'importe quel champ.Vous pouvez ajouter ou enlever des colonnes par le dialogue <guilabel>Editeur de colonnes</guilabel> (<menuchoice><guimenu>Edition</guimenu><guimenuitem>Editeur de colonnes</guimenuitem></menuchoice>) et cocher ou décocher dans la liste. Vous pouvez également changer la position de la colonne dans la vue des individuspar un glisser/déposer vers la nouvelle position dans l'éditeur.Après le changement, cliquer sur <guibutton>Valider</guibutton> pour quitter l'éditeur et voir les modifications.

source: Column Editor
fr: Rédacteur de Colonne

source: The Column Editor is available in all Views and works the same way in each.
fr: L'éditeur de colonnes est disponible pour chaque vue et fonctionne de la même façon pour chacune.

source: Column Editor Dialog
fr: Fenêtre d'édition de Colonnes

source: Shows column editor dialog.
fr: Vue du dialogue d'édition des colonnes

source: Filters
fr: Filtres

source: Genealogical databases can contain information on many people, families, places, and objects. It's therefore possible for a View to contain a long list of data that's difficult to work with. GRAMPS gives you a means for controlling this condition by allowing you to filter a list to a more manageable size.
fr: Les bases de données généalogiques peuvent décrire beaucoup d'individus. Comme les longues énumérations sont difficiles à traiter mentalement, GRAMPS fournit une façon pratique pour réduire l'ensemble des données visibles avec un filtre. Pour économiser l'espace sur l'écran, les contrôles de filtre peuvent être cachés, selon l'état du menu.

source: Filter Controls Displayed
fr: Contrôle du filtre affiché

source: Shows filter controls.
fr: Vue du dialogue de contrôle des filtres

source: When GRAMPS opens a database, no filtering is in effect. In People View, for example, all people in the database are listed by default. To filter the list, go to <menuchoice><guimenu>View</guimenu><guimenuitem>Filter</guimenuitem></menuchoice>. This will place a new menu just above the list of People. Click on the double arrows of this menu to get a pop-up list of all the criteria by which you can filter the People listed. Choose a filter (for example, "Males" or "People with children") and click <guibutton>Apply</guibutton>.
fr: Quand GRAMPS ouvre une base de données, le filtre est le filtre simple appelé toute la base, c'est à dire qu'il n'y a aucun filtrage. Pour choisir un filtre, utilisez le menu <menuchoice><guimenu>Affichage</guimenu><guimenuitem>Filtre</guimenuitem></menuchoice>. Celà placera un nouveau menu au-dessus de la liste des individus. Quand vous avez choisi le filtre, cliquez sur le bouton <guibutton>Appliquer</guibutton> en haut à droite de la fenêtre. Le filtre sera alors appliqué. Pour inverser la règle de filtrage cochez le choix Inverse à gauche du bouton

source: Displaying the filter
fr: Afficher le filtre

source: To reduce screen clutter, the filter menu is hidden by default. To display it, go to the <menuchoice><guimenu>View</guimenu><guimenuitem>Filter</guimenuitem></menuchoice> menu. Please understand that even if the filter menu is not displayed, filtering may still be in effect. (Thus, we say that filtering is persistent.) If you are unsure if your list is filtered, bring up the filter menu (by going to <menuchoice><guimenu>View</guimenu><guimenuitem>Filter</guimenuitem></menuchoice>) and check if any filtering is set.
fr: Pour réduire l'encombrement, le menu filtre est caché par défaut. Pour l'afficher, allez au menu <menuchoice><guimenu>Affichage</guimenu><guimenuitem>Filtre</guimenuitem></menuchoice>. SVP comprenez bien que même si le menu filtre n'est pas affiché, le filtrage est toujours actif. (on dit que le filtrage est persistant.) Si vous n'êtes pas certain que votre liste est filtrée, affichez le menu filtre (par <menuchoice><guimenu>Affichage</guimenu><guimenuitem>Filtre</guimenuitem></menuchoice>) et vérifiez le filtre.

source: Example filter use
fr: Exemple d'utilisation de filtre

source: To show males only, choose the <guilabel>Males</guilabel> filter, then click the <guibutton>Apply</guibutton> button. To cancel any filtering, set the filter to <guilabel>Entire Database</guilabel> and then click the <guibutton>Apply</guibutton> button.
fr: Pour montrer seulement les hommes, choisissez le filtre <guilabel>Hommes</guilabel> puis cliquer sur le bouton <guibutton>Appliquer</guibutton> button. Pour décommander le filtrage, placez le filtre sur <guilabel>Toute la base de données</guilabel> et cliquer sur <guibutton>Appliquer</guibutton>.

source: The Family View displays the family information of a selected person that we call the Active person. Specifically, it shows his or her closest relationships.
fr: L'affichage par famille montre les informations autour de la personne sélectionnée (ou Active). En particulier, cette vue montre les relations (c'est à dire les mariages ou concubinages, etc.) de la personne active, ses parents (ou beaux-parents, or tuteurs, etc), ainsi que ses enfants (que ce soit des enfants directs, de conjoint ou bien adoptés, etc.).

source: Shows Family View.
fr: Vue des Familles

source: The Family View displays the following series of list boxes:
fr: La vue familiale affiche ces différentes fenêtres:

source: Active person
fr: Activer une Personne

source: Shows birth and death data for the individual you have selected. Double-click inside the box to edit the Active person's information. Click on the double arrow to the right and the currently selected Spouse will become the new Active person.
fr: Les données de la personne active sont dans le haut, à gauche de la fenêtre. Juste en dessous, une autre boîte montre ses époux, épouses (ou toutes autres personnes en relation familiale). La double flèche dans le bouton à droite de la personne active fait échanger la personne active et son époux ou épouse sélectionné(e).

source: Relationship
fr: Relations

source: Displays birth and death data for the Active person's Spouse(s).
fr: Affiche les données de naissance et de décès du/des conjoint(s) de la personne active.

source: Terminology
fr: Terminologie

source: In the Family View, we use the term "spouse" for sake of simplicity. However, please note that "spouse" may in fact be a domestic partner, a partner in a civil union, etc.
fr: Dans la vue familiale, nous utilisons le terme de "conjoint" pour simplifier. Cependant, notez que "conjoint" est un terme général.

source: Double-click a Spouse to edit his or her relationship to the Active person. Shift-click (that is, hold down the Shift key while you click) a Spouse to edit his or her personal information. Click the icon to the top right of the Relationship box to add a new person to the database and to create a relationship between this person and the Active person. Click the middle icon to create a relationship between the Active person and another person already stored in the database. Click the minus (-) button to remove the relationship between the currently selected Spouse and the Active person. (Note that this does not remove the Spouse from the database.)
fr: Vous pouvez modifier la relation entre la personne active et son époux ou épouse sélectionnée en double-cliquant sur la personne active. Vous pouvez modifier les données de l'époux ou épouse sélectionnée en shift-cliquant sur lui ou elle.Pour ajouter une nouvelle relation depuis la personne active, utilisez un des boutons du haut, à droite de la boîte de l'époux ou de l'épouse. Celui du haut ajoute une nouvelle personne dans la base de données et la relation avec la personne active. Celui du milieu crée une relation entre la personne active et une personne déjà déclarée dans la base de données. Le bouton du bas (-)à droite de la boîte de l'époux ou de l'épouse retire la relation avec cette personne. La plupart de ces fonctions sont aussi disponibles en cliquant avec le bouton droit de la souris dans la boîte de l'époux ou de l'épouse, puis en sélectionnant l'action voulue dans le menu contextuel ainsi activé.

source: Active person's parents
fr: Activer les parents de l'individu

source: Click the <guibutton>+</guibutton> or <guibutton>-</guibutton> buttons to add or remove parents of the Active person. Click the right arrow button to make the Father the new Active person and the Mother the new Spouse.
fr: Les parents de la personne active ainsi que de la personne sélectionnée en relation sont affichés dans la partie droite de la fenêtre. Ceux de la personne active sont en haut, ceux de la personne en relation en bas. Leurs boîtes ont chacune un ensemble de trois boutons à droite. Les boutons <guibutton>+</guibutton> et <guibutton>-</guibutton> vous permettent d'ajouter ou de retirer des parents de la personne correspondante (active ou époux).

source: Spouse's parents
fr: Les beaux-parents

source: This list box functions the same as that of the Active person's parents.
fr: La flèche vers la droite change de famille courante, en mettant la famille correspondante comme famille courante.

source: Children
fr: Les enfants

source: Displays the children of the Active person and the currently selected Spouse. The list can be ordered however you want by clicking on a column heading.
fr: La boîte du bas liste les enfants de la personne active et de la relation courante (sélectionnée). La liste des enfants peut être triée par date de naissance comme d'habitude, en cliquant sur l'en-tête de colonne

source: Note that in addition to columns for Name, ID, Gender, Birth Date, and Death Date, there is a column labeled Status.1 This column reflects the relationship between the child and his parents (Birth, Adoption, etc.).
fr: En plus des colonnes pour le nom, ID, sexe, date de naissance et de décès, la vue comprend une ligne Statut.1 Les deux mots de statut décrivent la relation entre l'enfant et son père ou sa mère (comme Naissance, Adoption...).

source: As with the other list boxes, the Children list box has some associated buttons. Click the left arrow button to make the selected Child the Active person. Click the next button down to add a new person to the database and to make this person a Child of the Active person. Click the next button down to select a person from the database and to make this person a Child of the Active person. Click the lowest button to remove the selected Child from the Family (note that this does not remove the Child from the database).
fr: L'éditeur de colonnes peut être utilisé pour modifier l'affichage des colonnes. Quatre boutons sont disponibles à droite de la liste des enfants. Celui du haut (flèche vers la gauche) met l'enfant sélectionné comme personne active. Les deux suivants ajoutent une personne dans la famille : celui du haut crée une personne tandis que celui du bas met une personne déjà déclarée dans la base de données comme enfant dans cette famille. Enfin, le bouton tout en bas (-) retire l'enfant sélectionné de la famille. (Notez que ceci ne supprime pas la personne de la base de données.).

source: Right Click Menu
fr: Menu clic-droit

source: Most of the functions described above can also be executed by right-clicking your mouse.
fr: La plupart de ces fonctions sont aussi disponibles en cliquant avec le bouton droit de la souris dans la boîte des enfants, puis en sélectionnant l'action voulue dans le menu contextuel ainsi activé.
