Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: GRAMPS Manual V2.6
fr: GRAMPS Manuel V2.6

source: This document describes GRAMPS, the Genealogical Research and Analysis Management Programming System.
fr: Ce document décrit GRAMPS, le Genealogical Research et Analysis Management Programming System.

source: GRAMPS Project
fr: Project GRAMPS

source: This manual is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
fr: Ce manuel est un logiciel libre; vous pouvez le redistribuer et/ou le modifier en vertu de la licence de grand public de GNU comme publiée par Free Software Foundation; version 2 de la licence, ou (à votre option) toute version postérieure.

source: This manual is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
fr: Ce manuel est distribué dans l'espoir qu'il sera utile, mais SANS GARANTIE; sans même la garantie implicite de la VALEUR MARCHANDE ou POUR UN BUT PARTICULIER. Voyez la licence grand public GNU pour plus de détails.

source: You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
fr: Vous devriez avoir reçu une copie de la licence grand public GNU avec ce programme; sinon, écrivez à Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA

source: Aug 2005
fr: Août 2005

source: GRAMPS Manual V2.5
fr: GRAMPS Manuel V2.5

source: February 2004
fr: Février 2004

source: GRAMPS Manual V2.4
fr: GRAMPS Manuel V2.4

source: December 2003
fr: Décembre 2003

source: GRAMPS Manual V2.3
fr: GRAMPS Manuel V2.3

source: September 2003
fr: Septembre 2003

source: GRAMPS Manual V2.2
fr: GRAMPS Manuel V2.2

source: July 2003
fr: Juillet 2003

source: GRAMPS Manual V2.1
fr: GRAMPS Manuel V2.1

source: May 2003
fr: Mai 2003

source: GRAMPS Manual V2.0
fr: GRAMPS Manuel V2.0

source: April 2003
fr: Avril 2003

source: GRAMPS User Manual V1.1
fr: GRAMPS Manuel Utilisateur V1.1

source: gramps User Manual V1.0
fr: GRAMPS Manuel Utilisateur V1.0

source: This manual describes version 2.0.0 of GRAMPS.
fr: Ce manuel décrit la version 2.0.0 de GRAMPS.

source: Preface
fr: Préface

source: GRAMPS is a software package designed for genealogical research. Although similar to other genealogical programs, GRAMPS offers some unique and powerful features, which we'll discuss below.
fr: GRAMPS est une application de généalogie. est l'acronyme de Genealogical Research and Analysis Management Programming System (Systeme de Programmation pour Recherche, Analyse et Gestion de données généalogiques). En bref, il vous permet de conserver, modifier et chercher des données de généalogie à l'aide d'un ordinateur. Il est semblable à d'autres programmes de généalogie mais il offre en plus des possibilités qui lui sont uniques

source: GRAMPS is a Open Source Software package, which means you are free to make copies and distribute it to anyone you like. It's developed and maintained by a worldwide team of volunteers whose goal is to make GRAMPS powerful, yet easy to use.
fr: GRAMPS est un logiciel Open Source, ce qui signifie que vous êtes libres de faire des copies et les distribuer à tout le monde. Il est développé et maintenu par une équipe de volontaires du monde entier dont le but est d'améliorer et de faciliter l'utilisation de GRAMPS

source: Why use GRAMPS?
fr: Pourquoi utiliser GRAMPS?

source: Most genealogy programs allow you to enter information about your ancestors and descendants. Typically, they can display family relationships through charts, graphs, or reports. Some allow you to include pictures or other media. Most let you include information about people even if those people are not related to the primary family you happen to be researching. And they may include features that let you exchange data with other programs and print different types of reports.
fr: La plupart des logiciels de généalogie permettent de saisir des données. Ils suivent en général le modèle de données standard Gedcom. Habituellement, on peut afficher des arbres ascendants ou descendants sur l'écran ou bien les imprimer. On peut ajouter des images aux données. On peut souvent saisir des informations sur des personnes ou des familles non obligatoirement liées avec l'objet de la recherche. D'autres extensions portent sur l'importation ou l'exportation de données ainsi que sur les impressions d'états.

source: GRAMPS has all these capabilities and more. Notably, it allows you to integrate bits and pieces of data as they arise from your research and to put them in one place -- your computer. You can then use your computer to manipulate, correlate, and analyze your data, rather than messing with reams of paper.
fr: GRAMPS cherche à fournir toutes les fonctions communes de ces logiciels et aussi la capacité d'intégrer des informations éparses directement, puis de traiter/réorganiser n'importe quel évènement et/ou donnée dans toute la base de données, pour aider l'utilisateur dans ses recherches, analyses, recoupements et éventuellement mises en relation de données. En bref, cet outil traite toutes les données en un lieu unique avec l'aide de l'ordinateur, en remplaçant le crayon et les montagnes de papier.

source: What's new since 1.0.X
fr: Ce qu'il y a de nouveau depuis la version 1.X

source: If you are new to GRAMPS, it may not be important for you to know how GRAMPS version 2.0.0 (the object of this manual) differs from previous versions of the software. You may therefore elect to skip this section.
fr: Si vous découvrez GRAMPS, ceci n'est pas important de savoir comment GRAMPS 2.0.0 (l'object de ce manuel) diffère de la version précédente. Vous pouvez ignorer cette section

source: However, if you are already familiar with GRAMPS and are interested in the new aspects and features of version 2.0.0, please read on.
fr: Cependant si vous êtes déjà familiarisé avec GRAMPS et êtes intéressé par les nouveaux aspects et fonctions de la version 2.0.0, SVP lisez la suite.

source: Berkeley database backend
fr: Base de données Berkeley

source: We've adopted the Berkeley database format (BSDDB) as the default for GRAMPS. Berkeley is the most widely used open source developer database in the world.
fr: Nous avons adopté le format de base de données Berkeley (BSDDB) comme format de défaut pour GRAMPS. Berkeley est la base de données la plus utilisée par les développeurs Open Sources de part le monde.

source: This change allowed us to overcome issues of performance and memory requirements that beset version 1.0.X. With the new back-end, database sizes of up to a hundred thousand people no longer present a major obstacle.
fr: Le format de GRAMPS est maintenant la base de données BSDDB. Ce changement nous a permis de surmonter des issues d'exécution et les conditions de mémoire de la branche 1.0.X. Avec ce format, une base de données de 100 000 individus ne présentent pas un obstacle important.

source: The default extension for GRAMPS' BSDDB database files is grdb. The new format is open and fully documented in the developer's API reference distributed with the source code of GRAMPS.
fr: L'extension par défaut pour la base de données GRAMPS' BSDDB est grdb. Ce nouveau format est ouvert et entièrement documenté dans la référence de l'api distribuée avec le code source.

source: Preferred format
fr: Format préféré

source: The preferred and default format for GRAMPS is the new BSDDB format.
fr: Le format préféré et par défaut pour GRAMPS est le nouveau format BSDDB.

source: A consequence of the new database back-end is that the "saving" function is no longer necessary (or even possible). Now, once you approve changes, they are immediately applied; this means that clicking <guibutton>OK</guibutton> in the Person, Family, Source, Place, Media object, or Event editor immediately records changes to the database.
fr: Une conséquence de la nouvelle base de données reste que les changements, une fois approuvés par l'utilisateur, sont appliqués immédiatement. En bref, une fois que vous cliquez OK chez la personne, la famille, source, lieux, objet médias, ou un événement, tous les changements faits sont enregistrés dans la base de données. Aucun enregistrement n'est nécessaire (ou même possible). En outre, il est possible de défaire des actions récentes.

source: In previous versions, you could "quit without saving." This option no longer exists per se; however, in version 2.0.0, you can achieve the same effect if you abandon or "cancel" all changes and then quit.
fr: Dans les précédentes versions, vous pouviez "quitter sans enregistrer." Cette option n'existe plus; cependant, dans les versions 2.0.0, vous pouvez réaliser la même chose si vous abandonnez ou "annulez" les changements puis quittez.

source: Also, it is now possible to undo recent actions.
fr: Maintenant, il est également possible d'annuler les récentes actions.

source: Other database back-ends
fr: Les autres base de données

source: Along with the BSDDB backend, we've incorporated "in-memory" database handling for the GRAMPS XML and GEDCOM formats. This means you can now open files in those two formats and work with their data without having to first create a new database and import data into it. Since this approach requires GRAMPS to hold all the data in memory, it is only useful for small databases (depending on available memory size).
fr: Avec BSDDB, la base de données est en mémoire, de même que pour le format GRAMPS XML et les GEDCOM. Il est maintenant possible d'ouvrir de façon "indigènes", des données dans ces deux formats (bien que préférant le format par défaut : grdb), sans installer nécessairement une base de données vide et l'importer. Cette approche exige de contenir toutes les données en mémoire, ainsi il est seulement utile pour de petites bases de données (selon la capacité de la mémoire disponible). En un tel mode, les données sont automatiquement sauvées sur la sortie, pour imiter la fonctionnalité de la vraie base de données.

source: GEDCOM Editing
fr: Edition de GEDCOM

source: Please keep in mind that some information in a GEDCOM file may be lost during import into GRAMPS. Simply opening and viewing the file will not change it. However, if any changes were made and they were not abandoned upon exit, exiting GRAMPS will save the data, with the possible data loss.
fr: Maintenez svp à l'esprit que l'information du fichier GEDCOM peut être perdue pendant l'importation dans GRAMPS. Simplement l'ouverture et le visionnement du dossier ne le changeront pas. Cependant, si des changements étaient faits et ils n'étaient pas exportés, sortir de GRAMPS sauvera les données, avec la perte possible de données.

source: Desktop integration
fr: Intégration de bureau

source: We've improved the way GRAMPS integrates with the GNOME desktop interface common to many Linux distributions. All file formats recognized by GRAMPS are now registered as mime types; each has its own icon and has GRAMPS as its default handler. Thus, if you double-click on any file having one of these formats, GRAMPS will launch and open the file.
fr: Tous les formats connus de GRAMPS sont maintenant enregistrés comme types-MIME, chacun avec son icône et GRAMPS en tant que programme par défaut. Double-cliquer sur un dossier avec n'importe lequel de ces formats lancera GRAMPS et ouvrira la base. GRAMPS a également ajouté le soutien des documents récents. Présent dans le menu GNOME et dans GRAMPS.

source: We've also added support for GNOME's "recent documents" function and have incorporated this function within GRAMPS itself.
fr: Les préférences sont maintenant correctement en magasin en utilisant GConf, avec des schémas, la division des clefs dans de plus petits annuaires, la vérification des erreurs, et l'avis.

source: Interface improvements
fr: Améliorations de l'interface

source: We've made numerous changes in the interface. Most of them are subtle and incremental improvements, and all of them cannot be listed here. The most notable are:
fr: Il y a de nombreux changements dans l'interface. La plupart d'entre eux sont des améliorations subtiles et tous ne peuvent pas être énumérés ici. Les changements les plus apparents sont:

source: Removal of alphabetical tabs.
fr: Disparition des étiquettes alphabétiques

source: Ability to add/remove/rearrange columns in list views.
fr: Possibilités d'ajouter/supprimer/modifier la vue des listes

source: Removal of the Save function and addition of Undo.
fr: Disparition des fonctions d'enregistrement et ajout d'une fonction "retour à la dernière version"

source: Proper window management.
fr: Gestion et déplacements appropriés de la plupart des fenêtres

source: Support for Tip of the Day.
fr: Soutien de l'astuce du jour

source: Person-dependent context menus (right-click) in Pedigree View, listing parents, children, spouses, and siblings.
fr: menu Personnel contextuel (clic de droit) les parents, les enfants et les conjoints peuvent être affichés dans l'arborescence

source: Addition of an Export wizard.
fr: Aide à l'exportation

source: Built-in Find function in list views.
fr: Fonction intégrée de recherche dans les vues de liste

source: Addition of a Date selector dialog.
fr: Dialogue de sélecteur de date

source: Name editor enhancements: patronymic names and non-default grouping.
fr: Perfectionnements dans l'édition des noms : les patronymes et les chaînes non transférées

source: "Recent document" support (both within GRAMPS and GNOME-wide)
fr: Ajout du fichier récent (gramps et menu de GNOME)

source: Import and Export
fr: Importation et exportation

source: We've added import and export filters for the GeneWeb format.
fr: Les nouveaux filtres d'importation et d'exportation disponibles pour GeneWeb.

source: Reports
fr: Rapports

source: We've added a new report: Statistics Chart.
fr: Un nouveau rapport -- diagramme de statistiques -- a été ajouté.

source: We've changed the overall report framework. All reports now remember the options you configure for them.
fr: Un changement global du cadre entier de rapport a été accomplis. Tous les rapports se rappellent maintenant leurs options.

source: It is possible to generate reports from the command line, without launching an interactive GRAMPS session.
fr: Il est possible de produire des rapports en ligne de commande, sans lancer la session interactive de GRAMPS.

source: The report API is much simpler now, making it easy to write custom reports.
fr: Le rapport api est beaucoup plus simple maintenant, le rendant facile d'écriture.

source: A single code instance may be used for a standalone report, a book item, and a command-line report.
fr: Un exemple simple de code peut être employé pour un rapport autonome, un article de livre, et un rapport en ligne de commande.

source: Internationalization
fr: Internationalisation

source: The approach for entering and displaying dates has been completely reworked. The new framework allows for a deeper localization of displayed dates than was ever possible using the translatable strings.
fr: L'approche pour écrire et montrer des dates a été complètement retouchée. En particulier, le nouveau cadre tient compte d'une localisation plus profonde des dates montrées, ce qui n'était jamais possible en utilisant les chaînes traduisibles.

source: The internationalization of names has also been improved. Names can be grouped under a non-default string. Patronymic names are supported, and it is easy to program new ways to display names in the manner customary to a given culture or language.
fr: L'internationalisation des noms ont été également améliorées. Des noms peuvent être groupés sous une chaîne non-transférée. Les Patronymes sont soutenus, et il est facile de programmer de nouvelles manières pour montrer des noms, comme celà peut être exigé par diverses cultures et langues.

source: Typographical conventions
fr: Conventions typographiques

source: <command>Commands</command> you type at the command line
fr: <command>Commandes</command> à lancer à la ligne de commande

source: Filenames
fr: Nom_de_fichier

source: Replaceable text
fr: Texte remplaçable

source: <guilabel>Labels</guilabel> for buttons and other portions of the graphical interface
fr: <guilabel>Icônes/Onglets</guilabel> pour les boutons et d'autres parties de l'interface graphique

source: Menu selections look like this: <menuchoice><guimenu>Menu</guimenu><guisubmenu>Submenu</guisubmenu><guimenuitem>Menu Item</guimenuitem></menuchoice>
fr: Le choix du menu : <menuchoice><guimenu>Menu</guimenu><guisubmenu>Sous-menu</guisubmenu><guimenuitem>Article du Menu</guimenuitem></menuchoice>

source: <guibutton>Buttons</guibutton> you can click
fr: <guibutton>Boutons</guibutton> que vous pouvez cliquer

source: Anything you type in
fr: Quelque chose que vous saisissez

source: In this book, some words are marked with special typography: <placeholder-1/>
fr: Dans ce manuel, nous utilisons des mots identifiés par la typographie spéciale: <placeholder-1/>

source: Tip
fr: Astuce

source: Tips and bits of extra information will look like this.
fr: Les astuces et le peu d'information supplémentaire ressembleront à ceci.

source: Notes will look like this.
fr: Les notes ressembleront à ceci.

source: The manual also provides assorted bits of additional information in tips and notes, as follows. <tip id="example-tip"><placeholder-1/><placeholder-2/></tip><note id="example-note"><placeholder-3/><placeholder-4/></note>
fr: Nous fournissons également des informations additionnelles dans les astuces et les notes, comme suit. <tip id="example-tip"><placeholder-1/><placeholder-2/></tip><note id="example-note"><placeholder-3/><placeholder-4/></note>

source: Example Warning
fr: Avertissement d'exemple

source: This is what a warning looks like. If there's a chance you'll run into trouble, you will be warned beforehand.
fr: Si vous courrez un danger, nous vous avertirons à l'avance.

source: Finally, there are warnings, notifying you where you should be careful: <warning id="example-warning"><placeholder-1/><placeholder-2/></warning>
fr: En conclusion, nous avons également des avertissements : <warning id="example-warning"><placeholder-1/><placeholder-2/></warning>

source: Getting Started
fr: Commencer

source: In this chapter, we'll begin with the basics. We'll show you how to start GRAMPS and how to get help when you need it.
fr: Ce chapitre fournit les informations les plus basiques sur GRAMPS.

source: To Start GRAMPS
fr: Pour Lancer GRAMPS

source: You can start GRAMPS in the following ways:
fr: Vous pouvez lancer GRAMPS comme suit :

source: From the <guimenu>Applications</guimenu> menu
fr: <guimenu>Applications</guimenu> menu

source: Select GRAMPS from the list of programs displayed in your computer's Applications menu. (The location and appearance of this menu vary slightly from one distribution of Linux to another. On the default GNOME desktop, you'll find GRAMPS in the <menuchoice><guimenu>Applications</guimenu><guisubmenu>Other</guisubmenu></menuchoice> menu.
fr: Les menus peuvent changer selon votre distribution. Pour le bureau GNOME par défaut, <menuchoice><guisubmenu>Autre</guisubmenu><guimenuitem>Gramps</guimenuitem></menuchoice>.

source: From the command line
fr: Ligne de commande

source: If you're adept with Linux and like to work from the command line, you can start GRAMPS by calling up a terminal window, typing <command>gramps</command>, and then pressing <keycap>Enter</keycap>.
fr: Pour lancer GRAMPS en ligne de commande, entrez <command>gramps</command>, puis <keycap>Entrée</keycap>.

source: If you would like GRAMPS to open a specific database or to import a specific file on startup, you can supply the filename as a command line argument:
fr: Si vous voulez que GRAMPS ouvre un ensemble de données lors de son lancement, spécifiez le fichier au lancement comme argument de la ligne de commande :

source: gramps filename.grdb
fr: gramps nom_du_fichier.grdb

source: where <filename>filename.grdb</filename> is the name of the file you want to open. The command line provides many more ways to start GRAMPS and perform different tasks. The detailed reference to the command line options is found in <xref linkend="append-cmdline"/>.
fr: ou <filename>nom_du_fichier.grdb</filename> est le nom du fichier que vous voulez ouvrir ou importer. La documentation de référence des options en ligne de commande est dans <xref linkend="append-cmdline"/>.

source: Running GRAMPS for the first time
fr: La première utilisation de GRAMPS

source: The first time you run the program, GRAMPS will display the "Getting Started" dialogs. Follow the directions that guide you through <guilabel>Researcher information</guilabel>, <guilabel>Numerical date formats</guilabel>, <guilabel>Alternate calendar support</guilabel>, and <guilabel>the LDS extensions</guilabel> sections. You should find them to be self-explanatory.
fr: La première fois que vous l'utilisez, GRAMPS affiche un dialogue de premier lancement. Suivez les directives qui vous guident à travers les sections <guilabel>Informations sur le chercheur</guilabel>, <guilabel>Formats de dates numériques</guilabel>, <guilabel>Utilisation d'autres calendriers</guilabel>, et <guilabel>extensions LDS</guilabel> La plupart de ces dialogues sont simples et ne seront pas décrits ici.

source: Dialog boxes
fr: Boîte de dialogue

source: We'll make frequent reference in this manual to dialogs. A dialog is simply a pop-up window into which you can enter information.
fr: Nous ferons beaucoup référence aux boîtes de dialogue dans ce manuel. Un dialogue est simplement une fenêtre pop-up dans laquelle on peut entrer des informations.

source: We recommend you enter your personal information when GRAMPS prompts you for it. GRAMPS uses this information strictly so it can create valid GEDCOM output files (which require information about the files' creator). If you wish, you can choose not to supply this information, but be aware that unless and until you do, any GEDCOM files you export will not be valid.
fr: Nous recommandons d'entrer vos informations personnelles quand GRAMPS vous le propose. GRAMPS utilise seulement ses informations pour générer une sortie de GEDCOM valide (laquelle nécessite des informations sur le créateur du fichier). Si vous le voulez, vous pouvez ne rien renseigner, mais attention, les fichiers GEDCOM exportés ne seront pas valides.

source: GRAMPS Getting Started Window: Researcher Information
fr: Dialogue de premier lancement : Informations sur le chercheur

source: Shows Researcher Information Window.
fr: La fenêtre d'informations sur le chercheur

source: Entering personal information
fr: Entrer des informations personnelles

source: This information can be entered at any time in the Preferences dialog, under the Database/Researcher Information category.
fr: Ces informations peuvent être saisies plus tard dans le dialogue Préférences/chercheur.

source: Choosing a database on startup
fr: Choix d'une base de données au démarrage

source: If GRAMPS is started without a database selected, the following window will appear prompting you to choose one to open.
fr: GRAMPSSi est lancé sans base de données à ouvrir, le dialogue suivant s'ouvrira pour vous le demander.

source: Open Database Window
fr: Dialogue d'ouverture d'une base de données

source: Shows Open Database Window.
fr: L'ouverture d'une base de données
