Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: The layout of the Family View can be switched from the "left-to-right" arrangement shown in <xref linkend="family-fig"/> to the "top-to-bottom" arrangement shown in <xref linkend="family-alt-fig"/>. This is done by going to <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice> and selecting the <guilabel>Display</guilabel> section of the dialog that appears.
fr: La disposition de la Vue Famille peut être changé entre la disposition de gauche à droite décrite ci-dessus <xref linkend="family-fig"/> et la disposition de haut en bas décrite ci-dessous <xref linkend="family-alt-fig"/>. Ceci se fait dans la section <menuchoice><guimenu>Edition</guimenu><guimenuitem>Préférences</guimenuitem></menuchoice> et sélectionnez <guilabel>Affichage</guilabel>. La disposition de haut en bas propose les mêmes fonctions que la disposition de gauche à droite.

source: Alternative Family View
fr: Vue Alternative des Familles

source: Shows Alternative Family View.
fr: Vue Alternative des Familles

source: The Pedigree View displays a family tree of the Active person's ancestors. The Pedigree View shows up to five generations, depending on the size of the window. Each person is indicated by a box labeled with his or her name. Two lines branch from each box. The top one shows the person's father and the bottom one the mother. Solid lines represent birth relations, while dashed lines represent non-birth relations such as adoption, step-parenthood, guardianship, etc.
fr: La vue en Arborescence vous aide à voir la place de la personne active dans l'arbre de ses ancêtres. Elle montre quatre générations, de la personne active 1 vers ses parents 2 , ses grands-parents 3 et ses arrière grands-parents 4.Chaque personne est représentée par un rectangle portant son nom. Deux lignes relient la personne à son père (ligne supérieure) et sa mère (ligne inférieure). Les lignes continues figurent les liens de filiation tandis que les lignes pointillées représentent les autres liens (adoption, beau-père ou belle-mère, tuteurs). Quand le pointeur de la souris passe sur une personne, son rectangle s'agrandit pour afficher ses dates de naissance et de décès. Quand le pointeur de la souris passe sur une ligne de famille, celle-ci est mise en évidence. Double-cliquer sur la ligne met alors le parent correspondant comme personne active. Tout l'affichage change alors en conséquence.

source: Shows Pedigree View.
fr: Vue de l'Arborescence

source: If you move your mouse over a box, it expands to show birth and death dates. If you move your mouse over a line, the line gets highlighted, indicating an active link. Double-click the line to make the corresponding ancestor the Active person.
fr: Si votre curseur se trouve au-dessus de la boîte, GRAMPS affichera les dates de naissance et de décès. Si votre curseur se trouve au-dessus d'une ligne, la ligne sera en surbrillance, indiquant un lien actif. Double-cliquer sur la ligne pour faire correspondre un ancêtre avec la personne activée.

source: Children Menu
fr: Menu des Enfants

source: Shows Children Menu in Pedigree View.
fr: La vue des Enfants dans l'arborescence

source: To the left of the Active person is a left arrow button. If the Active person has children, clicking this button expands a list of the Active person's children. Selecting one of the children makes that child the pctive Person.
fr: Une flèche vers la gauche est affichée dans la partie gauche de la fenêtre. En cliquant dessus, un menu comprenant les enfants de la personne active apparait. Sélectionner un des enfants le met alors comme personne active.

source: The appearance of the children's names in the menu differentiates the "dead ends" of the tree from the continuing branches. Children who have children themselves appear in the menu in the boldface and italic type, while children without children ("dead ends") appear in a regular font. If the Active person has only one child, no menu will be displayed (since there is only one choice) and the child will become the Active person when the arrow button is clicked.
fr: Le nom de chaque enfant est affiché différemment selon que la personne est une feuille de l'arbre (sans enfants connus) ou bien a des enfants connus. Le nom d'une personne dont on connait des enfants apparaît en caractères gras et italiques au lieu d'être affiché en caractères normaux. Si la personne active n'a qu'un enfant, aucun menu ne sera affiché puisqu'il n'y a pas de choix possible. Dans ce cas, l'unique enfant devient la personne active dès que l'on a cliqué sur le bouton.

source: The right-hand side of the window shows two right arrow buttons. When the top button is clicked, the Father of the Active person becomes the Active person. Clicking the bottom button makes the Mother of the Active person the Active person.
fr: Deux flèches vers la droite sont affichées dans la partie droite de la fenêtre. Celle du haut prend comme personne active le père de la personne active. Celle du bas met comme nouvelle personne active la mère de la personne active. Comme précédemment, tout l'affichage change alors en conséquence.

source: Personal Context Menu
fr: Menu Personnel Contextuel

source: Shows Context Menu in Pedigree View.
fr: Vue du menu Personnel Contextuel dans l'arborescence

source: Right-clicking on any person's box in the Pedigree View will bring up the "context menu". Among other useful items, the context menu has sub-menus listing <guilabel>Spouses</guilabel>, <guilabel>Siblings</guilabel>, <guilabel>Children</guilabel>, and <guilabel>Parents</guilabel> of that person. "Greyed-out" sub-menus indicate the absence of the data in the appropriate category. Similarly to the children menu above, Childrens' and Parents' menus distinguish continuing lines from dead ends.
fr: Un clic-droit appelle un menu contextuel. Ce menu indique si l'individu a des <guilabel>Conjoints</guilabel>, des <guilabel>Enfants de mêmes parents</guilabel>, des <guilabel>Enfants</guilabel> et des <guilabel>Parents</guilabel>. Le sous-menus peut indiquer l'absence des données dans la catégorie appropriée.

source: Pedigree View with the Anchor
fr: Vue de l'Arbre avec l'ancre

source: Shows Pedigree View with the anchor set.
fr: Vue de l'Arbre avec l'ancre

source: Pedigree View gives you an additional, advanced way of labeling generations. This feature becomes available by setting the "anchor" on a selected person. If the anchor is set, the generations are labeled as follows:
fr: Un principe avancé de numérotation des générations existe dans la vue arborescente. Il est rendu disponible en jetant l'ancre sur la personne active. Si l'ancre est jetée, les générations sont étiquetées comme suit :

source: The Anchor Person (and his/her generation) is labeled as <guilabel>0</guilabel>.
fr: la personne active et toutes celles de sa génération sont étiquetées <guilabel>0</guilabel>.

source: The ancestor generations are numbered with positive integers (<guilabel>1</guilabel>,<guilabel>2</guilabel>, <guilabel>3</guilabel>,etc.).
fr: Les ancêtres sont numérotés avec des nombres positifs (<guilabel>1</guilabel>, <guilabel>2</guilabel>, <guilabel>3</guilabel>, etc.)

source: The descendant generations are numbered with negative integers (<guilabel>-1</guilabel>,<guilabel>-2</guilabel>, <guilabel>-3</guilabel>, etc.).
fr: Les descendants sont numérotés avec des nombres négatifs (<guilabel>-1</guilabel>, <guilabel>-2</guilabel>, <guilabel>-3</guilabel>, etc.).

source: In all cases, the number represents the number of generations between the labeled generation and the anchor person. In this mode, you can travel along the extensive pedigree line and see the number of generations removed from the Anchor Person.
fr: Dans tous les cas, l'étiquette représente le nombre de générations entre la génération étiquetée et la personne active lors du jet de l'ancre. Dans ce mode, vous pouvez vous déplacer dans l'arbre des générations et les compter depuis la personne active.

source: To set the anchor, select the person you want as the Active person (recall that you can do so in the Pedigree View by clicking the line that leads to the person from his or her child). Then, while in Pedigree View, right click anywhere in the main window. A context menu will appear. Select <guilabel>Set anchor</guilabel> and you will see the Active person indicated as the anchor in the lower left corner. This newly established Anchor Person will remain in effect until you right-click again and select <guilabel>Remove anchor</guilabel> from the context menu or until a new Active person is chosen who is unrelated to the Anchor Person.
fr: Pour placer l'ancre, choisissez <guilabel>Jeter l'ancre</guilabel> dans le menu contextuel (clic droit) quand la personne voulue est la personne active à la racine de la vue arborescente. Les étiquettes changeront alors et le nom de la personne-ancre sera affiché en bas à gauche de la vue arborescente. The labels will change immediately, and the name of the anchor person will appear at the lower left corner of the display area. La personne-ancre le restera jusqu'à ce que l'ancre soit retirée (choix <guilabel>Lever l'ancre</guilabel> dans le menu contextuel) ou encore que la personne active ne soit plus en relation avec la personne-ancre. Ce dernier cas arrive par l'utilisation des outils de déplacement avancé de GRAMPS. Voir

source: Sources View lists the sources of certain information stored in the database. These can include various documents (birth, death, and marriage certificates, etc.), books, films, journals, private diaries, - nearly anything that can provide genealogical evidence. GRAMPS gives you the option to provide a source for each event you record (births, deaths, marriages, etc.). The Source View lists the <guilabel>Title</guilabel>, <guilabel>ID</guilabel>, and <guilabel>Author</guilabel> of the source, as well as any <guilabel>Publication</guilabel> information that may be associated with it.
fr: La Vue des Sources présente les sources d'information conservées dans la base de données. Ceci peut couvrir des documents variés comme les actes de naissance, décès, mariage, livres, journaux, journaux personnels. En fait tout document peut être pris comme une source d'information. Les sources peuvent être utilisée comme référence pour n'importe quel évènement conservé dans la base de données. La Vue Sources présente pour chacune le <guilabel>Titre</guilabel>, l'<guilabel>Identifiant</guilabel>, et l'<guilabel>Auteur</guilabel>. Le tri peut être fait par rapport à n'importe quelle colonne. Il se fait comme d'habitude : un clic sur l'en-tête de la colonne pour trier en ordre ascendant, un autre clic pour trier dans l'ordre descendant. L'<guilabel>Editeur de colonnes</guilabel> peut être utilisé pour l'affichage des colonnes.

source: The list of Sources can be sorted in the usual manner, by clicking on a column heading. Clicking once sorts in ascending order, clicking again sorts in descending order. The <guilabel>Column Editor</guilabel> dialog can be used to add, remove and rearrange the displayed columns.
fr: La liste des sources peut être triée, par un clic sur l'en-tête de la colonne. Cliquer une fois trie deans l'ordre ascendant, cliquer une deuxième fois dans l'ordre descendant. L'<guilabel>éditeur de colonnes</guilabel> peut être utilisé pour ajouter supprimer ou modifier les colonnes.

source: Shows Sources View.
fr: Vue des Sources

source: The Places View lists the geographical places in which the events of the database took place. These could be places of birth, death, and marriages of people, as well as their home, employment, education addresses, or any other conceivable reference to the geographical location. The Places View lists the places' <guilabel>Name</guilabel>, <guilabel>ID</guilabel>, <guilabel>Church Parish</guilabel>, <guilabel>City</guilabel>, <guilabel>County</guilabel>, <guilabel>State</guilabel>, and <guilabel>Country</guilabel>. All of these columns can be used for sorting by the usual sorting rules. The <guilabel>Column Editor</guilabel> dialog may be used to add, remove and rearrange the displayed columns.
fr: La Vue des Lieux présente la liste des endroits géographiques où se sont passés les évènements enregistrés dans la base de données. Cela peut être les lieux de naissance, mariage, décès des individus, aussi bien que leur lieu d'habitation, de travail ou d'études comme n'importe quelle référence géographique. La Vue des Lieux affiche pour chaque lieu son <guilabel>Nom</guilabel>, son <guilabel>Identifiant</guilabel>, sa <guilabel>Paroisse</guilabel>, sa <guilabel>Ville</guilabel>, son <guilabel>Département</guilabel>, sa <guilabel>Région</guilabel> et son <guilabel>Pays</guilabel>. Toutes ces colonnes peuvent servir de règle de tri. L'<guilabel>Editeur de colonnes</guilabel> peut être utilisé pour l'affichage des colonnes.

source: Shows Places View.
fr: Vue des Lieux

source: Shows Media View.
fr: Vue des Médias

source: The Media View is a list of Media Objects used in the database. Media Objects are any files that relate somehow to the stored genealogical data. Technically, any file can be stored as a Media Object. Most frequently, these are images, audio files, animation files, etc. The list box on the bottom lists the <guilabel>Name</guilabel>, <guilabel>ID</guilabel>, <guilabel>Type</guilabel>, and <guilabel>Path</guilabel> of the Media Object. The <guilabel>Column Editor</guilabel> dialog may be used to rearrange the displayed columns, which obey usual sorting rules. The top part of the GRAMPS window shows a preview (if available) and information about the Media Object.
fr: La Vue des Medias présente la liste des objets multimedia utilisés dans la base de données. Les objets multimedia sont des fichiers liés aux données de la base généalogique. Techniquement, on peut mettre n'importe quel fichier en objet multimedia. Habituellement, on y met des images, des enregistrements audio ou video. La liste présente pour chaque objet multimedia son <guilabel>Nom</guilabel>, son <guilabel>Identifiant</guilabel>, son <guilabel>Type</guilabel>, et son <guilabel>Chemin d'accès</guilabel>. Toutes ces colonnes peuvent servir de règle de tri. La partie supérieure de la fenêtre montre une prévisualisation quand c'est possible ainsi que les informations sur l'objet multimedia sélectionné.

source: Usage
fr: Utilisation

source: Now we turn to a detailed exploration of the day-to-day use of GRAMPS. First, we should point out that GRAMPS often offers more than one way to do the same task. We'll try to point out some of these alternatives where appropriate.
fr: Dans GRAMPS, il y a souvent plusieurs moyens pour faire quelque chose. Dans ce cas, les alternatives seront décrites à côté de la méthode principale.

source: Starting a New Database
fr: Commencer une nouvelle base de données

source: To start a new database, choose <menuchoice><guimenu>File</guimenu><guimenuitem>New</guimenuitem></menuchoice>. You will then be asked to give the new database a name.
fr: Pour commencer avec une nouvelle base de données, faites <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Nouveau</guimenuitem></menuchoice>.Le dialogue <guilabel>Créer une base de données</guilabel> sera présenté pour donner le nom sous lequel les données seront sauvées. La nouvelle base de données sera créée dans le format de BSDDB, avec pour extension <filename>.grdb</filename>.

source: GRAMPS databases
fr: Bases de données GRAMPS

source: GRAMPS stores your data in a Berkeley database, sometimes known as BSDDB. These files have ".grdb" as their default extension. The extension is automatically added to your filename.
fr: GRAMPS garde les données dans une base de données Berkeley, également connu comme BSDDB. Ces fichiers ont ".grdb" pour extension par défaut. L'extension est automatiquement ajoutée à la base de données.

source: Opening a Database
fr: Ouvrir une base de données

source: To open a database, either choose <menuchoice><guimenu>File</guimenu><guimenuitem>Open</guimenuitem></menuchoice> or click the <guibutton>Open</guibutton> button on the Toolbar. The <guilabel>Open database</guilabel> dialog will appear and you'll see a list of files. If you don't see the file you're looking for, make sure the All files filter is selected. (This dialog has a "filetype" filter, meaning it may only be showing files that have a certain extension.)
fr: Pour ouvrir une base de données, faites <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Ouvrir</guimenuitem></menuchoice> ou cliquer sur <guibutton>Ouvrir</guibutton> dans la barre d'outils. Le dialogue <guilabel>Ouvrir la base de données</guilabel> sera alors affiché.

source: To open a recently accessed database, choose <menuchoice><guimenu>File</guimenu><guimenuitem>Open Recent</guimenuitem></menuchoice> and select the filename from the list.
fr: Pour ouvrir une base de données récemment ouverte, choisissez <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Fichier récemment ouverts</guimenuitem></menuchoice> puis sélectionnez le fichier dans la liste.

source: If you do not have "write permissions" for the selected database, it will be opened in a Read Only mode. In this mode, the data may be viewed, but no changes will be made to the database. To indicate this mode, the title of the main window will be appended with <guilabel>(Read Only)</guilabel> text.
fr: Si vous n'avez pas les "permissions pour écrire" la base de données choisie, elle sera ouverte en "mode lu". Dans ce mode, les données peuvent être regardées, mais aucun changement ne sera fait à la base de données. Pour indiquer ce mode, le titre de la fenêtre principale sera apposé avec le texte <guilabel>(lu seulement)</guilabel>.

source: GRAMPS allows you to open certain databases that have not been saved in GRAMPS' own file format. These include XML and GEDCOM databases. But you should be aware that if the XML or GEDCOM database is relatively large, you may encounter some performance problems. These can be avoided by creating a new GRAMPS database and importing your XML/GEDCOM data into it.
fr: Cette version permet l'ouverture et l'édition directes des bases de données GRAMPS XML et GEDCOM. Maintenez svp à l'esprit que, à la différence du format par défaut: grdb, ces formats exigent de contenir toutes les données en mémoire. Ceci mène aux problèmes de consommation, d'exécution et de mémoire que grdb doit résoudre.

source: Opening XML and GEDCOM databases
fr: Ouvrir XML et bases de données de GEDCOM

source: XML and GEDCOM databases require all data to be held in memory. GRAMPS' native grdb format does not. Thus, a database with a grdb format can access data quicker and more efficiently.
fr: Tandis que l'ouverture directe d'un dossier de GRAMPS XML ou de GEDCOM est commode pour une petite base de données, elle peut être onéreux pour de grandes bases de données. Si vous éprouvez ceci, créez une nouvelle base de données (grdb) et importer vos données XML ou GEDCOM, dans elle. Ceci rendra l'accés à vos données beaucoup plus efficace.

source: Please keep in mind that some information in a GEDCOM file may be lost during import into GRAMPS. Simply opening and viewing the file will not change it. However, if any changes were made and they were not abandoned upon exit, exiting GRAMPS will save the data, with possible data loss.
fr: Maintenez à l'esprit que des information du GEDCOM peuvent être perdues pendant l'importation dans GRAMPS. Simplement l'ouverture et le visionnement du dossier ne le changeront pas. Cependant, si des changements étaient faits et ils n'étaient pas abandonnés sur la sortie, sortir de GRAMPS sauvera les données, avec la perte possible de données.

source: Saving Changes to Your Database
fr: Sauver une base de données

source: GRAMPS saves your changes as soon as you apply them. This means, for example, that any time you click <guibutton>OK</guibutton> when using GRAMPS, your changes are immediately recorded and saved. There is no separate "save" command (although there is a "save as" command that we'll discuss later.)
fr: Une conséquence de la nouvelle base de données principale est que les changements, une fois approuvés par l'utilisateur, sont appliqués immédiatement. En bref, une fois que vous cliquer sur <guibutton>valider</guibutton> chez la personne, la famille, source, endroit, médias objectent, ou le rédacteur d'événement, tous les changements faits à cet objet sont enregistrés dans la base de données.Aucun enregistrement n'est nécessaire, ou même possible.

source: You can undo changes you've made by selecting <menuchoice><guimenu>Edit</guimenu><guimenuitem>Undo</guimenuitem></menuchoice>. If you select this command repeatedly, your most recent changes will be undone one at a time.
fr: Le Choix <menuchoice><guimenu>Edition</guimenu><guimenuitem>Annuler</guimenuitem></menuchoice> vous permet de défaire les changements que vous avez faits, une étape à la fois.

source: If you want to return your database to the way it was when you opened it, select <menuchoice><guimenu>File</guimenu><guimenuitem>Abandon changes and quit</guimenuitem></menuchoice>. (This is just like quitting without saving in other programs.)
fr: Si vous voudriez retourner à la session d'édition entière, choisissez <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Abandonner les modifications</guimenuitem></menuchoice>.Ce sera analogue à stopper en sauvant aucun changement.

source: If you would like to save your database under a different name, you can do so by choosing <menuchoice><guimenu>File</guimenu><guimenuitem>Save as...</guimenuitem></menuchoice> and specifying the name (and, optionally, the format) of your new database. Note that "Save as" will allow you to continue editing the newly saved database. If this is not what you want to do, you may wish to use the "Export" command instead.
fr: Si vous voudriez sauver votre base de données sous un nom différent, vous pouvez le faire en choisissant <menuchoice><guimenu>Fichier</guimenu><guimenuitem>Enregistrer sous...</guimenuitem></menuchoice> et indiquez le nom (option, format) de votre nouvelle base de données.Si vous employez la fonction <guilabel>Enregistrer sous ...</guilabel> l'édition dans la fenêtre principale est exécutée sur la nouvelle base. Si n'est pas ce ce que vous voulez faire, employer <guilabel>Exporter...</guilabel> au lieu de cela.

source: Importing Data
fr: Importation des Données

source: Importing allows you to bring data from other genealogy programs into a GRAMPS database. Currently, GRAMPS can import data from the following formats:
fr: L'importation vous permet d'incorporer des données d'autres bases de données dans une base GRAMPS déjà ouverte. GRAMPS peut actuellement importer des données : base de données GRAMPS (grdb),GEDCOM, GRAMPS XML, paquet GRAMPS et GeneWeb. Ils sont disponibles comme éléments dans le sous-menu <menuchoice><guimenu>Fichier</guimenu><guisubmenu>Importer</guisubmenu></menuchoice>

source: Another GRAMPS database (having the "grdb" file extension),
fr: Une autre base de données GRAMPS (ayant une extension "grdb"),

source: GRAMPS package
fr: paquet GRAMPS

source: Importing vs. opening
fr: Ouvrir ou Importer

source: Please recognize that importing a database is different from opening a database. When you import, you are actually bringing data from one database into a GRAMPS database. When you open a file, you are editing your original file.
fr: L'import ajoute les données à la base déjà ouverte, tandis que l'ouverture remplace la base déjà ouverte.
