Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: The configuration dialogs invoked by <guibutton>Setup</guibutton> are item-specific. If you choose not to configure the item, same defaults will be used for all needed options. The common option for almost all book items is the center person: the person on whom the item is centered. Thanks to this option, you can create a book with items centered on different people (e.g. your mom's and dad's ancestors as separate chapters). By default, the center person is set to the active person.
fr: Si vous choisissez de ne pas <guibutton>Configurer</guibutton> l'article, des défauts raisonnables seront employés pour toutes les options nécessaires. L'option commune pour presque tous les articles de livre est la personne centrale: la personne sur qui l'article est porté. Grâce à cette option, vous pouvez créer un livre avec des articles portés sur les personnes différentes (ancêtres par exemple de la mère et du père en tant que chapitres séparés). Par défaut, la personne centrale est placée comme la personne active.

source: Almost all items available for inclusion in the book are textual or graphical reports, and are therefore available in the form of standalone reports. The exception is the following items which are only available as book items:
fr: Presque tous les articles disponibles pour l'inclusion dans le livre sont des rapports textuels ou graphiques, et sont donc disponibles sous forme de rapports autonomes. L'exception reste les articles suivants qui sont seulement disponibles comme articles de livre:

source: Title Page
fr: Page de titre

source: This item produces a customized Title page. You can configure the text of title, subtitle, and the footer of the page. An image can be optionally placed between the subtitle and the footer. Because of its configurability, this item can be used to create title pages for the whole book, its chapter, or even a single item.
fr: Ce composant produit une page de titre personnalisée. Vous pouvez configurer le texte de titre, sous-titre et l'en-pied de page. Une image peut être insérée entre le sous-titre et l'en-pied de page. Les capacités de configuration de ce composant lui permettent d'être utilisé comme titre pour le livre, ses chapitres ou même un simple composant.

source: Custom Text
fr: Texte personnalisé

source: This item produces a page with three paragraphs, each containing custom text. The appearance of the text can be adjusted by using custom styles. This item was meant to be used for epigraphs, dedications, explanations, notes, and so forth.
fr: Ce composant produit une page avec trois paragraphes contenant chacun un texte paramétrable. L'allure du texte peut être choisie en utilisant des styles personnalisés. Ce composant est destiné à servir pour les épitaphes, des dédicaces, explications, notes...

source: Code Generators
fr: Générateurs de code

source: This category contains reports that produce code intended to be run through the computer, rather than the usual formatted output for human reading. The only code generator currently available in GRAMPS is the Relationship Graph producing the GraphViz description of the graph.
fr: Cette catégorie contient les rapports qui produisent le code prévu pour être lu par l'ordinateur, plutôt que le rapport habituel prévu pour la lecture humaine. Le seul générateur de code actuellement disponible dans GRAMPS est le rapport produisant la description de graphique GraphViz.

source: The Relationship Graph creates a complex relationship graph in GraphViz format. The GraphViz <command>dot</command> tool can transform the graph into postscript, jpeg, png, vrml, svg, and other formats. GraphViz tools are freely available from the <ulink url="http://www.graphviz.org" type="http">GraphViz site</ulink>. Specific options for this report include filter and number of generations considered, as well as several GraphViz-specific options related to pagination, color, and details of the graph.
fr: Ce rapport présente un graphe des relations en format GraphWiz. L'outil GraphWiz <command>dot</command> transforme ensuite le graphe en Postscript, JPEG, PNG, VRML, SVG ou en beaucoup d'autres formats. Les outils GraphWiz sont disponibles gratuitement sur <ulink url="http://www.graphviz.org" type="http">le site de GraphViz </ulink>. Les options spécifiques sont des filtres sur les personnes, le nombre de génération prises en compte ainsi que des options pour GraphWiz liées à la pagination, la couleur et les détails du graphique.

source: If you are not interested in GraphViz code itself and just want to generate graphical output, GRAMPS can do it for you under the hood. Look for <guilabel>Relationship Graph</guilabel> in the Graphical Reports category, <xref linkend="rep-graph"/>
fr: Si vous n'êtes pas intéressé par le code de GraphViz et ne voulez pas produire du rendement graphique, GRAMPS peut le faire pour vous. Recherchez le <guilabel>graphique relationnel</guilabel> dans la catégorie Rapports graphiques <xref linkend="rep-graph"/>.

source: Graphical Reports
fr: Rapports graphiques

source: Graphical reports represent information in forms of charts and graphs. Most of the options are common among graphical reports, therefore they will be described only once, at the end of this section. The few options which are specific to a given report will be described directly in that report's entry.
fr: Les rapports graphiques représentent l'information sous la forme de dessins. La plupart des options sont communes à toutes ces éditions et elles seront décrites une seule fois à la fin de cette section. Les quelques options spécifiques à une édition seront décrites avec l'édition en question.

source: The following graphical reports are currently available in GRAMPS:
fr: Les rapports graphiques suivantes sont actuellement disponibles dans GRAMPS :

source: Ancestor Chart
fr: Arbre des ascendants

source: This report generates the chart of people who are ancestors of the Active person. Specific options include the number of generations considered and the format of the displayed entries.
fr: Ce rapport produit du diagramme des personnes qui sont des ancêtres de la personne active. Les options spécifiques incluent le nombre de générations considérées et du format des entrées montrées.

source: Ancestor Chart (Wall Chart)
fr: Arbre des ascendants (Grand Format)

source: This report is similar to the Ancestor Chart report. It provides more options which make it useful for generating huge charts suitable for a poster or a wall chart. These options include the ability to compress the report (getting rid of an empty space) and the option to fit the whole chart on to a single page. In the latter case, the contents of the chart is scaled down appropriately.
fr: Ce rapport est similaire à l'arbre généalogique. Elle propose plus d'options qui la rende utile pour générer de grands arbres pour un poster ou une affiche murale. Il est ainsi possible de compacter le dessin (supprimer les espaces vides) et de réduire l'échelle pour tout faire tenir sur une page.

source: Descendant Graph
fr: Arbre des descendants

source: This report generates a graph of people who are descendants of the Active person. Specific options include the format of the displayed entries.
fr: Cette édition présente les personnes descendantes de la personne Active. Le format des données présentées est choisi en option spécifique.

source: Fan Chart
fr: Roue des ascendants

source: This report produces a chart resembling a fan, with Active person in the center, parents the the semicircle next to it, grandparents in the next semicircle, and so on, for a total of five generations.
fr: Ce rapport produit un diagramme ressemblant à un ventilateur, avec la personne active au centre, avec ses parents dans le demi-cercle à côté de lui, avec ses grand-parents dans le prochain demi-cercle, et ainsi de suite, pour un total de cinq générations.

source: Relationship Graph
fr: Graphique relationnel

source: This report creates a complex relationship graph in GraphViz format and then converts into graphical output running it through the the GraphViz <command>dot</command> tool behind the scene. Specific options for this report include filter, options for dates and places for the events, and whether to include URLs and IDs for individuals and families. There are also several GraphViz-specific options related to pagination, color, and details of the graph.
fr: Ce rapport crée un graphique complexe de rapport dans le format GraphViz, puis le convertit en rendement graphique courant par l'outil <command>dot</command> GraphViz. Les options spécifiques sont des filtres sur les dates, les lieux, les événements, pour s'inclure avec les identifications des individus et des familles. Il y a également plusieurs options GraphViz-spécifiques liées aux paginations, à la couleur, et aux détails du graphique.

source: Statistics Chart
fr: Diagramme de statistiques

source: This report can collect and display a wealth of statistical data about your database. Specific options include filter, sorting methods, and additional birth- and gender-based limit for inclusion into statistics. You can also set the minimum number of items to qualify for the bar chart, so that the charts with fewer items will generate a pie chart instead. The <guilabel>Chart Selection</guilabel> tab allows you to check which charts you want to include in your report.
fr: Ce rapport peut rassembler et montrer des données statistiques au sujet de votre base de données. Les options spécifiques incluent le filtre, les méthodes de tri, la limite de naissance et le genre pour l'inclusion dans des statistiques. Le <guilabel>Choix du Diagramme</guilabel>, vous permet de vérifier quels diagrammes vous voulez inclure dans votre rapport.

source: Timeline Graph
fr: Graphique temporel

source: This report outputs the list of people with their lifetimes represented by intervals on a common chronological scale. Specific options include filter, sorting method, and the title of the report.
fr: Ce rapport présente l'ensemble de personnes avec leur existence présentée sur une échelle chronologique commune. Les options spécifiques sont le filtre sur les personnes, la façon de les trier et le titre de l'édition.

source: Common options for graphical reports are the filename of the output, the format of the output, selected style, page size and orientation. Optionally, the reports can be immediately opened with the default application.
fr: Les options communes à toutes les éditions graphiques sont le nom du fichier de sortie, le format du fichier de sortie, le choix du style, la taille et l'orientation de la page. En option, l'édition peut être ouverte immédiatement avec son application (choisie dans le menu principal de Gnome)

source: The options used in reports are persistent: each report remembers its options used last time.
fr: Les options utilisées dans les rapports sont persistantes: chaque rapport se rappelle ses options.

source: Text Reports
fr: Rapports de texte

source: Text reports represent the desired information as formatted text. Most of the options are common among text reports, therefore they will be described only once, at the end of this section. The options which are specific to a given report will be described directly in that report's entry.
fr: Les rapports de texte présentent l'information comme du texte formaté. La plupart des options sont communes à toutes ces rapports et elles seront décrites une seule fois à la fin de cette section. Les quelques options spécifiques à un rapport seront décrites avec l'édition en question.

source: The following text reports are currently available in GRAMPS:
fr: Les rapports en mode texte actuellement disponibles dans GRAMPS sont :

source: Ahnentafel Report
fr: Rapport Ahnentafel (Sosa-Stradonitz)

source: This report lists the active person and his or her ancestors along with their vital data. The people are numbered in a special way which is an established standard called Ahnentafel. The active person is given number 1. His or her father and mother have numbers 2 and 3, respectively. This rule holds for every person while going back in generations: father's parents are numbered 4 and 5, and mother's parents are numbered 6 and 7, fathers always numbered with even and mothers with odd numbers. Therefore, for any person having number N in this tree, the numbers of father and mother are 2N and 2N+1, respectively.
fr: Ce rapport présente la personne active et ses ancêtres avec leurs données de naissance et décès. Chaque personne reçoit un numéro suivant un schéma appelé Ahnentafel, Sosa-Stradonitz ou encore Eyzinger selon les sources. Le principe est de donner le numéro 1 à la personne active. Son père reçoit le numéro 2, sa mère le numéro 3. Plus généralement, le père de toute personne a le numéro double de celui de son enfant. La mère reçoit le numéro du père auquel on ajoute 1.

source: Complete Individual Report
fr: Rapport Individuel Complet

source: This report provides individual summaries similar to that of the Individual Summary report. The advantage of this report is the specific filter option. Depending on the filter choice (active person only, his or her descendants, his or her ancestors, or entire database), the report may contain from one to many individual summaries. Another option for this report is the inclusion of source information when listing events.
fr: Ce rapport fournit différents sommaires semblables à celui du compte rendu succinct individuel. L'avantage de ce rapport est l'option spécifique de filtre. Selon le choix de filtre (personne active seulement, ses descendants, ses ancêtres, ou base de données entière), le rapport peut contenir d'un à beaucoup de différents sommaires. Une autre option pour ce rapport est l'inclusion d'information de source en énumérant des événements.

source: Comprehensive Ancestors Report
fr: Rapport Ascendants Intelligent

source: This report produces a comprehensive description of ancestors of the active person. The highlights of this report include elaborate layout, images of children, present and former spouses, and source citations. Specific options: number of backward generations to consider, whether to cite sources, and whether to break pages between generations.
fr: Ce rapport présente une courte description des ascendants de la personne active. Elle a comme option le nombre de générations à prendre en compte.

source: Descendant Report
fr: Rapport des descendants

source: This report produces a brief description of descendants of the active person. Specific options: number of forward generations to consider.
fr: Ce rapport présente une courte description des descendants de la personne active. Elle a comme option le nombre de générations à prendre en compte.

source: Detailed Ancestral Report
fr: Rapport Ascendants détaillé

source: This report covers in detail the ancestors of the active person. It includes vital data (birth and death) as well as marriages. Specific options: number of backward generations to consider, as well as a variety of options regarding the exact contents to include.
fr: Ce rapport présente en détails les ancêtres de la personne active. Les données de naissance et décès ainsi que de mariages sont listés. Elle a comme option le nombre de générations à prendre en compte ainsi que de nombreuses options sur les données à inclure.

source: Detailed Descendant Report
fr: Rapport Descendants détaillé

source: This report covers in detail the descendants of the active person. It includes vital (birth and death) information as well as marriages. Specific options: number of forward generations to consider.
fr: Ce rapport présente en détails les descendants de la personne active. Les données de naissance et décès ainsi que de mariages sont listés. Elle a comme option le nombre de générations à prendre en compte.

source: FTM Style Ancestral Report
fr: Liste des ascendants (Family Tree Maker)

source: This report creates an ancestral report similar to that produced by the Family Tree Maker (tm) program. It covers in detail the active person and his/her ancestors It includes vital information as well as marriages, children, and notes. Specific options: number of backward generations to consider.
fr: Ce rapport présente les ancêtres de façon similaire à ce que produit le programme Family Tree Maker (tm). Cela comprend le détail de la personne active et de ses ancêtres. Les informations de naissance, décès, mariages, enfants et notes sont incluses. Elle a comme option le nombre de générations à prendre en compte.

source: FTM Style Descendant Report
fr: Liste des descendants (Family Tree Maker)

source: This report creates a descendant report similar to that produced by the Family Tree Maker (tm) program. It covers in detail the active person and his/her descendants. It includes vital information as well as marriages, children, and notes. Specific options: number of forward generations to consider.
fr: Ce rapport présente les descendants de façon similaire à ce que produit le programme Family Tree Maker (tm). Cela comprend le détail de la personne active et de ses descendants. Les informations de naissance, décès, mariages, enfants et notes sont incluses. Elle a comme option le nombre de générations à prendre en compte.

source: Family Group Report
fr: Rapports Familiaux

source: This creates a family group report, showing information on a set of parents and their children. Specific options: the spouse (available only if the active person has more than one spouse).
fr: Ce rapport présente un groupe familial, c'est à dire un couple de parents et leurs enfants. Elle a comme option spécifique le choix de l'époux/se de la personne active si celle-ci a eu plusieurs familles.

source: Individual Summary
fr: Rapport Individuel

source: This report produces a detailed summary on the active person. The report includes all the facts known to the database about that person.
fr: Ce rapport présente tout ce qui est connu sur la personne active.

source: Common options for text reports are the filename of the output, the format of the output, selected style, page size and orientation. For HTML reports, there is no page information. Instead, HTML options include the choice of the HTML template, either available in GRAMPS or a custom template defined by you. Optionally, the reports can be immediately opened with the default application.
fr: Les options communes à toutes les éditions en mode texte sont le nom du fichier de sortie, le format du fichier de sortie, le choix du style, la taille et l'orientation de la page. Les édition HTML n'ont pas d'option liées au format de page. Elles ont à la place le choix d'un modèle HTML parmi ceux fournis avec GRAMPS ou bien que vous avez défini. En option, l'édition peut être ouverte immédiatement avec son application par défaut (choisie dans le menu principal de Gnome).

source: View Reports
fr: Rapports statistiques

source: View reports are representing overall summaries of the database information available immediately for on-screen viewing. The following view reports are currently available in GRAMPS:
fr: Les statistiques présentent des résumés généraux sur la base de données, visibles immédiatement sur l'écran. Les statistiques suivantes sont disponibles actuellement dans GRAMPS :

source: Number of ancestors
fr: Nombre d'ancêtres

source: This report displays the number of ancestors of the active person.
fr: Ce rapport présente le nombre total d'ancêtres de la personne active.

source: Summary of the database
fr: Statistiques de la base

source: This report displays the overall statistics concerning number of individuals of each gender, various incomplete entries statistics, as well as family and media statistics.
fr: Ce rapport présente des statistiques générales comprenant le nombre d'individus par sexe, les données incomplètes, les liens erronés et des chiffres sur les familles et les objets multimédias.

source: Web Page
fr: Pages internet

source: The only available report in this category is the Narrative Web Site report. It generates a web site (that is, a set of linked web pages), for a set of selected individuals.
fr: Le seul rapport disponible dans cette catégorie est le site internet narratif. Il produit un site web (qui est, une suite de pages web reliées par des liens), pour un ensemble d'individus sélectionnés.

source: Narrative Web Site
fr: Site internet narratif

source: GRAMPS 2.0.6 introduced the Narrative Web generator. The new tool provides considerably more functionality than the older web generator. Instead of using HTML templates to customize the pages, CSS style sheets are used.
fr: GRAMPS 2.0.6 introduit le générateur de site web narratif. Ce nouvel outil offre beaucoup plus de possibilités que l'ancien générateur web. Au lieu d'utiliser des modèles HTML pour modifier les pages, les feuilles de style CSS sont utilisées.

source: More information is now displayed about each person, along with information about sources, places, and media objects. Introduction pages can be added to provide additional information, such as family history.
fr: Plus d'informations sont maintenant affichées pour chaque individu, ainsi que pour les sources, lieux, et objets média. Une page d'introduction peut être ajoutée pour fournir plus d'information, comme l'histoire de la famille.

source: Selecting the output
fr: Sélectionner la sortie

source: Genealogy records can generate a lot of files. Many web servers have a difficult time with many files in a single directory. The Narrative Web Generator strives to keep the number of files per directory to a managable level. To do this, a hierarchy of directores is created. The generated files names are not intuitive, but are unique per person. Subsequent runs will geneate identical file names, making it easy to replace files.
fr: Les enregistrements généalogique peuvent générer beaucoup de fichiers. Les serveurs web peuvent avoir des difficultés avec beaucoup de fichiers dans un seul répertoire. Le site internet narratif s'efforce de garder un nombre raisonnable de fichiers par répertoire. Pour celà, un hiérarchie des répertoire est créée. Le nom des fichiers générés n'est pas intuitif, mais unique pour une personne. Le nom du fichier sera toujours le même, rendant facile le remplacement du fichier.

source: By default, the output files are written to the specified directory. Because of the number of files and directories that are created, it may be difficult to transfer the files to an external web host. To aid in this, you may directly create a gzip'd tar file to more easily upload the data. This is the format that should be used if you would like to take advantage of the free genealogy page hosting at the <ulink url="http://family.gramps-project.org" type="http">GRAMPS web hosting site</ulink>.
fr: Par défaut, les fichiers sont enregistrés dans un répertoire spécifique. Du fait du nombre de fichiers et répertoires créés, celà peut être difficile de les transférer vers un serveur externe. C'est pourquoi, vous pouvez créer directement un fichier gzip'd tar pour un envoi plus facile. C'est le format que vous devriez utiliser si vous voulez bénéficier de l'herbergement gratuit de vos pages via <ulink url="http://family.gramps-project.org" type="http">GRAMPS site web hosting</ulink>.

source: To select the gzip'd tar file, select the <guilabel>Store web pages in .tar.gz archive</guilabel> option.
fr: Pour sélectionner le fichier gzip'd tar, utilisez l'option <guilabel>Extrait les pages web en .tar.gz</guilabel>

source: Applying a filter
fr: Appliquer un filtre
