Repository: JorisE/Gramps
Catalog: gramps2/help/*/*.po
Languages: fr

source: Like the previous web page generator, and most of the other GRAMPS reports, you can control what is included in the output by choosing a filter. Several default filters are provided for you, but you are free to use the Custom Filter Editor tool to create your own.
fr: Comme pour le précédent générateur, et la plupart des autres rapports GRAMPS, vous pouvez contrôler la sortie des données en choisissant un filtre. Plusieurs filtres par défaut existent, mais vous êtes libre d'utiliser l'outil de création de filtres pour générer les votres.

source: Any person matching this filter who is not excluded due to the privacy rules, will be included in the output. The default filter includes all people in the database.
fr: Toutes les personnes trouvées par le filtre et qui ne sont exclues par des règles privées , seront inclus dans la sortie. Le filtre par défaut inclut toute les personnes de la base de données.

source: Applying a style sheet
fr: Appliquer une feuille de style

source: GRAMPS provides six built in style sheets for your web page. Each of these style sheets produces a unique look for your pages. The generated style sheet is named <filename>narrative.css</filename>. You may edit this file if you wish to further customize your site.
fr: GRAMPS fournit six feuilles de style pour les pages web. Chacune produit un style unique pour vos pages. La feuille de style générée est appelée <filename>narrative.css</filename>. Vous pouvait la modifier si vous voulez changer le style de votre site

source: If you make modifications to your style sheet, you need to be aware the regenerating the pages with the same output directory will overwrite your changes to this file. To prevent this from happening, make sure you choose <guilabel>No style sheet</guilabel> for subsequent runs.
fr: Si vous faites des modifications, vous devez vous souvenir que regénérer un site dans le même répertoire écrasera vos changements sur la feuille de style. Pour le prévenir, utilisez <guilabel>Aucune feuille de style</guilabel> lors de la regénération du site.

source: Character set encoding
fr: L'encodage des caractères

source: Because of GRAMPS internationalization ability, the default character set for the HTML pages is UTF-8. This provides support for virtually all characters.
fr: Du fait des capacités d'internationalisation de GRAMPS, le caractère par défaut des pages HTML est UTF-8. Ce qui doit fournir un support pour tous les caractères.

source: The Apache web server is sometimes misconfigured to override the character set specified in an HTML page. This causes problems with the UTF-8 character set generated by GRAMPS, distorting characters on the screen.
fr: Le serveur web Apache est parfois mal configuré pour gérer les caractères spécifiés dans la page HTML. Celà pose problème avec le caractère UTF-8 généré par GRAMPS, supprimant les caractères de l'écran.

source: If your web server is misconfigured and you do not have priveledge to fix the configururation, you may solve this problem by overriding the default character set to match what your web server may be expecting.
fr: Si votre serveur web est mal configuré et que vous n'avez pas les privilèges pour corriger ce problème de configuration, vous pouvez le résoudre en changeant le caractère par défaut par celui accepté par votre serveur web.

source: Copyright notice
fr: Notice droit de copie

source: International copyright law reserves all rights to your data. You own the data, and people must get your permission to use it. In genealogy, however, sharing data is a common ideal. It this case, you may wish to grant the user more rights.
fr: Le droit international du copyright vous réserve tous les droits sur vos données. Avec vos propres données, les autres individus doivent vous demander les droits. En généalogie, même si le partage est un idéal commun. En réalité, vous pouvez accorder à l'utilisateur d'autres droits .

source: While the default for GRAMPS is to place a notice indicating that all rights are reserved, we give you the option to place your site under one of several of the Create Commons licenses. With a Creative Commons license, you grant user's certain permission to use your data without requiring them to contact you directly for permission.
fr: Par défaut GRAMPS place une notice indiquant tous les droits sont réservés, mais nous vous permettons de mettre votre site sous plusieurs licenses Create Commons. Avec une licence Creative Commons, vous accordez à l'utilisateur certaine permission pour utiliser vos données sans vous contacter directement pour vous demander la permission

source: See the <ulink url="http://creativecommons.org/" type="http">Creative Commons</ulink> web site for more information.
fr: Voir le site web de <ulink url="http://creativecommons.org/" type="http">Creative Commons</ulink> pour plus d'information.

source: Controlling page generation
fr: Controler la génération des pages

source: Three additional pages can be generated by the web page generator. The Home page is a page that will display an image and a whatever text you wish. To enable this page, choose a Media Object from the <guilabel>Home Media/Note ID</guilabel> menu on the <guilabel>Page Generation</guilabel> tab. If the Media Object contains an image, the image is displayed at the top of the page. If the Media Object contains a Note, the Note's text is used for the text of the page. A second page, the Introduction page, works similarly. Just choose the Media Object in the <guilabel>Introduction Media/Note ID</guilabel> menu.
fr: Trois pages aditionnelles peuvent être générées par le générateur de page web. La Home page est une page qui affiche une image et n'importe quel texte. Pour celà, choisissez un objet média depuis le menu <guilabel>Home Media/Note ID</guilabel> dans l'onglet <guilabel>Génération de page</guilabel>. Si l'objet média contient une image, une image sera affichée en haut de la page. Si l'objet média contient une note, le texte de la note sera utilisé pour le texte de la page. Une seconde page, la page d'introduction, fonctionne de la même façon. Seulement choisir l'objet média depuis le menu <guilabel>Introduction Media/Note ID</guilabel>.

source: If you choose to include a contact page, the researcher information stored in the database is displayed, along with the information specified in the <guilabel>Publisher contact/Note ID</guilabel> menu. Please use this page with caution, since you may consider your contact information to be private.
fr: Si vous choisissez d'inclure une page contact, les informations sur le chercheur stockées dans la base de données seront affichées, avec les informations spécifiées dans le menu <guilabel>Auteur contact/Note ID</guilabel>. S'il vous plait, vérifier si vous souhaitez que ces informations restent privées.

source: Privacy
fr: Vie privée

source: Privacy of personal information is an important issue on the web today. GRAMPS tries to give you control over the information that is presented.
fr: Les informations personnelles privées sont nécessaires sur le web. GRAMPS tente de vous laisser le contrôle sur les informations présentées.

source: GRAMPS provides two options to control the privacy of your information. If you select the <guilabel>Do not include records marked private</guilabel> option, any data that is marked as private will not be displayed on the generated site. If you select <guilabel>Restrict information on living people</guilabel>, GRAMPS will attempt to determine which people have the potential of still being alive, and will omit these people from the database. Some countries have laws that indicate that a certain number of years must pass after someone's death before information can be published. The <guilabel>Years to restrict from person's death</guilabel> option allows you to specifiy how many years a person must be deceased before the information is included.
fr: GRAMPS propose deux options pour contrôler les données privées de vos informations. Si vous sélectionnez l'option <guilabel>Ne pas inclure les fiches privées</guilabel> , aucune donnée marquée comme privée ne sera affichée sur le site web. Si vous sélectionnez l'option <guilabel>Restreindre l'information sur les personnes vivantes</guilabel>, GRAMPS va essayé de déterminer quelle personne sont potentiellement en vie, et va ignorer ces personnes de la base. Certains pays ont des lois qui indique qu'un certain nombre d'années doivent s'être écoulées avant que l'information ne puisse être publiée. L'option <guilabel>Années à restreindre depuis la mort de l'individu</guilabel> vous permet de spécifier jusqu'à combien d'années une personne décédée peut elle apparaître dans la base.

source: Please note that it is your responsibility to double check all information in the pages for any privacy information. GRAMPS cannot be held responsible for any privacy issues.
fr: S'il vous plait notez que c'est de votre responsabilité de vérifier les informations. GRAMPS ne peut pas être tenu pour responsable d'un problème de données privées

source: Adding custom code your pages
fr: Ajouter du code

source: If you are not interested in customizing your pages, you may skip the section.
fr: Si vous n'êtes pas intéressé pour améliorer vos pages, vous pouvez ignorer cette section.

source: The previous web generator allowed you to customize your pages using HTML templates. Your data would be substituted for certain markers in the code.
fr: Le précédent générateur de page web utilisait des modèles. Vos données pouvaient être substituées par certaines balises dans le code.

source: This method proved to be too cumbersome for most users. The Narrative Web Page Generator introduces a simpler mechanism. On the <guilabel>Page Generation</guilabel> tab, you may specify text (including HTML code) that will be inserted into each page, separately for the header and the footer.
fr: Cette méthode était trop encombrante pour la plupart des utilisateurs. Le générateur narratif de page web introduit un simple mécanisme. Dans l'onglet <guilabel>Génération de page</guilabel> , vous pouvez spécifier un texte (incluant du HTML) qui sera ajouté à chaque page, séparement pour l'en-tête et le pied de page.

source: To create this code, you need to create a Media Object marked as an internal note. To create this, add a new Media Object in the Media View, and select the internal note option. You may then enter your HTML code.
fr: Pour créer ce code, vous avez besoin de créer un objet média marqué comme une note interne. Pour celà, ajouter un nouveau objet média dans la vue des médias, et sélectionner l'option note interne. Vous pouvez maintenant entrer votre code HTML.

source: To insert the code from the internal notes into the web pages, select the appropriate Media Objects from the <guilabel>HTML user header</guilabel> and <guilabel>HTML user footer</guilabel> menus. Two div sections will be added to the pages - userheader and userfooter. The corresponding HTML code is inserted into the HTML page surrounded by div markers. You can customize your style sheet to provide additional formatting and positioning information to control these sections.
fr: Pour insérer le code de la note interne vers la page web,sélectionnez l'objet média approprié depuis les menus <guilabel>en-tête HTML utilisateur</guilabel> et <guilabel>pied de page HTML utilisateur</guilabel>. Deux sections div seront ajoutées aux pages - userheader et userfooter. Le code HTML correspondant sera encadré par les blocks balise div. Vous pouvez modifier votre feuille de style pour un formatage et un positionnement différent avec le contrôle de ces sections.

source: Running Tools
fr: Outils courants

source: GRAMPS tools allow you to perform various types of analysis of your genealogical data. Typically, the tools do not produce output in form of printouts or files. Instead, they produce screen output immediately available for the researcher. However, when appropriate, you can save the results of running a tool into a file. Tools present one of the major strengths of GRAMPS compared to the most genealogical software.
fr: Les outils de GRAMPS vous permettent d'exécuter divers types d'analyses de vos données généalogiques. Typiquement, les outils ne produisent pas le rendement sous la forme de liste imprimée ou de dossiers. Au lieu de cela, ils produisent le rendement d'écran immédiatement disponible pour le chercheur. Cependant vous pouvez enregistrer le résultat d'un outil dans un fichier. Les outils sont une des grandes forces de GRAMPS par rapport à la plupart des logiciels de généalogie.

source: The tools can be accessed through the menu by choosing <menuchoice><guimenu>Tools</guimenu><guisubmenu><replaceable>Tool Section</replaceable></guisubmenu><guimenuitem><replaceable>Particular Tool</replaceable></guimenuitem></menuchoice>. Alternatively, you can browse the complete selection of available tools along with their brief descriptions in a <guilabel>Tool Selection</guilabel> dialog invoked by clicking the <guibutton>Tools</guibutton> icon on the toolbar.
fr: Les outils peuvent être consultés par le menu en choisissant <menuchoice><guimenu>Outils</guimenu><guisubmenu><replaceable>Section Outil</replaceable></guisubmenu><guimenuitem><replaceable> Outil Particulier</replaceable></guimenuitem></menuchoice> Vous pouvez aussi avoir accès à la liste complète des outils avec leur brève description en utilisant l'icône <guibutton>Outils</guibutton> de la barre d'outils.

source: Analysis and Exploration
fr: Analyse et exploration

source: This section contains tools which analyze and explore the database, but do not alter it. The following analysis and exploration tools are currently available in GRAMPS:
fr: Ce groupe comprend les outils qui analysent et explorent la base de données sans la modifier. Les outils suivants sont actuellement disponibles dans GRAMPS :

source: Compare individual events
fr: Comparaison d'évènements individuels

source: This tool compares events across the selected group of people. The people for this comparison are chosen with the use of custom filters. The custom filters can be created in the Custom Filter Editor (see <xref linkend="tools-util-cfe"/>) that can be invoked by clicking the <guilabel>Custom Filter Editor</guilabel> button. The resulting table produced by this tool can be saved as a spreadsheet.
fr: Cet outil compare des évènements dans un ensemble de personnes. Les personnes à orendre en compte sont choisies par des filtres personnalisés. Ces filtres sont créés avec l'éditeur de filtres personnalisé (voir <xref linkend="tools-util-cfe"/>). La liste d'évènements produite peut être enregistrée comme tableau.

source: Interactive descendant browser
fr: Navigation interactive parmi les descendants

source: This tool builds a tree with the active person being the root. Children branch from their parents in the usual manner. Use this tool for a quick glance of a person's descendants.
fr: Cet outil construit un arbre descendant de la personne active. Les enfants sont les branches de l'arbre. Utiliser cet outil pour avoir une vue rapide sur la descendance d'une personne.

source: Double-clicking on tree node will bring up the <guilabel>Edit Person</guilabel> dialog allowing to view or modify the personal data.
fr: Double-cliquer sur les noeuds de l'arbre, ouvre la fenêtre <guilabel>Edition de l'individu</guilabel>, permettant de voir ou modifier les données individuelles.

source: Database Processing
fr: Traitement de base de données

source: This section contains tools which may modify your database. The tools from this section are used mostly for finding and correcting errors in the data. The following database processing tools are currently available in GRAMPS:
fr: Cette section décrit des outils qui peuvent modifier la base de données. Les modifications ne seront faites qu'avec votre accord explicite. Les outils décrits ici servent principalement à trouver et corriger les erreurs dans les données. Les outils suivants sont actuellement disponibles dans GRAMPS :

source: The modifications will only be performed upon your explicit consent, except for the automatic fixes performed by <guilabel>Check and repair database</guilabel> tool.
fr: Les modifications seront seulement effectuées avec votre consentement explicite, excepté pour les contrôles et les outils <guilabel>réparation de la base de données</guilabel>.

source: Check and repair database
fr: Vérifie et répare la base de données

source: This tool checks the database for integrity problems, fixing the problems it can. Specifically, the tool is checking for:
fr: Cet outil vérifie la base de données en recherchant les problèmes d'intégrité et en corrigeant ceux qu'il peut corriger. Dans le détail, cet outil détecte les défauts suivants :

source: Broken family links. These are the cases when a person's record refers to a family while the family's record does not refer to that person, and vice versa.
fr: Liens familiaux rompus. Ceci arrive quand une personne fait référence à une famille qui ne la connait pas ou vice versa.

source: Missing media objects. The missing media object is the object whose file is referenced in the database but does not exist. This can happen when the file is accidentally deleted, renamed, or moved to another location.
fr: Media introuvable. Un média introuvable est un objet multimédia dont le fichier est référencé dans la base de données mais absent. Ceci arrive quand le fichier est détruit, renommé ou bien encore déplacé ailleurs.

source: Empty families. These are the family entries which have no reference to any person as their member.
fr: Familles vides. Ce sont les entrées de famille qui n'ont aucune référence à toute personne en tant que leur membre.

source: Parent relationship. This checks all families to ensure that father and mother are not mixed up. The check is also made that parents have different gender. If they have common gender then their relationship is renamed to "Partners".
fr: Liens erronés entre Parents. Ceci vérifie les liens de la famille vers le père et la mère. Le sexe des parents doit aussi être différent. Si cela est détecté, la relation est modifiée en "Partenaires".

source: Extract information from names
fr: Extraction de données à partir du prénom

source: This tool searches the entire database and attempts to extract titles and nicknames that may be embedded in a person's <guilabel>Given name</guilabel> field. If any information could be extracted, the candidates for fixing will be presented in the table. You may then decide which to repair as suggested and which not to.
fr: Cet outil parcourt le base de données et cherche à extraire des titres et surnoms qui pourraient être inclus dans les champs <guilabel>Noms</guilabel>. Si des informations sont à extraire, les candidats pour la modification seront présentés dans un tableau. Vous pouvez alors décider de les modifier ou non.

source: Find possible duplicate people
fr: Recherche d'éventuels doublons

source: This tool searches the entire database, looking for the entries that may represent the same person.
fr: Cet outil parcourt le base de données et cherche les enregistrements qui pourraient décrire en réalité la même personne.

source: Fix capitalization of family names
fr: Norme sur les noms de famille

source: This tool searches the entire database and attempts to fix the capitalization of family names. The aim is to have conventional capitalization: capital first letter and lower case for the rest of the family name. If deviations from this rule are detected, the candidates for fixing will be presented in the table. You may then decide which to repair as suggested and which not to.
fr: Cet outil recherche dans la base de données les noms de famille pour les normaliser. Le but est d'avoir la norme conventionnelle: premières lettre en capital et des minuscules pour le reste du nom de famille. Si des déviations de cette règle sont détectées, les candidats pour la modification seront présentés dans un tableau. Vous pouvez alors décider de les modifier ou non.

source: Rename personal event types
fr: Renommer les événements individuels

source: This tool allows all the events of a certain name to be renamed to a new name.
fr: Cet outil renomme tous les évènements d'un type avec un nouveau nom.

source: Reorder GRAMPS IDs
fr: Réarrangement des identifiants GRAMPS

source: This tool reorders the GRAMPS IDs according to the defaults of GRAMPS.
fr: Cet outil réordonne les identifiants des objets de la base de données selon la méthode par défaut de GRAMPS.

source: Debug
fr: Corriger

source: This section contains debugging tools that are not of general interest for many of the users of GRAMPS. If you're not interested in debugging or developing GRAMPS you may safely skip this section.
fr: Cette section contient les outils de correction qui ne sont pas d'intérêt général pour la plupart des utilisateurs de GRAMPS. Si vous n'êtes pas intéressé pour corriger ou développer GRAMPS, vous pouvez sans risque sauter cette section.

source: Python evaluation window
fr: Fenêtre d'évaluation Python

source: Enter expression into the <guilabel>Evaluation Window</guilabel>, get the output in <guilabel>Output Window</guilabel>. Any errors should end up in the <guilabel>Error Window</guilabel>.
fr: Écrivez l'expression dans la <guilabel>fenêtre d'évaluation</guilabel> ,toutes les erreurs devraient apparaitre dans la <guilabel>fenêtre d'erreur</guilabel> du haut.

source: Reload plugins
fr: Recharger les Plugins

source: Makes an attempt to reload all plugins.
fr: Essaye de recharger tous les plugins.

source: This tool is itself a plugin, but it will not reload itself!
fr: Cet outil est lui-même un plugin, mais il ne se rechargera pas!

source: Show uncollected objects
fr: Afficher l'état des modules

source: Provides the window listing all uncollected objects. Depending on the system settings, recently abandoned GUI objects may still be uncollected.
fr: Fournit une fenêtre énumérant tous les objets non-chargés. Selon la configuration du système, des objets ne sont pas chargés par l'Interface Graphique de l'Utilisateur.

source: Utilities
fr: Utilitaires

source: This section contains tools allowing you to perform a simple operation on a portion of data. The results can be saved in your database, but they will not modify your existing data. The following utilities are currently available in GRAMPS:
fr: Cette section contient des outils vous permettant d'effectuer une opération simple sur une partie de données. Les résultats peuvent être sauvés dans votre base de données, mais ils ne modifieront pas vos données existantes. Les utilitaires suivants sont actuellement disponibles dans GRAMPS:

source: Custom Filter Editor
fr: Editeur de Filtre Personnalisé

source: The Custom Filter Editor builds custom filters that can be used to select people included in reports, exports, and other tools and utilities. This is in fact a very powerful tool in genealogical analysis.
fr: L'éditeur de filtre personnalisé construit des filtres qui peuvent être utilisés pour sélectionner des personnes dans les rapports, les exportations. C'est un outil très puissant en analyse généalogique.
